// AnimBlueprintGeneratedClass CH_PlayerStation_ABP.CH_PlayerStation_ABP_C
// Size: 0x2e9a (Inherited: 0x350)
struct UCH_PlayerStation_ABP_C : UYPlayerCharacterAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x350(0x08)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x358(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x380(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x4d8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x500(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x580(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x600(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x680(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x700(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x7a0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x840(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x8e0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x980(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x9b0(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0xa60(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xaa8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0xad0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xb18(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xc70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xc98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xcc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xce8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xd10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xd38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xd60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xd88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xdb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xdd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xe00(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xe28(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0xea8(0xc0)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_2; // 0xf68(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1058(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1088(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1108(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x1188(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x1228(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x1310(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x13f8(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1498(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x1560(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1648(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1678(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x1728(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x17c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x17f8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x1878(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1938(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1a20(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1a50(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x1ad0(0xc0)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x1b90(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1c80(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1cb0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1d30(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1df0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1ed8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1f08(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x1fb8(0x48)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x2000(0x190)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2190(0x190)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2320(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x23c0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2408(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x2430(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x2460(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x24a8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x24f0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x2538(0xc0)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_3; // 0x25f8(0x18)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2610(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x26d0(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2790(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x27c0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x28c8(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x28e8(0xa0)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_2; // 0x2988(0x18)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x29a0(0x108)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2aa8(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2b58(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2b78(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2b98(0x108)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x2ca0(0x18)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2cb8(0x20)
	float FinterpDeltaPitch; // 0x2cd8(0x04)
	float FinterpDeltaYaw; // 0x2cdc(0x04)
	bool IsAiming; // 0x2ce0(0x01)
	char pad_2CE1[0x3]; // 0x2ce1(0x03)
	float LowerbodyBlend; // 0x2ce4(0x04)
	bool DoRotationReset; // 0x2ce8(0x01)
	char pad_2CE9[0x3]; // 0x2ce9(0x03)
	float Speed; // 0x2cec(0x04)
	bool IsJumping; // 0x2cf0(0x01)
	bool IsCrouching; // 0x2cf1(0x01)
	char pad_2CF2[0x2]; // 0x2cf2(0x02)
	float Direction; // 0x2cf4(0x04)
	float DeltaWorldRotationYaw; // 0x2cf8(0x04)
	bool IsSprintng; // 0x2cfc(0x01)
	bool doJump; // 0x2cfd(0x01)
	char pad_2CFE[0x2]; // 0x2cfe(0x02)
	float JumpTime; // 0x2d00(0x04)
	float AimPitch; // 0x2d04(0x04)
	float AimPitchMultiplier; // 0x2d08(0x04)
	struct FRotator DeltaWorldRotation; // 0x2d0c(0x0c)
	bool isHacking; // 0x2d18(0x01)
	char pad_2D19[0x7]; // 0x2d19(0x07)
	struct UAnimMontage* AbilityMontage; // 0x2d20(0x08)
	struct FRotator InitialRotationYaw; // 0x2d28(0x0c)
	struct FRotator CurrentRotationYaw; // 0x2d34(0x0c)
	struct FRotator CurrentRotationPitch; // 0x2d40(0x0c)
	float DeltaTimeX; // 0x2d4c(0x04)
	struct AYPlayerCharacter* ShooterChar; // 0x2d50(0x08)
	float DeltaSpeed; // 0x2d58(0x04)
	float SpeedZ; // 0x2d5c(0x04)
	float DeltaSpeedInterp; // 0x2d60(0x04)
	float CrouchAlpha; // 0x2d64(0x04)
	struct FRotator AimRotation; // 0x2d68(0x0c)
	struct FRotator DeltaRotationYaw; // 0x2d74(0x0c)
	float AimYaw; // 0x2d80(0x04)
	struct FRotator DeltaRotationPitch; // 0x2d84(0x0c)
	bool IsRunOnDedicatedServer; // 0x2d90(0x01)
	char pad_2D91[0x3]; // 0x2d91(0x03)
	float IKAlpha; // 0x2d94(0x04)
	struct FVector RHandIKEffector; // 0x2d98(0x0c)
	struct FVector LHandEffector; // 0x2da4(0x0c)
	struct FVector LHAndEffectorInterp; // 0x2db0(0x0c)
	struct FVector RHandEffectorInterp; // 0x2dbc(0x0c)
	bool IKHandEnabled; // 0x2dc8(0x01)
	enum class EYEquipedWeaponPoseType EquipedPoseType; // 0x2dc9(0x01)
	bool IsDedicatedServer; // 0x2dca(0x01)
	char pad_2DCB[0x1]; // 0x2dcb(0x01)
	float AimposeAlpha; // 0x2dcc(0x04)
	bool ForceFullbody; // 0x2dd0(0x01)
	char pad_2DD1[0x7]; // 0x2dd1(0x07)
	struct UAnimMontage* EmoteVariable; // 0x2dd8(0x08)
	bool IsSliding; // 0x2de0(0x01)
	char pad_2DE1[0x3]; // 0x2de1(0x03)
	float 3rdPLegIK; // 0x2de4(0x04)
	bool isEmoting; // 0x2de8(0x01)
	enum class EYEquipedAnimationWeaponType EquipedWeaponType; // 0x2de9(0x01)
	char pad_2DEA[0x2]; // 0x2dea(0x02)
	float JumpSpeedZ; // 0x2dec(0x04)
	float InitialJumpVelocity; // 0x2df0(0x04)
	enum class EYDeviceCategory EquipedDeviceCategory; // 0x2df4(0x01)
	bool force3rdPLanding; // 0x2df5(0x01)
	bool IsVehicle; // 0x2df6(0x01)
	char pad_2DF7[0x1]; // 0x2df7(0x01)
	struct FRotator Rotator; // 0x2df8(0x0c)
	struct FRotator CapsuleRotation; // 0x2e04(0x0c)
	struct FRotator cameraPawnDelta; // 0x2e10(0x0c)
	char pad_2E1C[0x4]; // 0x2e1c(0x04)
	struct UYPlayerMovementComponent* PlayerMoveComponent; // 0x2e20(0x08)
	struct UAnimMontage* DeathEmote; // 0x2e28(0x08)
	bool IsStation; // 0x2e30(0x01)
	char pad_2E31[0x3]; // 0x2e31(0x03)
	float DirectionFlipped; // 0x2e34(0x04)
	float SlideTiltADSAlpha; // 0x2e38(0x04)
	float AdditiveAlphaFloat; // 0x2e3c(0x04)
	struct UYWeaponPlayerControllerRuntimeComponent* WeaponRuntimeComponentRef; // 0x2e40(0x08)
	float TurningDirection; // 0x2e48(0x04)
	float FInterpDeltaSpringYaw; // 0x2e4c(0x04)
	struct FFloatSpringState YawSpringState; // 0x2e50(0x08)
	bool doJumpReset; // 0x2e58(0x01)
	char pad_2E59[0x3]; // 0x2e59(0x03)
	float FinterpDeltaSpringPitch; // 0x2e5c(0x04)
	struct FFloatSpringState PitchSpringState; // 0x2e60(0x08)
	struct UYPlayerCharacterStateComponent* CharStateComponent; // 0x2e68(0x08)
	struct FRotator CameraAim1PPRotator; // 0x2e70(0x0c)
	struct FRotator InvertedDeltaWorldRotation; // 0x2e7c(0x0c)
	bool IsIdle; // 0x2e88(0x01)
	char pad_2E89[0x3]; // 0x2e89(0x03)
	float JumpUpNormTIme; // 0x2e8c(0x04)
	float JumpDownNormTIme; // 0x2e90(0x04)
	float TurnFinterpDeltaYaw; // 0x2e94(0x04)
	bool IsTurningLeft; // 0x2e98(0x01)
	bool IsTurning; // 0x2e99(0x01)

	struct UAnimMontage* GetDeathAnimationToPlay(struct FYDealtDamageData Tags); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.GetDeathAnimationToPlay // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void 3rdP(struct FPoseLink 3rdP); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.3rdP // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void AnimGraph(struct FPoseLink AnimGraph); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void SetIsTurning(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.SetIsTurning // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void ClampInterpDelta(float Value, float clampedValue); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.ClampInterpDelta // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1e02480
	void SetAimAndDirectionVariables(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.SetAimAndDirectionVariables // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void CalculateInterpolationValues(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.CalculateInterpolationValues // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void SetLowerbodyBlend(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.SetLowerbodyBlend // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void HandleAimOffsetRotationReset(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.HandleAimOffsetRotationReset // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void Set Speed And Movement Variables(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.Set Speed And Movement Variables // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_FB5FF52B4CBB5BFE2E8FEB9BB007AC06(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_FB5FF52B4CBB5BFE2E8FEB9BB007AC06 // (BlueprintEvent) // @ game+0x1e02480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_01B14A5F4CC6BE4B19E1F483D0C01772(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_01B14A5F4CC6BE4B19E1F483D0C01772 // (BlueprintEvent) // @ game+0x1e02480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_20E202D0442920CA857EFE824DEAE5E5(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_20E202D0442920CA857EFE824DEAE5E5 // (BlueprintEvent) // @ game+0x1e02480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_79CBEBF84887BD34EB7B97AF46533DDC(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_79CBEBF84887BD34EB7B97AF46533DDC // (BlueprintEvent) // @ game+0x1e02480
	void EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_35BA399A4E700EF7BEC0E9BB71C1D3D4(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_CH_PlayerStation_ABP_AnimGraphNode_TransitionResult_35BA399A4E700EF7BEC0E9BB71C1D3D4 // (BlueprintEvent) // @ game+0x1e02480
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void BlueprintInitializeAnimation(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void UpdateRecallmesh(bool RecallState); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.UpdateRecallmesh // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void AnimNotify_TurnIK_Off(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.AnimNotify_TurnIK_Off // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void AnimNotify_TurnIK_On(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.AnimNotify_TurnIK_On // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void SendTurnDeltaOffsetToWeapon(float DYaw, float DPitch); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.SendTurnDeltaOffsetToWeapon // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void IsFirstPersonWeapon(bool IsFirstPerson); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.IsFirstPersonWeapon // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void DoPactWave(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.DoPactWave // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void OnPlayPactAccept(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.OnPlayPactAccept // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void OnPlayPactDeny(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.OnPlayPactDeny // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void OnPlayerStateAssigned(struct AYPlayerState* PlayerState); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.OnPlayerStateAssigned // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void WalkOut(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.WalkOut // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void AnimNotify_ForceFullbody(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.AnimNotify_ForceFullbody // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void AnimNotify_DisableForceFullbodz(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.AnimNotify_DisableForceFullbodz // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void EmoteStop(bool interupted); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.EmoteStop // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void LightImpact(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.LightImpact // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void OnJumped(int32_t jumpCount); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.OnJumped // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void jumpLand(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.jumpLand // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void BindOnCommwheelUsed(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.BindOnCommwheelUsed // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void OnCommWheelUse(struct UYCommWheelVOComponent* commWheelComponent, struct FDataTableRowHandle commWheelEntry); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.OnCommWheelUse // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void SetUnarmedMode(bool Unarmed); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.SetUnarmedMode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void DoPointForward(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.DoPointForward // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void OnBannerStarted(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.OnBannerStarted // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void OnGlobalVanityEntryUpdatedDelegate_Event_1(struct TArray<enum class EYVanityType> Types); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.OnGlobalVanityEntryUpdatedDelegate_Event_1 // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void DisableWeaponSway(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.DisableWeaponSway // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void BindOnEmoted(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.BindOnEmoted // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void OnEmoted(struct FYGlobalVanityItem usedEmote, struct AActor* Instigator); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.OnEmoted // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void BP_SetIsFirstPerson(bool firstPersonState); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.BP_SetIsFirstPerson // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void AnimNotify_Jumpreset(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.AnimNotify_Jumpreset // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void AnimNotify_EnteredJumpStart(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.AnimNotify_EnteredJumpStart // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void ResetCounterRotation(); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.ResetCounterRotation // (BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void BP_PlayWeaponState(enum class EYWeaponPlayState State); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.BP_PlayWeaponState // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void ExecuteUbergraph_CH_PlayerStation_ABP(int32_t EntryPoint); // Function CH_PlayerStation_ABP.CH_PlayerStation_ABP_C.ExecuteUbergraph_CH_PlayerStation_ABP // (Final|UbergraphFunction|HasDefaults) // @ game+0x1e02480
};

