// UserDefinedStruct LightningTuningDataInfo.LightningTuningDataInfo
// Size: 0x1d (Inherited: 0x00)
struct FLightningTuningDataInfo {
	float DistanceFromPlayerMin_3_F4D76B234A12E2778F754C91D3C00D5F; // 0x00(0x04)
	float DistanceFromPlayerMax_7_A19470F14CA0202A8DA8928C10300050; // 0x04(0x04)
	float CooldownMin_10_34238BE249F635E9D30E5D8984C934E5; // 0x08(0x04)
	float CooldownMax_11_5EB969F24B410BAE7E702BBEA5797E9E; // 0x0c(0x04)
	float LightningWarningTime_17_E4FBC2B9497042C5251E7EAD754139EB; // 0x10(0x04)
	float Damage_27_5819B0B94E931BEF3EFC4C8C73DF31F3; // 0x14(0x04)
	float DamageRadius_29_3438EAD94CEF46EF4A0BC0A172A69988; // 0x18(0x04)
	bool IsDebugForcedEnabled_34_0D770C7A476CD9B6A977AFB2D66EF13C; // 0x1c(0x01)
};

