// Class Prospect.YCharacterCustomizationActor
// Size: 0x5a0 (Inherited: 0x4e0)
struct AYCharacterCustomizationActor : ACharacter {
	char pad_4E0[0x10]; // 0x4e0(0x10)
	struct UYCameraInteractionComponent* m_interactionComponent; // 0x4f0(0x08)
	struct UYCustomizationCameraComponent* m_customizationCameraComponent; // 0x4f8(0x08)
	char pad_500[0x10]; // 0x500(0x10)
	struct TArray<struct FYCharacterCustomizationActorActiveVisualizationEntry> m_activeVisualizedCustomizationEntries; // 0x510(0x10)
	struct FDataTableRowHandle m_equippedWeaponHandle; // 0x520(0x10)
	struct TArray<struct FDataTableRowHandle> m_equippedVanityHandles; // 0x530(0x10)
	struct TArray<struct AYCharacterCustomizationActor*> m_childCustomizationActors; // 0x540(0x10)
	bool m_clearMaterial; // 0x550(0x01)
	bool m_reactToGLobalVanityUpdates; // 0x551(0x01)
	bool m_attachToLocalPlayerAtStart; // 0x552(0x01)
	bool m_useMeshMerging; // 0x553(0x01)
	bool m_shouldSkelMeshComponentsSyncAttachParrentLOD; // 0x554(0x01)
	char pad_555[0x3]; // 0x555(0x03)
	struct TArray<struct USkeletalMesh*> m_meshToUseForMeshMerging; // 0x558(0x10)
	char pad_568[0x8]; // 0x568(0x08)
	struct TArray<enum class EYCustomizationCategory> m_visualizationCategoriesToDisable; // 0x570(0x10)
	char pad_580[0x8]; // 0x580(0x08)
	struct AActor* m_explicitCustomizationActor; // 0x588(0x08)
	struct AActor* m_playerCharacterCustomizationActor; // 0x590(0x08)
	bool m_bindToPlayerStateData; // 0x598(0x01)
	char pad_599[0x7]; // 0x599(0x07)

	void SetPlayerStateData(struct APlayerState* playerStateData); // Function Prospect.YCharacterCustomizationActor.SetPlayerStateData // (Native|Public|BlueprintCallable) // @ game+0x118bbc0
	void SetCategoryVisualized(enum class EYCustomizationCategory Category); // Function Prospect.YCharacterCustomizationActor.SetCategoryVisualized // (Final|Native|Protected|BlueprintCallable) // @ game+0x192b8c0
	void RefreshActiveCustomizationData(struct FYActiveCustomizationData oldData, struct FYActiveCustomizationData customizationData, bool forceRefresh); // Function Prospect.YCharacterCustomizationActor.RefreshActiveCustomizationData // (Final|Native|Public) // @ game+0x192b200
	void OnWorldLocationChanged(struct FTransform worldOffsetLocation); // Function Prospect.YCharacterCustomizationActor.OnWorldLocationChanged // (Native|Protected|HasDefaults) // @ game+0x192b110
	void OnOnCustomizationCategoryChanged(enum class EYCustomizationCategory newCategory); // Function Prospect.YCharacterCustomizationActor.OnOnCustomizationCategoryChanged // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
	void OnInitializeEquippedWeapon(struct FDataTableRowHandle desiredRowHandle, struct TArray<struct FDataTableRowHandle> vanityEntries); // Function Prospect.YCharacterCustomizationActor.OnInitializeEquippedWeapon // (Final|Native|Protected) // @ game+0x192acf0
	void OnGlobalVanityUpdated(); // Function Prospect.YCharacterCustomizationActor.OnGlobalVanityUpdated // (Native|Protected) // @ game+0x192acb0
	void OnFinishedAsyncLoading(struct FYCharacterCustomizationBodyPart bodyPart); // Function Prospect.YCharacterCustomizationActor.OnFinishedAsyncLoading // (Final|Native|Protected) // @ game+0x192a9d0
	void OnCharacterCustomizationLoadedSignature__DelegateSignature(); // DelegateFunction Prospect.YCharacterCustomizationActor.OnCharacterCustomizationLoadedSignature__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
	void OnCategoryClickedCallback(enum class EYCustomizationCategory Category); // Function Prospect.YCharacterCustomizationActor.OnCategoryClickedCallback // (Final|Native|Public) // @ game+0x192a740
	void HandlePlayerStateSet(); // Function Prospect.YCharacterCustomizationActor.HandlePlayerStateSet // (Final|Native|Protected) // @ game+0x192a3d0
	void BP_SetWeaponAnimationPose(enum class EYEquipedWeaponPoseType pose); // Function Prospect.YCharacterCustomizationActor.BP_SetWeaponAnimationPose // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
	void BP_SetPlayerState(struct APlayerState* playerStateData); // Function Prospect.YCharacterCustomizationActor.BP_SetPlayerState // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
	void BP_SetEmote(struct FYCharacterCustomizationRowBase deathEmoteRowBase); // Function Prospect.YCharacterCustomizationActor.BP_SetEmote // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1e02480
	void BP_SetDeathEmote(struct FYCharacterCustomizationRowBase deathEmoteRowBase); // Function Prospect.YCharacterCustomizationActor.BP_SetDeathEmote // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1e02480
	void BP_PlayCustomizationMontage(struct UAnimMontage* Montage, enum class EYCustomizationCategory Category); // Function Prospect.YCharacterCustomizationActor.BP_PlayCustomizationMontage // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
	void BP_OnShowCustomizationCategory(struct FYShowBodyTypeCategoryUpdateData customizationCategory); // Function Prospect.YCharacterCustomizationActor.BP_OnShowCustomizationCategory // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void BP_OnResetRequest(enum class EYCharacterVanityResetRequest resetRequest); // Function Prospect.YCharacterCustomizationActor.BP_OnResetRequest // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void BP_OnEOMMapLoaded(); // Function Prospect.YCharacterCustomizationActor.BP_OnEOMMapLoaded // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
	void BP_OnActiveCustomizationDataChanged(struct FYActiveCustomizationData newCustomizationData); // Function Prospect.YCharacterCustomizationActor.BP_OnActiveCustomizationDataChanged // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YCharacterCustomizationExplicitCustomizationActor
// Size: 0x710 (Inherited: 0x5a0)
struct AYCharacterCustomizationExplicitCustomizationActor : AYCharacterCustomizationActor {
	struct FString m_cameraSuffix; // 0x5a0(0x10)
	struct FString m_previewCameraSuffix; // 0x5b0(0x10)
	struct FYCustomizationExplicitActorInitializationData m_initializationData; // 0x5c0(0x140)
	char pad_700[0x1]; // 0x700(0x01)
	bool m_registerCustomizationModeAssociation; // 0x701(0x01)
	char pad_702[0xe]; // 0x702(0x0e)

	void OnCharacterCustomizationLoadedCallback(); // Function Prospect.YCharacterCustomizationExplicitCustomizationActor.OnCharacterCustomizationLoadedCallback // (Final|Native|Public) // @ game+0x192fad0
	void BP_OnVisualziationState(struct FYCharacterVisualizationRuntimeData Data); // Function Prospect.YCharacterCustomizationExplicitCustomizationActor.BP_OnVisualziationState // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.AYNPCCharacter
// Size: 0x710 (Inherited: 0x710)
struct AAYNPCCharacter : AYCharacterCustomizationExplicitCustomizationActor {
};

// Class Prospect.DA_Escape
// Size: 0x80 (Inherited: 0x30)
struct UDA_Escape : UDataAsset {
	float m_escapeTime; // 0x30(0x04)
	int32_t m_escapeLocations; // 0x34(0x04)
	struct USkeletalMesh* m_escapeShipSK; // 0x38(0x08)
	struct UAnimationAsset* m_flyingAnim; // 0x40(0x08)
	struct UAnimationAsset* m_hoverAnim; // 0x48(0x08)
	struct UAnimationAsset* m_landedAnim; // 0x50(0x08)
	struct UAnimationAsset* m_takingOffAnim; // 0x58(0x08)
	float m_landingPauzeTime; // 0x60(0x04)
	float m_landingTime; // 0x64(0x04)
	float m_landedTime; // 0x68(0x04)
	float m_departureAlarmTime; // 0x6c(0x04)
	struct UStaticMesh* m_escapeConsoleSM; // 0x70(0x08)
	float m_consoleCooldownTime; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Prospect.DA_Uplink
// Size: 0xd0 (Inherited: 0x30)
struct UDA_Uplink : UDataAsset {
	float m_durationUpdateCommon; // 0x30(0x04)
	float m_durationUpdateUnCommon; // 0x34(0x04)
	float m_durationUpdateRare; // 0x38(0x04)
	float m_durationUpdateEpic; // 0x3c(0x04)
	struct USkeletalMesh* m_uplinkSkeletalMesh; // 0x40(0x08)
	struct USoundBase* m_soundUpdateStart; // 0x48(0x08)
	struct USoundBase* m_soundUpdateInterupt; // 0x50(0x08)
	struct USoundBase* m_soundUpdateCompleted; // 0x58(0x08)
	struct USoundBase* m_soundUpdateWhile; // 0x60(0x08)
	struct USoundBase* m_soundPowerGain; // 0x68(0x08)
	struct USoundBase* m_soundPowerLoss; // 0x70(0x08)
	float m_durationInteractConsole; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct UStaticMesh* m_consoleMesh; // 0x80(0x08)
	struct USoundBase* m_soundConsoleStartUpdate; // 0x88(0x08)
	struct USoundBase* m_soundConsoleInteruptUpdate; // 0x90(0x08)
	struct USoundBase* m_soundConsoleCompleteUpdate; // 0x98(0x08)
	struct USoundBase* m_soundConsolePowerGain; // 0xa0(0x08)
	struct USoundBase* m_soundConsolePowerLoss; // 0xa8(0x08)
	float m_durationFuseBoxInteract; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct UStaticMesh* m_FuseBoxMesh; // 0xb8(0x08)
	struct USoundBase* m_SoundEnable; // 0xc0(0x08)
	struct USoundBase* m_SoundDisable; // 0xc8(0x08)
};

// Class Prospect.TestRootScreenController
// Size: 0xb0 (Inherited: 0xb0)
struct UTestRootScreenController : UActorComponent {

	void OnOpenScreenButton(); // Function Prospect.TestRootScreenController.OnOpenScreenButton // (Final|Native|Public) // @ game+0xfa96f0
	void OnLeftState(); // Function Prospect.TestRootScreenController.OnLeftState // (Native|Protected) // @ game+0x18f3bd0
	void OnEnteredState(); // Function Prospect.TestRootScreenController.OnEnteredState // (Native|Protected) // @ game+0x18f3bb0
	void OnCloseScreenButton(); // Function Prospect.TestRootScreenController.OnCloseScreenButton // (Final|Native|Public) // @ game+0xfa96f0
};

// Class Prospect.TestScreen1Controller
// Size: 0xb0 (Inherited: 0xb0)
struct UTestScreen1Controller : UActorComponent {

	void OnOpenScreenButton(); // Function Prospect.TestScreen1Controller.OnOpenScreenButton // (Final|Native|Public) // @ game+0xfa96f0
	void OnLeftState(); // Function Prospect.TestScreen1Controller.OnLeftState // (Native|Protected) // @ game+0x18f3bd0
	void OnEnteredState(); // Function Prospect.TestScreen1Controller.OnEnteredState // (Native|Protected) // @ game+0x18f3bb0
	void OnCloseScreenButton(); // Function Prospect.TestScreen1Controller.OnCloseScreenButton // (Final|Native|Public) // @ game+0xfa96f0
};

// Class Prospect.TestScreen2Controller
// Size: 0xb0 (Inherited: 0xb0)
struct UTestScreen2Controller : UActorComponent {

	void OnOpenScreenButton(); // Function Prospect.TestScreen2Controller.OnOpenScreenButton // (Final|Native|Public) // @ game+0xfa96f0
	void OnLeftState(); // Function Prospect.TestScreen2Controller.OnLeftState // (Native|Protected) // @ game+0x18f3bd0
	void OnEnteredState(); // Function Prospect.TestScreen2Controller.OnEnteredState // (Native|Protected) // @ game+0x18f3bb0
	void OnCloseScreenButton(); // Function Prospect.TestScreen2Controller.OnCloseScreenButton // (Final|Native|Public) // @ game+0xfa96f0
};

// Class Prospect.TestModel
// Size: 0xb0 (Inherited: 0xb0)
struct UTestModel : UActorComponent {

	struct FString GetSomeData(); // Function Prospect.TestModel.GetSomeData // (Final|Native|Public) // @ game+0x18f3680
};

// Class Prospect.State
// Size: 0x40 (Inherited: 0x28)
struct UState : UObject {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class Prospect.RootState
// Size: 0x40 (Inherited: 0x40)
struct URootState : UState {
};

// Class Prospect.TestScreenRoot
// Size: 0x80 (Inherited: 0x40)
struct UTestScreenRoot : URootState {
	char pad_40[0x18]; // 0x40(0x18)
	SoftClassProperty m_widgetBp; // 0x58(0x28)
};

// Class Prospect.TestState1
// Size: 0x40 (Inherited: 0x40)
struct UTestState1 : UState {
};

// Class Prospect.TestScreen1
// Size: 0x80 (Inherited: 0x40)
struct UTestScreen1 : UTestState1 {
	char pad_40[0x18]; // 0x40(0x18)
	SoftClassProperty m_widgetBp; // 0x58(0x28)
};

// Class Prospect.TestState2
// Size: 0x40 (Inherited: 0x40)
struct UTestState2 : UState {
};

// Class Prospect.TestScreen2
// Size: 0x80 (Inherited: 0x40)
struct UTestScreen2 : UTestState2 {
	char pad_40[0x18]; // 0x40(0x18)
	SoftClassProperty m_widgetBp; // 0x58(0x28)
};

// Class Prospect.YChatExternalFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYChatExternalFunctions : UObject {

	bool IsUserMuted(struct FString UserId, bool isVoice); // Function Prospect.YChatExternalFunctions.IsUserMuted // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x18f3830
	bool IsPlayerNameMuted(struct AActor* actorContext, struct FString playerName, bool isVoice); // Function Prospect.YChatExternalFunctions.IsPlayerNameMuted // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f3700
	struct FText ChannelTypeToText(struct UObject* objectContext, enum class EYChannelType ChannelType); // Function Prospect.YChatExternalFunctions.ChannelTypeToText // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f25c0
};

// Class Prospect.YAbilityActor
// Size: 0x258 (Inherited: 0x240)
struct AYAbilityActor : AActor {
	char pad_240[0x8]; // 0x240(0x08)
	struct FDataTableRowHandle m_spawnedRowHandle; // 0x248(0x10)
};

// Class Prospect.YAbilityAnalyticsComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UYAbilityAnalyticsComponent : UActorComponent {
	struct TArray<struct FYAbilityAnalyticsPerPlayer> m_abilityPerPlayerAnalytics; // 0xb0(0x10)

	void SendDropAbilityData(struct AActor* playerControllerActor, struct FDataTableRowHandle abilityRowHandle); // Function Prospect.YAbilityAnalyticsComponent.SendDropAbilityData // (Final|Native|Public|HasOutParms) // @ game+0x18f3bf0
	void OnAbilityUsed(struct AActor* PlayerController, struct FYInventoryItem inventoryItem); // Function Prospect.YAbilityAnalyticsComponent.OnAbilityUsed // (Final|Native|Public|HasOutParms) // @ game+0x18f3a60
	void OnAbilityEquipped(struct AActor* PlayerController, struct FYInventoryItem inventoryItem); // Function Prospect.YAbilityAnalyticsComponent.OnAbilityEquipped // (Final|Native|Public|HasOutParms) // @ game+0x18f3910
};

// Class Prospect.YAbilityContextUtils
// Size: 0x28 (Inherited: 0x28)
struct UYAbilityContextUtils : UObject {
};

// Class Prospect.YAbilityExternalFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAbilityExternalFunctions : UObject {

	bool FindWeaponTuningData(struct FDataTableRowHandle weaponTransportRow, struct FYWeaponTuningDataTableRow outData); // Function Prospect.YAbilityExternalFunctions.FindWeaponTuningData // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f3540
	bool FindSurveillanceAbilityDataFromObject(struct UObject* relevantObject, struct FYAbilityActionSurveillanceData outData); // Function Prospect.YAbilityExternalFunctions.FindSurveillanceAbilityDataFromObject // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f33a0
	bool FindSpawnedDatatableRowHandleFromObject(struct UObject* relevantObject, struct FDataTableRowHandle outRowHandle); // Function Prospect.YAbilityExternalFunctions.FindSpawnedDatatableRowHandleFromObject // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f32c0
	bool FindKineticShieldAbilityDataFromObject(struct UObject* relevantObject, struct FYAbilityActionKineticShieldData outData); // Function Prospect.YAbilityExternalFunctions.FindKineticShieldAbilityDataFromObject // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f3100
	bool FindHealWardAbilityDataFromObject(struct UObject* relevantObject, struct FYAbilityActionHealWardData outData); // Function Prospect.YAbilityExternalFunctions.FindHealWardAbilityDataFromObject // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f2f50
	bool FindCloakAbilityDataFromObject(struct UObject* relevantObject, struct FYAbilityActionCloakData outData); // Function Prospect.YAbilityExternalFunctions.FindCloakAbilityDataFromObject // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f2da0
	bool FindBombardmentAbilityDataFromObject(struct UObject* relevantObject, struct FYAbilityActionBombardmentData outData); // Function Prospect.YAbilityExternalFunctions.FindBombardmentAbilityDataFromObject // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f2bd0
	bool FindBlinkAbilityDataFromObject(struct UObject* relevantObject, struct FYAbilityActionBlinkData outData); // Function Prospect.YAbilityExternalFunctions.FindBlinkAbilityDataFromObject // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f2a20
	bool FindAbilityActionDataFromObject(struct UObject* relevantObject, struct FYAbilityActionDataTableRow outData); // Function Prospect.YAbilityExternalFunctions.FindAbilityActionDataFromObject // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f2880
	int32_t ExecuteAbilityTransport(struct FYAbilityTransportInitializationData executionInitData); // Function Prospect.YAbilityExternalFunctions.ExecuteAbilityTransport // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x18f27e0
	float DetermineActiveTimeTotal(struct FDataTableRowHandle abilityRow, struct UObject* contextPlayerObject); // Function Prospect.YAbilityExternalFunctions.DetermineActiveTimeTotal // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x18f26f0
};

// Class Prospect.YAbilityPossessionActor
// Size: 0x240 (Inherited: 0x240)
struct AYAbilityPossessionActor : AActor {

	void BP_OnPossesionStateChanged(bool newState); // Function Prospect.YAbilityPossessionActor.BP_OnPossesionStateChanged // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YAbstractMissionActor
// Size: 0x240 (Inherited: 0x240)
struct AYAbstractMissionActor : AActor {
};

// Class Prospect.YActivities_DeveloperSettings
// Size: 0x68 (Inherited: 0x38)
struct UYActivities_DeveloperSettings : UDeveloperSettings {
	enum class EYDebugActivitySpawnMode m_debugSpawnActivityMode; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FDataTableRowHandle m_debugSet; // 0x40(0x10)
	struct TArray<enum class EYActivityType> m_debugActivities; // 0x50(0x10)
	bool m_bEnableRandomSeedOverride; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	int32_t m_randomizationSeed; // 0x64(0x04)
};

// Class Prospect.YActivitiesManager
// Size: 0x130 (Inherited: 0xb0)
struct UYActivitiesManager : UActorComponent {
	struct TArray<struct UYActivityComponent*> m_activityComponents; // 0xb0(0x10)
	int32_t m_spawnRequestsAllowedPerFrame; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct TArray<struct FYSpawnActivityActorTokenData> m_spawnTokens; // 0xc8(0x10)
	struct TArray<enum class EYActivityType> m_activeActivityTypes; // 0xd8(0x10)
	struct FDataTableRowHandle m_activitySet; // 0xe8(0x10)
	struct TArray<struct AYActivityActorManager*> m_activities; // 0xf8(0x10)
	char pad_108[0x8]; // 0x108(0x08)
	struct FMulticastInlineDelegate OnActivitiesSpawned; // 0x110(0x10)
	struct FMulticastInlineDelegate OnSpawnTokensEmpty; // 0x120(0x10)

	void OnActivitiesLoaded(); // Function Prospect.YActivitiesManager.OnActivitiesLoaded // (Final|Native|Public) // @ game+0x18f8eb0
	bool IsActivityActive(enum class EYActivityType Type); // Function Prospect.YActivitiesManager.IsActivityActive // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x18f8c80
	struct AYActivityActorManager* GetActivityByType(enum class EYActivityType activityType); // Function Prospect.YActivitiesManager.GetActivityByType // (Final|Native|Public|BlueprintCallable) // @ game+0x18f85a0
	struct TArray<struct AYActivityActorManager*> GetActivities(); // Function Prospect.YActivitiesManager.GetActivities // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18f84e0
	struct UYActivitiesManager* FindActivitiesManager(struct UObject* WorldContextObject); // Function Prospect.YActivitiesManager.FindActivitiesManager // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f8450
	bool AddSpawnActivityActorToken(struct FYSpawnActivityActorTokenData requestData); // Function Prospect.YActivitiesManager.AddSpawnActivityActorToken // (Final|Native|Public|BlueprintCallable) // @ game+0x18f8390
};

// Class Prospect.YActivityActorInterface
// Size: 0x28 (Inherited: 0x28)
struct UYActivityActorInterface : UInterface {

	struct FVector GetDrawDebugLineTo(); // Function Prospect.YActivityActorInterface.GetDrawDebugLineTo // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct FColor GetDrawDebugLineColor(); // Function Prospect.YActivityActorInterface.GetDrawDebugLineColor // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct FString GetDebugDescription(); // Function Prospect.YActivityActorInterface.GetDebugDescription // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YActivityActorManager
// Size: 0x2c0 (Inherited: 0x240)
struct AYActivityActorManager : AActor {
	struct UYActivityRegisterComponent* m_registerComponent; // 0x240(0x08)
	enum class EYActivityType m_activityType; // 0x248(0x01)
	char pad_249[0x7]; // 0x249(0x07)
	struct UObject* m_defaultActivityActorClass; // 0x250(0x08)
	char pad_258[0x58]; // 0x258(0x58)
	struct FMulticastInlineDelegate BP_OnInitialActorSpawningFinished; // 0x2b0(0x10)

	struct TArray<struct AActor*> GetSpecialDebugActors(); // Function Prospect.YActivityActorManager.GetSpecialDebugActors // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	int32_t GetNumSpawnedActors(); // Function Prospect.YActivityActorManager.GetNumSpawnedActors // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x18f8b80
	int32_t GetDesiredActorCount(); // Function Prospect.YActivityActorManager.GetDesiredActorCount // (Final|Native|Public|BlueprintCallable) // @ game+0x18f89f0
	struct FYActivityDataTableRow GetActivityTuning(); // Function Prospect.YActivityActorManager.GetActivityTuning // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18f8660
	void DebugRequestTriggerActivity(struct APlayerController* requestingPlayer); // Function Prospect.YActivityActorManager.DebugRequestTriggerActivity // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct AActor* BP_SpawnActivityActorFromToken(struct FYSpawnActivityActorTokenData requestData); // Function Prospect.YActivityActorManager.BP_SpawnActivityActorFromToken // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1e02480
	struct FString BP_GetDebugDescription(); // Function Prospect.YActivityActorManager.BP_GetDebugDescription // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YActivityComponent
// Size: 0x128 (Inherited: 0xb0)
struct UYActivityComponent : UActorComponent {
	bool m_destroySkeletalMeshesOnDedicatedServer; // 0xb0(0x01)
	bool m_isPlacedInWorld; // 0xb1(0x01)
	char pad_B2[0x6]; // 0xb2(0x06)
	struct AYActivityActorManager* m_activityActorManager; // 0xb8(0x08)
	struct UYActivityRegisterComponent* m_registerComponent; // 0xc0(0x08)
	struct AYActivityLocation* m_activityLocation; // 0xc8(0x08)
	bool m_isMarkedAsDepleted; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)
	struct FString m_activitySubType; // 0xd8(0x10)
	struct FString m_actorBIName; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnActivityActorDepleted; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnActivitySetupComplete; // 0x108(0x10)
	struct FMulticastInlineDelegate OnActivitySetupCompletePlacedInWorld; // 0x118(0x10)

	void SetupActivityComponent(struct AYActivityActorManager* Activity, struct AYActivityLocation* activityLocation, struct UYActivityRegisterComponent* registerOverride); // Function Prospect.YActivityComponent.SetupActivityComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x18f9190
	void MarkActivityActorAsDepleted(); // Function Prospect.YActivityComponent.MarkActivityActorAsDepleted // (Final|Native|Public|BlueprintCallable) // @ game+0x18f8e90
	enum class EYActivityType GetActivityType(); // Function Prospect.YActivityComponent.GetActivityType // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x18f87e0
	struct AYActivityLocation* GetActivityLocation(); // Function Prospect.YActivityComponent.GetActivityLocation // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x18f8630
	struct AYActivityActorManager* GetActivity(); // Function Prospect.YActivityComponent.GetActivity // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x18f8570
};

// Class Prospect.YActivityFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYActivityFunctions : UObject {

	void Sort(struct TArray<struct FYActivityCountEntry> arrayToSort); // Function Prospect.YActivityFunctions.Sort // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x18f92a0
	void SendActivityAnalyticsEvent(struct AActor* Actor, enum class EYActivityType Type, bool isSpawning, struct FString activitySubType); // Function Prospect.YActivityFunctions.SendActivityAnalyticsEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f8ff0
	void RenameActor(struct AActor* Actor, struct FString Name); // Function Prospect.YActivityFunctions.RenameActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f8ed0
	bool IsInsideActivityArea(struct AActor* actorContext, struct FString outAreaName); // Function Prospect.YActivityFunctions.IsInsideActivityArea // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x18f8da0
	bool IsActorReplicatingMovement(struct AActor* Actor); // Function Prospect.YActivityFunctions.IsActorReplicatingMovement // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x18f8d10
	struct FString GetStringFromActivityType(enum class EYActivityType activityType); // Function Prospect.YActivityFunctions.GetStringFromActivityType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x18f8bb0
	struct FString GetLevelName(struct AActor* Actor); // Function Prospect.YActivityFunctions.GetLevelName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f8ab0
	struct ULevel* GetLevel(struct AActor* Actor); // Function Prospect.YActivityFunctions.GetLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f8a20
	float GetDebugActivitySpawnDistanceMultiplier(); // Function Prospect.YActivityFunctions.GetDebugActivitySpawnDistanceMultiplier // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x18f89c0
	float GetClosestPlayerDistanceToActor(struct AActor* Actor); // Function Prospect.YActivityFunctions.GetClosestPlayerDistanceToActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f8930
	struct TArray<enum class EYActivityType> GetAllMineralActivities(); // Function Prospect.YActivityFunctions.GetAllMineralActivities // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x18f88b0
	enum class EYActivityType GetActivityTypeFromString(struct FString inString); // Function Prospect.YActivityFunctions.GetActivityTypeFromString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f8810
	struct FYActivityDataTableRow GetActivityTuning(struct UObject* WorldContextObject, enum class EYActivityType activityType); // Function Prospect.YActivityFunctions.GetActivityTuning // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18f86d0
};

// Class Prospect.YActivityLocation
// Size: 0x288 (Inherited: 0x240)
struct AYActivityLocation : AActor {
	enum class EYActivityLocationStatus m_status; // 0x240(0x01)
	char pad_241[0x3]; // 0x241(0x03)
	float m_respawnBlockTime; // 0x244(0x04)
	struct UYMapMarkerComponent* m_debugMapMarkerComponent; // 0x248(0x08)
	struct TArray<enum class EYActivityType> m_compatibleActivities; // 0x250(0x10)
	enum class EYActivityType m_activityType; // 0x260(0x01)
	char pad_261[0x3]; // 0x261(0x03)
	float m_spawnWeight; // 0x264(0x04)
	struct FTimerHandle m_timerHandleFreeLocation; // 0x268(0x08)
	struct FMulticastInlineDelegate BP_OnStatusChanged; // 0x270(0x10)
	bool m_isGenericActivityLocation; // 0x280(0x01)
	char pad_281[0x3]; // 0x281(0x03)
	float m_spawnRadiusOverride; // 0x284(0x04)

	void NotifyIsAvailable(); // Function Prospect.YActivityLocation.NotifyIsAvailable // (Final|Native|Private) // @ game+0x18fc820
	void NotifyActorDestroyed(); // Function Prospect.YActivityLocation.NotifyActorDestroyed // (Final|Native|Public|BlueprintCallable) // @ game+0x18fc800
	struct FString GetDebugDescription(); // Function Prospect.YActivityLocation.GetDebugDescription // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	int32_t GetAdditionalDebugInfo(); // Function Prospect.YActivityLocation.GetAdditionalDebugInfo // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	enum class EYActivityType GetActivityType(); // Function Prospect.YActivityLocation.GetActivityType // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x18fc730
};

// Class Prospect.YActivityLocationEQS
// Size: 0x2f0 (Inherited: 0x288)
struct AYActivityLocationEQS : AYActivityLocation {
	char pad_288[0x8]; // 0x288(0x08)
	struct UEnvQuery* QueryTemplate; // 0x290(0x08)
	struct TArray<struct FEnvNamedValue> QueryParams; // 0x298(0x10)
	struct TArray<struct FAIDynamicParam> QueryConfig; // 0x2a8(0x10)
	float TimeLimitPerStep; // 0x2b8(0x04)
	int32_t StepToDebugDraw; // 0x2bc(0x04)
	enum class EYEnvQueryHightlightMode HighlightMode; // 0x2c0(0x01)
	char pad_2C1[0x3]; // 0x2c1(0x03)
	char bDrawLabels : 1; // 0x2c4(0x01)
	char bDrawFailedItems : 1; // 0x2c4(0x01)
	char bReRunQueryOnlyOnFinishedMove : 1; // 0x2c4(0x01)
	char bShouldBeVisibleInGame : 1; // 0x2c4(0x01)
	char bTickDuringGame : 1; // 0x2c4(0x01)
	char pad_2C4_5 : 3; // 0x2c4(0x01)
	char pad_2C5[0x3]; // 0x2c5(0x03)
	enum class EEnvQueryRunMode QueryingMode; // 0x2c8(0x01)
	char pad_2C9[0x27]; // 0x2c9(0x27)

	void RunEQSQuery(); // Function Prospect.YActivityLocationEQS.RunEQSQuery // (Final|Native|Public) // @ game+0x18fc930
};

// Class Prospect.YActivityLocationLinked
// Size: 0x448 (Inherited: 0x2f0)
struct AYActivityLocationLinked : AYActivityLocationEQS {
	float m_linkRadius; // 0x2f0(0x04)
	int32_t m_scoreSpawnThreshold; // 0x2f4(0x04)
	struct TMap<enum class EYActivityType, int32_t> m_scorePerType; // 0x2f8(0x50)
	struct TMap<enum class EYActivityType, int32_t> m_debugInfoActorsInRadius; // 0x348(0x50)
	enum class EYLinkType m_linkType; // 0x398(0x01)
	char pad_399[0x7]; // 0x399(0x07)
	struct FYEvaluationResult m_lastEvaluationResult; // 0x3a0(0xa8)

	struct TArray<struct AYActivityLocation*> RunEvaluationCheckForLocations(struct UObject* contextObject, enum class EYActivityType Type); // Function Prospect.YActivityLocationLinked.RunEvaluationCheckForLocations // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18fc950
	struct FString GetLinkDebugDescription(); // Function Prospect.YActivityLocationLinked.GetLinkDebugDescription // (Final|Native|Public|BlueprintCallable) // @ game+0x18fc760
	bool EvaluateLocation(); // Function Prospect.YActivityLocationLinked.EvaluateLocation // (Final|Native|Public|BlueprintCallable) // @ game+0x18fc490
	void DebugUpdateRunLinkActorCheck(struct TArray<struct AYActivityLocation*> outLinkedLocations); // Function Prospect.YActivityLocationLinked.DebugUpdateRunLinkActorCheck // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x18fc3e0
	bool DebugIsEncapsulatedByArea(); // Function Prospect.YActivityLocationLinked.DebugIsEncapsulatedByArea // (Final|Native|Public|BlueprintCallable) // @ game+0x18fc3b0
};

// Class Prospect.YActivityLocationsManager
// Size: 0x1a0 (Inherited: 0xb0)
struct UYActivityLocationsManager : UActorComponent {
	struct TMap<enum class EYActivityType, struct FYActivityLocationArray> m_locations; // 0xb0(0x50)
	struct TMap<struct AYActivityLocationLinked*, struct FYActivityLinkedLocations> m_locationToNearbyLocations; // 0x100(0x50)
	struct TMap<struct AYActivityLocation*, struct AYActivityLocationLinked*> m_locationToArea; // 0x150(0x50)

	void OnActivitiesLoaded(); // Function Prospect.YActivityLocationsManager.OnActivitiesLoaded // (Final|Native|Public) // @ game+0x18fc840
	struct TArray<struct AYActivityLocation*> FindSpawnLocations(struct FYFindActivityLocationsRequestData Request); // Function Prospect.YActivityLocationsManager.FindSpawnLocations // (Final|Native|Public|BlueprintCallable) // @ game+0x18fc630
	struct UYActivityLocationsManager* FindActivityLocationsManager(struct UObject* WorldContextObject); // Function Prospect.YActivityLocationsManager.FindActivityLocationsManager // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18fc4c0
};

// Class Prospect.YActorWidget
// Size: 0x388 (Inherited: 0x2c0)
struct UYActorWidget : UYWidget {
	struct UCanvasPanel* m_offscreenCanvasPanel; // 0x2c0(0x08)
	struct UCanvasPanel* m_offscreenRotationContainer; // 0x2c8(0x08)
	bool m_offScreenArrowEnabled; // 0x2d0(0x01)
	char pad_2D1[0x7]; // 0x2d1(0x07)
	struct UYActorWidgetController* m_actorWidgetController; // 0x2d8(0x08)
	struct AActor* m_actor; // 0x2e0(0x08)
	struct FYActorUIWidgetData m_widgetData; // 0x2e8(0xa0)

	void BP_SetWidgetData(struct FYActorUIWidgetData widgetData); // Function Prospect.YActorWidget.BP_SetWidgetData // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void BP_OnActorSet(); // Function Prospect.YActorWidget.BP_OnActorSet // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void BP_OffScreenUpdate(bool OffScreen); // Function Prospect.YActorWidget.BP_OffScreenUpdate // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YActivityProgressActorWidget
// Size: 0x398 (Inherited: 0x388)
struct UYActivityProgressActorWidget : UYActorWidget {
	struct UEditableText* m_statusText; // 0x388(0x08)
	struct UProgressBar* m_progressBar; // 0x390(0x08)

	void ShowProgress(float progress); // Function Prospect.YActivityProgressActorWidget.ShowProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x18fcd80
	void ShowMessage(struct FText Text); // Function Prospect.YActivityProgressActorWidget.ShowMessage // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x18fccb0
	void OnStateUpdated(int32_t newState); // Function Prospect.YActivityProgressActorWidget.OnStateUpdated // (Native|Event|Public|BlueprintEvent) // @ game+0x18fc880
};

// Class Prospect.YActorWidgetController
// Size: 0x40 (Inherited: 0x30)
struct UYActorWidgetController : UYWidgetController {
	char pad_30[0x8]; // 0x30(0x08)
	struct AActor* m_actor; // 0x38(0x08)
};

// Class Prospect.YActivityProgressActorWidgetController
// Size: 0x48 (Inherited: 0x40)
struct UYActivityProgressActorWidgetController : UYActorWidgetController {
	char pad_40[0x8]; // 0x40(0x08)
};

// Class Prospect.YActivityRegisterComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UYActivityRegisterComponent : UActorComponent {
	struct TArray<struct UYActivityComponent*> m_spawnedActivityComponents; // 0xb0(0x10)
	struct FMulticastInlineDelegate BP_OnActivityComponentAdded; // 0xc0(0x10)
};

// Class Prospect.YActorDamageNormalizationComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UYActorDamageNormalizationComponent : UActorComponent {
	struct TArray<struct AYAIController*> m_tokenHolderAIs; // 0xb0(0x10)
	int32_t m_currentMaxTokenCount; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)

	void BP_UpdateAIHasActorAsTarget(struct AYAIController* controoler, bool isAITargetingActor); // Function Prospect.YActorDamageNormalizationComponent.BP_UpdateAIHasActorAsTarget // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	struct TArray<struct FVector> BP_OnGatherCurrentTokens(); // Function Prospect.YActorDamageNormalizationComponent.BP_OnGatherCurrentTokens // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YActorDespawningComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UYActorDespawningComponent : UActorComponent {
	struct TArray<struct FYDespawnActorInfo> m_actorsToDespawn; // 0xb0(0x10)
	float m_defaultDespawnDistance; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)

	float GetDebugActorDespawnDistanceMultiplier(); // Function Prospect.YActorDespawningComponent.GetDebugActorDespawnDistanceMultiplier // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x18f89c0
};

// Class Prospect.YActorPoolingManager
// Size: 0x38 (Inherited: 0x28)
struct UYActorPoolingManager : UObject {
	struct TArray<struct FYPooledActorEntry> m_pooledActors; // 0x28(0x10)
};

// Class Prospect.YActorUIComponent
// Size: 0x1f8 (Inherited: 0xb0)
struct UYActorUIComponent : UActorComponent {
	struct FVector m_offsetToActorLocation; // 0xb0(0x0c)
	struct FVector2D m_alignment; // 0xbc(0x08)
	float m_maxRenderDistance; // 0xc4(0x04)
	float m_overrideScaleDistance; // 0xc8(0x04)
	float m_minRenderDistance; // 0xcc(0x04)
	float m_minScaleValue; // 0xd0(0x04)
	bool m_visibleThroughObstacles; // 0xd4(0x01)
	enum class EYUIComponentType m_componentType; // 0xd5(0x01)
	bool m_isEnabled; // 0xd6(0x01)
	bool m_gameplayTemporaryDisabled; // 0xd7(0x01)
	bool m_isSpawningActorAndShouldBeHidden; // 0xd8(0x01)
	char pad_D9[0x7]; // 0xd9(0x07)
	struct USceneComponent* m_overridenSceneComponent; // 0xe0(0x08)
	struct FYActorUIWidgetData m_uiWidgetData; // 0xe8(0xa0)
	enum class EYActivityType m_activityContext; // 0x188(0x01)
	char pad_189[0x7]; // 0x189(0x07)
	SoftClassProperty m_widgetClass; // 0x190(0x28)
	struct UYActorWidget* m_widget; // 0x1b8(0x08)
	enum class EYMapMarkerType m_markerType; // 0x1c0(0x01)
	char pad_1C1[0x7]; // 0x1c1(0x07)
	struct FMulticastInlineDelegate BP_OnWidgetLoaded; // 0x1c8(0x10)
	struct FVector m_worldWidgetLocation; // 0x1d8(0x0c)
	char pad_1E4[0x14]; // 0x1e4(0x14)

	void SetWidgetData(struct FYActorUIWidgetData uiWidgetData); // Function Prospect.YActorUIComponent.SetWidgetData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x18fcc00
	void SetWidgetClass(SoftClassProperty uiClass); // Function Prospect.YActorUIComponent.SetWidgetClass // (Final|Native|Public|BlueprintCallable) // @ game+0x18fcaf0
	void SetEnabled(bool IsEnabled); // Function Prospect.YActorUIComponent.SetEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x18fca60
	void OnWidgetLoaded(); // Function Prospect.YActorUIComponent.OnWidgetLoaded // (Native|Protected) // @ game+0x18fc910
	struct UYActorWidget* GetWidget(); // Function Prospect.YActorUIComponent.GetWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x18fc7e0
	void FindHelperUIComponentsWorld(struct UObject* Context, struct TArray<struct UYActorUIComponent*> outHelperComponents); // Function Prospect.YActorUIComponent.FindHelperUIComponentsWorld // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x18fc550
	struct UYActorUIComponent* CreateActorUIComponent(struct AActor* Owner, struct FYActorUIWidgetData uiData, SoftClassProperty Widget); // Function Prospect.YActorUIComponent.CreateActorUIComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x18fc0e0
};

// Class Prospect.YActorWidgetSimple
// Size: 0x3b0 (Inherited: 0x388)
struct UYActorWidgetSimple : UYActorWidget {
	struct UImage* m_image; // 0x388(0x08)
	struct UTextBlock* m_title; // 0x390(0x08)
	struct UTextBlock* m_playerName; // 0x398(0x08)
	struct UTextBlock* m_distanceText; // 0x3a0(0x08)
	char pad_3A8[0x8]; // 0x3a8(0x08)

	void OnImageLoaded(); // Function Prospect.YActorWidgetSimple.OnImageLoaded // (Native|Protected) // @ game+0x18fc860
	void CalculateLocalDistanceTowardsPlayer(); // Function Prospect.YActorWidgetSimple.CalculateLocalDistanceTowardsPlayer // (Final|Native|Protected) // @ game+0x18fc0c0
};

// Class Prospect.YActorWithGenericTeam
// Size: 0x250 (Inherited: 0x240)
struct AYActorWithGenericTeam : AActor {
	char pad_240[0x10]; // 0x240(0x10)

	void SetTeamID(enum class EYTeam TeamID); // Function Prospect.YActorWithGenericTeam.SetTeamID // (Final|Native|Public|BlueprintCallable) // @ game+0x1901e80
	enum class EYTeam GetTeamFromActor(struct AActor* Actor); // Function Prospect.YActorWithGenericTeam.GetTeamFromActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19013a0
};

// Class Prospect.YActorWithMapCheck
// Size: 0x240 (Inherited: 0x240)
struct AYActorWithMapCheck : AActor {

	struct FYMapErrorInfo BP_CheckForErrors(); // Function Prospect.YActorWithMapCheck.BP_CheckForErrors // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YAIAggroComponent
// Size: 0x190 (Inherited: 0xb0)
struct UYAIAggroComponent : UActorComponent {
	struct AActor* m_aggroTarget; // 0xb0(0x08)
	enum class EYAISenseType m_highestSenseType; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	struct FVector m_lastPerceivedSenseLocation; // 0xbc(0x0c)
	struct TMap<struct AActor*, struct FYAITargetInfo> m_targets; // 0xc8(0x50)
	char pad_118[0x58]; // 0x118(0x58)
	struct FMulticastInlineDelegate OnActorRemovedFromPerception; // 0x170(0x10)
	struct FMulticastInlineDelegate OnActorAggroChangeRequested; // 0x180(0x10)

	bool TryFindTargetInfo(struct AActor* Target, struct FYAITargetInfo outTargetInfo); // Function Prospect.YAIAggroComponent.TryFindTargetInfo // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1902160
	bool TryAddTarget(struct AActor* Target); // Function Prospect.YAIAggroComponent.TryAddTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x19020c0
	void SetCurrentAggroTarget(struct AActor* Target, struct FString reasonContext); // Function Prospect.YAIAggroComponent.SetCurrentAggroTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1901d50
	void SendSharedSense(struct AActor* targetActor); // Function Prospect.YAIAggroComponent.SendSharedSense // (Final|Native|Public|BlueprintCallable) // @ game+0x1901cc0
	void OnTargetPerceptionUpdated(struct AActor* Actor, struct FAIStimulus Stimulus); // Function Prospect.YAIAggroComponent.OnTargetPerceptionUpdated // (Final|Native|Public) // @ game+0x1901a70
	void OnTakeDamage(struct FYDealtDamageData DamageEvent); // Function Prospect.YAIAggroComponent.OnTakeDamage // (Final|Native|Private|HasOutParms) // @ game+0x1901980
	void OnPawnStateChanged(struct APawn* oldPawn, struct APawn* newPawn); // Function Prospect.YAIAggroComponent.OnPawnStateChanged // (Final|Native|Private) // @ game+0x1901830
	void ClearCurrentAggroTargetInfo(); // Function Prospect.YAIAggroComponent.ClearCurrentAggroTargetInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x1900fc0
	void ClearAllTargets(struct FString reasonContext); // Function Prospect.YAIAggroComponent.ClearAllTargets // (Final|Native|Public|BlueprintCallable) // @ game+0x1900ed0
	void BP_UpdateAggroTarget(struct AActor* Actor, struct FYAITargetInfo aiTargetInfo); // Function Prospect.YAIAggroComponent.BP_UpdateAggroTarget // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YAIAnalyticsComponent
// Size: 0x150 (Inherited: 0xb0)
struct UYAIAnalyticsComponent : UActorComponent {
	struct TMap<struct FUniqueNetIdRepl, struct FYKilledAIAnalyticsEvents> m_killedAIEvents; // 0xb0(0x50)
	struct TMap<struct AYAICharacter*, struct FYAICombatAnalyticsData> m_aiAnalyticsDataEnties; // 0x100(0x50)

	void OnCombatTargetChanged(struct UYAIDataComponent* Component, struct AActor* combatTarget); // Function Prospect.YAIAnalyticsComponent.OnCombatTargetChanged // (Final|Native|Protected) // @ game+0x19016d0
	void OnAITakeDamage(struct FYDealtDamageData damageDealt); // Function Prospect.YAIAnalyticsComponent.OnAITakeDamage // (Final|Native|Protected|HasOutParms) // @ game+0x19015e0
	void OnAIDealDamage(struct FYDealtDamageData damageDealt); // Function Prospect.YAIAnalyticsComponent.OnAIDealDamage // (Final|Native|Protected|HasOutParms) // @ game+0x19014f0
	void OnAICharacterSpawned(struct AYAICharacter* aiCharacter); // Function Prospect.YAIAnalyticsComponent.OnAICharacterSpawned // (Final|Native|Public) // @ game+0x1901460
};

// Class Prospect.YAIAnimationComponent
// Size: 0xe8 (Inherited: 0xb0)
struct UYAIAnimationComponent : UActorComponent {
	struct FYAIMontagePlayInfo m_playMontageInfo; // 0xb0(0x20)
	struct FYAIMontageStopInfo m_stopMontageInfo; // 0xd0(0x10)
	struct FYAIEndLoopInfo m_endLoopInfo; // 0xe0(0x08)

	void PlayAnimationMontage(struct FYAIMontagePlayInfo montageInfo); // Function Prospect.YAIAnimationComponent.PlayAnimationMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x1901c00
	void OnRep_StopAnimationMontage(); // Function Prospect.YAIAnimationComponent.OnRep_StopAnimationMontage // (Final|Native|Public) // @ game+0x1901960
	void OnRep_PlayAnimationMontage(); // Function Prospect.YAIAnimationComponent.OnRep_PlayAnimationMontage // (Final|Native|Public) // @ game+0x1901940
	void OnRep_EndLoopMontage(); // Function Prospect.YAIAnimationComponent.OnRep_EndLoopMontage // (Final|Native|Public) // @ game+0x1901920
	void EndLoopMontage(struct FYAIEndLoopInfo loopEndInfo); // Function Prospect.YAIAnimationComponent.EndLoopMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x19011d0
};

// Class Prospect.YAIAnimationHelperFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAIAnimationHelperFunctions : UObject {

	void SpawnProjectileActorAttachedToSocket(struct AActor* Owner, struct FName SocketName, struct FDataTableRowHandle rangedAttackDefinitionRowhandle); // Function Prospect.YAIAnimationHelperFunctions.SpawnProjectileActorAttachedToSocket // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1901f00
	struct FYHitAngleData DetermineHitAngle(struct FYDealtDamageData Data); // Function Prospect.YAIAnimationHelperFunctions.DetermineHitAngle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x19010d0
	enum class EYHitZone DetermineAIHitZone(struct FYDealtDamageData Data); // Function Prospect.YAIAnimationHelperFunctions.DetermineAIHitZone // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1900fe0
};

// Class Prospect.YAIAnimationInterface
// Size: 0x28 (Inherited: 0x28)
struct UYAIAnimationInterface : UInterface {

	bool TriggerFlinchAnimation(struct FYDealtDamageData HitInfo); // Function Prospect.YAIAnimationInterface.TriggerFlinchAnimation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void PlayAnimationMontage(struct FYAIMontagePlayInfo montageInfo); // Function Prospect.YAIAnimationInterface.PlayAnimationMontage // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* OnStabilityThresholdReached(struct FYDealtDamageData damageInfo, struct FName stabilityIdentifier, struct FName currentAIActionContext, float yawRotationGoalWorldSpace, bool canBeInterruptedByDodge); // Function Prospect.YAIAnimationInterface.OnStabilityThresholdReached // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	bool OnRangedAttackFire(struct UYAIAttackComponent* attackComponent); // Function Prospect.YAIAnimationInterface.OnRangedAttackFire // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	bool OnRangedAttackCancelled(); // Function Prospect.YAIAnimationInterface.OnRangedAttackCancelled // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	bool OnAttackPhaseStarted(struct UYAIAttackComponent* attackComponent); // Function Prospect.YAIAnimationInterface.OnAttackPhaseStarted // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct FYAIMontagePlayInfo GetTurnAnimationToPlay(float desiredTurnAngle); // Function Prospect.YAIAnimationInterface.GetTurnAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetTauntAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetTauntAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetSummonOutAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetSummonOutAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetSummonAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetSummonAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetSpawnAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetSpawnAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetSnipedAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetSnipedAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetScanAnimation(); // Function Prospect.YAIAnimationInterface.GetScanAnimation // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetReloadAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetReloadAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetRangedAttackAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetRangedAttackAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetOutOfRestAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetOutOfRestAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetMeleeDodgeBackAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetMeleeDodgeBackAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetMeleeAttackAnimationToPlay(float distanceToTarget, int32_t meleeArrayIndex, struct FYAIMeleeAttackDefinition meleeAttack); // Function Prospect.YAIAnimationInterface.GetMeleeAttackAnimationToPlay // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetLeapForwardAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetLeapForwardAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetInterruptSummonAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetInterruptSummonAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetInterruptBuffAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetInterruptBuffAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetGoToRestAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetGoToRestAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetExplosionAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetExplosionAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetDodgeAnimationToPlay(float maxAllowedDodgeDistance, bool isToRight); // Function Prospect.YAIAnimationInterface.GetDodgeAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetDeathAnimationToPlay(struct FYDealtDamageData deathHitInfo); // Function Prospect.YAIAnimationInterface.GetDeathAnimationToPlay // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetBuffOutAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetBuffOutAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UAnimMontage* GetBuffAnimationToPlay(); // Function Prospect.YAIAnimationInterface.GetBuffAnimationToPlay // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YAIAttackComponent
// Size: 0x120 (Inherited: 0xb0)
struct UYAIAttackComponent : UActorComponent {
	struct FMulticastInlineDelegate BP_OnFired; // 0xb0(0x10)
	int32_t m_currentPhasePlayCount; // 0xc0(0x04)
	float m_currentPhaseDuration; // 0xc4(0x04)
	struct FYReplicatedAttackRuntimeData m_replicatedRuntimeData; // 0xc8(0x0c)
	int32_t m_numShotsFiredInCurrentPhase; // 0xd4(0x04)
	char pad_D8[0x18]; // 0xd8(0x18)
	struct FMulticastInlineDelegate BP_OnAttackStarted; // 0xf0(0x10)
	struct FMulticastInlineDelegate BP_OnAttackEnded; // 0x100(0x10)
	struct FMulticastInlineDelegate BP_OnNewPhaseStarted; // 0x110(0x10)

	void StartRangedAttack(int32_t indexRangedAttack); // Function Prospect.YAIAttackComponent.StartRangedAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x1902030
	void StartNextPhase(); // Function Prospect.YAIAttackComponent.StartNextPhase // (Final|Native|Private) // @ game+0x1902010
	void OnRep_AttackRuntimeData(); // Function Prospect.YAIAttackComponent.OnRep_AttackRuntimeData // (Final|Native|Private) // @ game+0x1901900
	void OnDeath(struct UYCharacterDeathComponent* deathComponent); // Function Prospect.YAIAttackComponent.OnDeath // (Final|Native|Private) // @ game+0x19017a0
	bool IsRangedAttackRunning(); // Function Prospect.YAIAttackComponent.IsRangedAttackRunning // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1901430
	struct FYAIRangedAttackDefinition GetCurrentRangedAttackTuningData(); // Function Prospect.YAIAttackComponent.GetCurrentRangedAttackTuningData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19012e0
	int32_t GetCurrentRangedAttackIndex(); // Function Prospect.YAIAttackComponent.GetCurrentRangedAttackIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19012c0
	struct FYAIAttackPhaseDefinition GetCurrentPhaseTuningData(); // Function Prospect.YAIAttackComponent.GetCurrentPhaseTuningData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1901280
	void FireTransport(); // Function Prospect.YAIAttackComponent.FireTransport // (Final|Native|Private) // @ game+0x1901260
	void CancelAttack(); // Function Prospect.YAIAttackComponent.CancelAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x1900eb0
	void BP_OnFireTansport(); // Function Prospect.YAIAttackComponent.BP_OnFireTansport // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YAIBehaviorHelperFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAIBehaviorHelperFunctions : UObject {

	void GetSquadAIsInRadius(struct AYAICharacter* inAiCharacter, float inRadius, bool inFilterDeadAis, struct TArray<struct AYAICharacter*> outAICharacters); // Function Prospect.YAIBehaviorHelperFunctions.GetSquadAIsInRadius // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1905db0
	void GetAIsInRadius(struct UObject* worlContextObject, struct FVector locationContext, float Radius, bool filterOutDeadAis, struct TArray<struct AYAICharacter*> outAICharacters); // Function Prospect.YAIBehaviorHelperFunctions.GetAIsInRadius // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1905880
	struct FTransform ExtractRootMotion(struct UAnimMontage* Montage); // Function Prospect.YAIBehaviorHelperFunctions.ExtractRootMotion // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1905300
	void CallCustomEvent(struct UObject* Object, struct FName FunctionName); // Function Prospect.YAIBehaviorHelperFunctions.CallCustomEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1905220
};

// Class Prospect.YAIController
// Size: 0x3d8 (Inherited: 0x368)
struct AYAIController : AAIController {
	bool m_delayBehaviorSpawning; // 0x368(0x01)
	char pad_369[0x7]; // 0x369(0x07)
	struct FMulticastInlineDelegate BP_OnAnyAIAttackStarted; // 0x370(0x10)
	struct FMulticastInlineDelegate OnComboWindowStartedDelegate; // 0x380(0x10)
	struct FGameplayTagContainer m_possibleComboTags; // 0x390(0x20)
	struct UYAITurnComponent* m_turnComponent; // 0x3b0(0x08)
	struct AYAICharacter* m_controlledCharacter; // 0x3b8(0x08)
	struct FName m_keyHomeLocation; // 0x3c0(0x08)
	struct FName m_keyNameCombatTarget; // 0x3c8(0x08)
	struct FName m_keyStabilityAnimationInfo; // 0x3d0(0x08)

	void StopComboWindow(); // Function Prospect.YAIController.StopComboWindow // (Final|Native|Public|BlueprintCallable) // @ game+0x1906d50
	void StartComboWindow(struct FGameplayTagContainer possibleComboTags); // Function Prospect.YAIController.StartComboWindow // (Final|Native|Public|BlueprintCallable) // @ game+0x1906ba0
	void SetAIReactionContext(enum class EYAIReactionContext newReactionContext); // Function Prospect.YAIController.SetAIReactionContext // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	struct UYAIAggroComponent* GetAggroComponent(); // Function Prospect.YAIController.GetAggroComponent // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1e02480
	void BP_OnInitializeBehavior(); // Function Prospect.YAIController.BP_OnInitializeBehavior // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YAIBotController
// Size: 0x400 (Inherited: 0x3d8)
struct AYAIBotController : AYAIController {
	struct TArray<struct FVector> m_currentPath; // 0x3d8(0x10)
	char pad_3E8[0x8]; // 0x3e8(0x08)
	struct AYPlayerCharacter* m_controlledPlayerCharacter; // 0x3f0(0x08)
	struct AYPlayerController_Match* m_controlledPlayerController; // 0x3f8(0x08)

	bool TakeOver(struct AYPlayerController_Match* Controller); // Function Prospect.YAIBotController.TakeOver // (Final|Native|Public|BlueprintCallable) // @ game+0x1906d70
	void StopBTLogic(struct UYHealthComponent* healthComponent, struct AActor* instigatorActor); // Function Prospect.YAIBotController.StopBTLogic // (Final|Native|Public|BlueprintCallable) // @ game+0x1906c80
	bool MoveOnPath(); // Function Prospect.YAIBotController.MoveOnPath // (Final|Native|Public|BlueprintCallable) // @ game+0x1905ff0
	bool FindPathToLocation(struct FVector TargetLocation, float minLastPathfindTime); // Function Prospect.YAIBotController.FindPathToLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x19053c0
	bool AimAt(struct FVector TargetLocation, struct FVector2D maxError); // Function Prospect.YAIBotController.AimAt // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1905080
};

// Class Prospect.YCharacter
// Size: 0x530 (Inherited: 0x4e0)
struct AYCharacter : ACharacter {
	struct FMulticastInlineDelegate BP_OnTeleport; // 0x4e0(0x10)
	struct UYHealthComponent* m_healthComponent; // 0x4f0(0x08)
	struct UYDamageComponent* m_damageComponent; // 0x4f8(0x08)
	struct UYCharacterDeathComponent* m_deathComponent; // 0x500(0x08)
	struct UYGameplayAttributesComponent* m_gameplayAttributesComponent; // 0x508(0x08)
	struct UYPerkComponent* m_perkComponent; // 0x510(0x08)
	struct FMulticastInlineDelegate OnMovementInputInitiated; // 0x518(0x10)
	char pad_528[0x4]; // 0x528(0x04)
	char bIsProning : 1; // 0x52c(0x01)
	char pad_52C_1 : 7; // 0x52c(0x01)
	char pad_52D[0x3]; // 0x52d(0x03)

	void UnProne(bool bClientSimulation); // Function Prospect.YCharacter.UnProne // (Native|Public|BlueprintCallable) // @ game+0x1926d40
	void SetAnimRootMotionTranslationScale(float NewScale); // Function Prospect.YCharacter.SetAnimRootMotionTranslationScale // (Final|Native|Public|BlueprintCallable) // @ game+0x19268a0
	void Prone(bool bClientSimulation); // Function Prospect.YCharacter.Prone // (Native|Public|BlueprintCallable) // @ game+0x19265d0
	void OnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Prospect.YCharacter.OnStartProne // (Native|Event|Public|BlueprintEvent) // @ game+0x1926340
	void OnRep_IsProning(); // Function Prospect.YCharacter.OnRep_IsProning // (Final|Native|Public) // @ game+0x1926040
	void OnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Prospect.YCharacter.OnEndProne // (Native|Event|Public|BlueprintEvent) // @ game+0x1925ea0
	void MulticastPlayDatatableSound(struct FDataTableRowHandle audioEventDataTableRow); // Function Prospect.YCharacter.MulticastPlayDatatableSound // (Net|Native|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x1925e00
	bool IsFirstPerson(); // Function Prospect.YCharacter.IsFirstPerson // (Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1925cc0
	struct UYPerkComponent* GetPerkComponent(); // Function Prospect.YCharacter.GetPerkComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1925b20
	struct UYHealthComponent* GetHealthComponent(); // Function Prospect.YCharacter.GetHealthComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1925a80
	struct UYGameplayAttributesComponent* GetGameplayAttributesComponent(); // Function Prospect.YCharacter.GetGameplayAttributesComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19259e0
	struct UYDamageComponent* GetDamageComponent(); // Function Prospect.YCharacter.GetDamageComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19259c0
	struct FRotator GetAimOffsets(); // Function Prospect.YCharacter.GetAimOffsets // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1925250
	struct USkeletalMeshComponent* FindRelevantCharacterMesh(bool forceThirdPersonMesh); // Function Prospect.YCharacter.FindRelevantCharacterMesh // (Native|Public|BlueprintCallable) // @ game+0x1924f50
	void FindAllRelevantMeshes(struct TArray<struct UMeshComponent*> OutComponents); // Function Prospect.YCharacter.FindAllRelevantMeshes // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1924ea0
};

// Class Prospect.YAICharacter
// Size: 0x7a0 (Inherited: 0x530)
struct AYAICharacter : AYCharacter {
	char pad_530[0x10]; // 0x530(0x10)
	struct AYAIController* m_aiController; // 0x540(0x08)
	char pad_548[0x18]; // 0x548(0x18)
	struct FYAIAudio m_audioAIData; // 0x560(0x158)
	struct FDataTableRowHandle m_audioTagRowHandle; // 0x6b8(0x10)
	struct FGameplayTagContainer m_gameplayTags; // 0x6c8(0x20)
	struct UYAIDataComponent* m_aiDataComponent; // 0x6e8(0x08)
	struct UYAIAnimationComponent* m_animationComponent; // 0x6f0(0x08)
	struct UYAIStaggerComponent* m_staggerComponent; // 0x6f8(0x08)
	struct UYArmorComponent* m_armorComponent; // 0x700(0x08)
	struct FText m_characterNameOverride; // 0x708(0x18)
	struct FVector m_rangedAttackOriginLocationOffset; // 0x720(0x0c)
	bool m_isPlacedInWorld; // 0x72c(0x01)
	char pad_72D[0x3]; // 0x72d(0x03)
	struct FDataTableRowHandle m_aiTuningDataHandle; // 0x730(0x10)
	struct FMulticastInlineDelegate BPOnAttackNotifyDelegate; // 0x740(0x10)
	struct FMulticastInlineDelegate BP_OnRangeAttack; // 0x750(0x10)
	struct FMulticastInlineDelegate OnMeleeAttack; // 0x760(0x10)
	struct FMulticastInlineDelegate BP_OnReceivedGameplayTags; // 0x770(0x10)
	struct FVector m_overrideTargetLocation; // 0x780(0x0c)
	char pad_78C[0x4]; // 0x78c(0x04)
	struct AYProjectile* m_attachedProjectile; // 0x790(0x08)
	char pad_798[0x8]; // 0x798(0x08)

	void SetViewRotationBone(struct FName BoneName); // Function Prospect.YAICharacter.SetViewRotationBone // (Final|Native|Public|BlueprintCallable) // @ game+0x1906b10
	void SetMaxSpeed(struct FString Context, float movementSpeed); // Function Prospect.YAICharacter.SetMaxSpeed // (Final|Native|Public|BlueprintCallable) // @ game+0x1906730
	void ReportAISenseDamageEvent(struct FYDealtDamageData Data); // Function Prospect.YAICharacter.ReportAISenseDamageEvent // (Final|Native|Public|HasOutParms) // @ game+0x1906510
	void OnYAIStateHasChanged(enum class EYAIState oldState, enum class EYAIState newState); // Function Prospect.YAICharacter.OnYAIStateHasChanged // (Final|Native|Public) // @ game+0x1906390
	void OnRep_GameplayTags(); // Function Prospect.YAICharacter.OnRep_GameplayTags // (Final|Native|Private) // @ game+0x19062e0
	struct AYAIController* GetYAIController(); // Function Prospect.YAICharacter.GetYAIController // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905f30
	struct AYAISquad* GetSquad(); // Function Prospect.YAICharacter.GetSquad // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905d80
	void GetGameplayTags(struct FGameplayTagContainer characterTags); // Function Prospect.YAICharacter.GetGameplayTags // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1905b90
	struct FString GetDebugAIInfo(); // Function Prospect.YAICharacter.GetDebugAIInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905a90
	struct AActor* GetCombatTarget(); // Function Prospect.YAICharacter.GetCombatTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905a40
	void GetAITuningDataBP(struct FYAITuningRow Data); // Function Prospect.YAICharacter.GetAITuningDataBP // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x19057b0
	enum class EYAIState GetAIState(); // Function Prospect.YAICharacter.GetAIState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905760
	struct UYAIDataComponent* GetAIDataComponent(); // Function Prospect.YAICharacter.GetAIDataComponent // (Final|Native|Public) // @ game+0x1905730
	struct FString GetAICharacterType(); // Function Prospect.YAICharacter.GetAICharacterType // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x19056b0
	struct FText GetAICharacterName(); // Function Prospect.YAICharacter.GetAICharacterName // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905610
	void GetAIAudioData(struct FYAIAudio audioData); // Function Prospect.YAICharacter.GetAIAudioData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1905570
	void ExecuteAttackAnimationNotify(); // Function Prospect.YAICharacter.ExecuteAttackAnimationNotify // (Final|Native|Public|BlueprintCallable) // @ game+0x19052e0
	void BP_ReceivedGameplayTags(); // Function Prospect.YAICharacter.BP_ReceivedGameplayTags // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void AppendGameplayTags(struct FGameplayTagContainer newTags); // Function Prospect.YAICharacter.AppendGameplayTags // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1905160
};

// Class Prospect.YAICharacterMovementComponent
// Size: 0xb40 (Inherited: 0xb20)
struct UYAICharacterMovementComponent : UCharacterMovementComponent {
	bool m_alignMeshToFloor; // 0xb20(0x01)
	char pad_B21[0x3]; // 0xb21(0x03)
	float m_maxAllowedRotationValue; // 0xb24(0x04)
	float m_interpRotationRate; // 0xb28(0x04)
	float m_maxTraceToFloorDistance; // 0xb2c(0x04)
	char pad_B30[0x10]; // 0xb30(0x10)
};

// Class Prospect.YAIDataComponent
// Size: 0x120 (Inherited: 0xb0)
struct UYAIDataComponent : UActorComponent {
	struct AYAISquad* m_squad; // 0xb0(0x08)
	bool m_peacefull; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
	struct AActor* m_combatTargetReplicated; // 0xc0(0x08)
	enum class EYAIState m_aiState; // 0xc8(0x01)
	bool m_isAngry; // 0xc9(0x01)
	char pad_CA[0x6]; // 0xca(0x06)
	struct FMulticastInlineDelegate AIStateChanged; // 0xd0(0x10)
	struct FMulticastInlineDelegate BP_OnHitReactionStartedDelegate; // 0xe0(0x10)
	struct FMulticastInlineDelegate BP_OnCombatTargetActorChanged; // 0xf0(0x10)
	struct FMulticastInlineDelegate BP_OnDodgeStartedDelegate; // 0x100(0x10)
	struct FMulticastInlineDelegate BP_OnProjectileSpawnedDelegate; // 0x110(0x10)

	void SetStateToDead(struct UYHealthComponent* healthComponent, struct AActor* Instigator); // Function Prospect.YAIDataComponent.SetStateToDead // (Final|Native|Public) // @ game+0x1906a40
	void SetReplicatedCombatTarget(struct AActor* Actor); // Function Prospect.YAIDataComponent.SetReplicatedCombatTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1906820
	void SetAIState(enum class EYAIState aiState); // Function Prospect.YAIDataComponent.SetAIState // (Final|Native|Public|BlueprintCallable) // @ game+0x19066b0
	void OnRep_AIState(enum class EYAIState previouseState); // Function Prospect.YAIDataComponent.OnRep_AIState // (Final|Native|Protected) // @ game+0x1906260
	bool GetIsAngry(); // Function Prospect.YAIDataComponent.GetIsAngry // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905c50
	struct FString GetDebugInfo(); // Function Prospect.YAIDataComponent.GetDebugInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x1905b10
	struct AActor* GetCombatTarget(); // Function Prospect.YAIDataComponent.GetCombatTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905a70
	enum class EYAIState GetAIState(); // Function Prospect.YAIDataComponent.GetAIState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905790
};

// Class Prospect.YAIEQSTargetDummy
// Size: 0x248 (Inherited: 0x240)
struct AYAIEQSTargetDummy : AActor {
	struct AYAIEQSTestingPawn* m_associatedEqsTestingPawn; // 0x240(0x08)
};

// Class Prospect.YAIEQSTestingPawn
// Size: 0x580 (Inherited: 0x580)
struct AYAIEQSTestingPawn : AEQSTestingPawn {

	void RunEQSQueryNow(); // Function Prospect.YAIEQSTestingPawn.RunEQSQueryNow // (Final|Native|Public|BlueprintCallable) // @ game+0x1906690
};

// Class Prospect.YAIManager
// Size: 0x150 (Inherited: 0xb0)
struct UYAIManager : UActorComponent {
	struct TArray<struct AYAICharacter*> m_aiCharacters; // 0xb0(0x10)
	struct TArray<struct FYAISpawnRequest> m_spawnRequests; // 0xc0(0x10)
	struct TArray<struct FSoftObjectPath> m_objectsRequestedAsyncLoadFor; // 0xd0(0x10)
	char pad_E0[0x8]; // 0xe0(0x08)
	struct TArray<struct UObject*> m_objectsLoaded; // 0xe8(0x10)
	char pad_F8[0x10]; // 0xf8(0x10)
	struct FMulticastInlineDelegate BP_OnAICharacterAdded; // 0x108(0x10)
	struct FMulticastInlineDelegate BP_OnAICharacterRemoved; // 0x118(0x10)
	struct FMulticastInlineDelegate BP_OnAISquadDetermineAIsToSpawn; // 0x128(0x10)
	bool m_shouldSpawnPrototypeAIVersions; // 0x138(0x01)
	char pad_139[0x7]; // 0x139(0x07)
	struct FDataTableRowHandle m_rowHandleForAISpawnCharacters; // 0x140(0x10)

	struct UYAIManager* TryGetYAIManager(struct UObject* WorldContextObject); // Function Prospect.YAIManager.TryGetYAIManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1906e10
	void RemoveTargetFromAllAIs(struct AActor* actorToRemove); // Function Prospect.YAIManager.RemoveTargetFromAllAIs // (Final|Native|Public|BlueprintCallable) // @ game+0x1906480
	void OnAICharacterRemoved__DelegateSignature(struct AYAICharacter* Character); // DelegateFunction Prospect.YAIManager.OnAICharacterRemoved__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
	void OnAICharacterCountChangedSignature__DelegateSignature(int32_t newCount); // DelegateFunction Prospect.YAIManager.OnAICharacterCountChangedSignature__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
	void OnAICharacterAdded__DelegateSignature(struct AYAICharacter* Character); // DelegateFunction Prospect.YAIManager.OnAICharacterAdded__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
	struct UYAIManager* GetYAIManager(struct UObject* WorldContextObject); // Function Prospect.YAIManager.GetYAIManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1905f60
	int32_t GetNumPendingSpawnRequests(); // Function Prospect.YAIManager.GetNumPendingSpawnRequests // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1297370
	struct FName GenerateUniqueSquadName(struct FString squadNameBase); // Function Prospect.YAIManager.GenerateUniqueSquadName // (Final|Native|Public|BlueprintCallable) // @ game+0x19054b0
};

// Class Prospect.YAIPerceptionComponent
// Size: 0x260 (Inherited: 0x190)
struct UYAIPerceptionComponent : UAIPerceptionComponent {
	char pad_190[0xd0]; // 0x190(0xd0)

	void SetSenseTuningRow(struct FYAISenseTuningRow senseTuningRow); // Function Prospect.YAIPerceptionComponent.SetSenseTuningRow // (Final|Native|Public|BlueprintCallable) // @ game+0x19068b0
	void OnPawnStateChanged(struct APawn* oldPawn, struct APawn* newPawn); // Function Prospect.YAIPerceptionComponent.OnPawnStateChanged // (Final|Native|Public) // @ game+0x1906190
	void OnAIStateChanged(enum class EYAIState PreviousState, enum class EYAIState currentState); // Function Prospect.YAIPerceptionComponent.OnAIStateChanged // (Final|Native|Public) // @ game+0x1906020
	void GetSenseTuningRowBP(struct FYAISenseTuningRow senseTuningRow); // Function Prospect.YAIPerceptionComponent.GetSenseTuningRowBP // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1905c70
};

// Class Prospect.YAIPerceptionStimuliSourceComp
// Size: 0xc8 (Inherited: 0xc8)
struct UYAIPerceptionStimuliSourceComp : UAIPerceptionStimuliSourceComponent {

	void UpdatePerceptionStatus(); // Function Prospect.YAIPerceptionStimuliSourceComp.UpdatePerceptionStatus // (Final|Native|Public) // @ game+0x1906ea0
	void RemoveActorFromPerceptionSystemAndAllAIs(); // Function Prospect.YAIPerceptionStimuliSourceComp.RemoveActorFromPerceptionSystemAndAllAIs // (Final|Native|Public|BlueprintCallable) // @ game+0x1906460
	void OnStateChanged(bool wasInterrupted); // Function Prospect.YAIPerceptionStimuliSourceComp.OnStateChanged // (Final|Native|Private) // @ game+0x1906300
	void OnAbilityStateChanged(struct FYAbilityStateInfo Info); // Function Prospect.YAIPerceptionStimuliSourceComp.OnAbilityStateChanged // (Final|Native|Private|HasOutParms) // @ game+0x19060f0
};

// Class Prospect.YAIPlayerController_Match
// Size: 0x468 (Inherited: 0x3d8)
struct AYAIPlayerController_Match : AYAIController {
	struct TArray<struct FDataTableRowHandle> m_weaponToInitialize; // 0x3d8(0x10)
	struct TArray<struct FDataTableRowHandle> m_pistolHandles; // 0x3e8(0x10)
	bool m_randomizeWeaponInventory; // 0x3f8(0x01)
	char pad_3F9[0x7]; // 0x3f9(0x07)
	struct FDataTableRowHandle m_firstAbility; // 0x400(0x10)
	struct FDataTableRowHandle m_secondAbility; // 0x410(0x10)
	struct FDataTableRowHandle m_thirdAbility; // 0x420(0x10)
	struct FDataTableRowHandle m_fourthAbility; // 0x430(0x10)
	bool m_randomizeAbilities; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct UYWeaponPlayerControllerRuntimeComponent* m_runtimeWeaponComponent; // 0x448(0x08)
	struct UYWeaponPlayerControllerInventoryComponent* m_inventoryWeaponController; // 0x450(0x08)
	struct UYControllerInventoryAbilityComponent* m_abilityInventoryComponent; // 0x458(0x08)
	struct UYPlayerInteractionComponent* m_playerInteractionComponent; // 0x460(0x08)
};

// Class Prospect.YAISense_AllyAlert
// Size: 0x90 (Inherited: 0x80)
struct UYAISense_AllyAlert : UAISense {
	struct TArray<struct FYAIAllyAlertEvent> m_registeredEvents; // 0x80(0x10)

	void RegisterAllyAlertEvent(struct AYAISquad* squad, struct AActor* sender, struct AActor* targetSensed); // Function Prospect.YAISense_AllyAlert.RegisterAllyAlertEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x190d080
};

// Class Prospect.YAISenseConfig_AllyAlert
// Size: 0x50 (Inherited: 0x48)
struct UYAISenseConfig_AllyAlert : UAISenseConfig {
	struct UYAISense_AllyAlert* m_implementationClass; // 0x48(0x08)
};

// Class Prospect.YAISenseHelperFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAISenseHelperFunctions : UObject {

	bool IsActorInsideBush(struct AActor* actorInsideBush); // Function Prospect.YAISenseHelperFunctions.IsActorInsideBush // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x190c970
};

// Class Prospect.YAISpawnHelperFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAISpawnHelperFunctions : UObject {

	bool RollOnAISquadSpawnRow(struct UObject* Context, struct FDataTableRowHandle rowHandle, struct FYAISquadDefinition Info, struct FString outError); // Function Prospect.YAISpawnHelperFunctions.RollOnAISquadSpawnRow // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x190d180
	bool IsEnemyTypeNavMeshSupported(struct UObject* WorldContextObject, enum class EYEnemyType enemyType, struct FYAINavMeshInfo navMeshInfo); // Function Prospect.YAISpawnHelperFunctions.IsEnemyTypeNavMeshSupported // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x190ca00
	struct ANavigationData* GetNavDataForAIActor(struct UObject* WorldContextObject, struct AActor* Actor); // Function Prospect.YAISpawnHelperFunctions.GetNavDataForAIActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x190c830
	struct FYAISpawnArchetypeData FindSpawnArchetypeData(struct UObject* WorldContextObject, enum class EYEnemyType enemyType); // Function Prospect.YAISpawnHelperFunctions.FindSpawnArchetypeData // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x190c590
	float FindHighestResetDistance(struct UObject* WorldContext, struct TArray<struct FYSquadAIType> squadAiTypes); // Function Prospect.YAISpawnHelperFunctions.FindHighestResetDistance // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x190c450
	void DetermineSupportedEnemyTypesByNavMeshAt(struct UObject* WorldContextObject, struct FVector locationContext, struct FVector searchExtent, struct FYAINavMeshInfo outNavMeshInfo); // Function Prospect.YAISpawnHelperFunctions.DetermineSupportedEnemyTypesByNavMeshAt // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x190c2d0
};

// Class Prospect.YAISpawnSquadLocation
// Size: 0x248 (Inherited: 0x240)
struct AYAISpawnSquadLocation : AActor {
	char pad_240[0x8]; // 0x240(0x08)

	void BP_OnSpawnLocationFound(struct FVector SpawnLocation); // Function Prospect.YAISpawnSquadLocation.BP_OnSpawnLocationFound // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YAISquad
// Size: 0x270 (Inherited: 0x240)
struct AYAISquad : AActor {
	char pad_240[0x10]; // 0x240(0x10)
	struct TArray<struct AYAICharacter*> m_squadCharacters; // 0x250(0x10)
	struct UYPersistentDataAISquad* m_persistentSquadData; // 0x260(0x08)
	char pad_268[0x8]; // 0x268(0x08)

	struct FString ToDebugString(); // Function Prospect.YAISquad.ToDebugString // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x190d360
	void OnSpawned(struct UYPersistentData* persistentData); // Function Prospect.YAISquad.OnSpawned // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x190cd60
	void OnCharacterDied(struct UYHealthComponent* healthComponent, struct AActor* instigatorDeath); // Function Prospect.YAISquad.OnCharacterDied // (Final|Native|Public) // @ game+0x190cbc0
	void OnAICharacterSpawned(struct AYAICharacter* spawnedAICharacter); // Function Prospect.YAISquad.OnAICharacterSpawned // (Final|Native|Public) // @ game+0x190cb30
	float GetRoamingRadiusOverride(); // Function Prospect.YAISquad.GetRoamingRadiusOverride // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x190c940
	struct FVector GetRoamingHomeLocation(); // Function Prospect.YAISquad.GetRoamingHomeLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x190c900
	struct FVector DetermineSpawnLocationForAICharacter(struct FVector spawnLoactionBase, struct FString outErrorCode); // Function Prospect.YAISquad.DetermineSpawnLocationForAICharacter // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x190c1b0
};

// Class Prospect.YAIStabilityComponent
// Size: 0x140 (Inherited: 0xb0)
struct UYAIStabilityComponent : UActorComponent {
	struct FDataTableRowHandle m_hitReactions; // 0xb0(0x10)
	char pad_C0[0x10]; // 0xc0(0x10)
	struct TMap<struct FName, struct FYStabilityData> m_stabilityData; // 0xd0(0x50)
	float m_tickTimeDecreaseStability; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct TArray<struct FGuid> m_appliedPerks; // 0x128(0x10)
	char pad_138[0x8]; // 0x138(0x08)

	void OnTakeDamage(struct FYDealtDamageData damageData); // Function Prospect.YAIStabilityComponent.OnTakeDamage // (Final|Native|Private|HasOutParms) // @ game+0x190cea0
	void OnStabilityAnimationStarted(struct UYBBObject_StabilityAnimationInfo* stabilityInfo); // Function Prospect.YAIStabilityComponent.OnStabilityAnimationStarted // (Final|Native|Private|BlueprintCallable) // @ game+0x190ce10
	void OnStabilityAnimationEnded(); // Function Prospect.YAIStabilityComponent.OnStabilityAnimationEnded // (Final|Native|Private|BlueprintCallable) // @ game+0x190cdf0
	bool GetAnimations(struct FName stabilityLevel, enum class EYHitZone hitZone, struct TArray<struct FYAIHitReactionAnimData> outAnimations, float outMaxAngleAllowed); // Function Prospect.YAIStabilityComponent.GetAnimations // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x190c660
	void DecreaseStability(); // Function Prospect.YAIStabilityComponent.DecreaseStability // (Final|Native|Private) // @ game+0x190c190
};

// Class Prospect.YAIStaggerComponent
// Size: 0x230 (Inherited: 0xb0)
struct UYAIStaggerComponent : UActorComponent {
	struct TMap<struct FName, struct FYAIStaggerDefinition> m_staggers; // 0xb0(0x50)
	struct TArray<struct FYAIStaggerTriggerHealthPercentage> m_percentageTriggers; // 0x100(0x10)
	struct TArray<struct FYAIStaggerTriggerWeakspotHealth> m_weakspotTriggers; // 0x110(0x10)
	char pad_120[0x8]; // 0x120(0x08)
	struct UAnimMontage* m_forcedStaggerAnimation; // 0x128(0x08)
	bool m_isStaggering; // 0x130(0x01)
	char pad_131[0x7]; // 0x131(0x07)
	struct FMulticastInlineDelegate BP_OnStaggerTriggered; // 0x138(0x10)
	char pad_148[0x8]; // 0x148(0x08)
	struct AYAICharacter* m_character; // 0x150(0x08)
	struct UYAIAnimationComponent* m_animationComponent; // 0x158(0x08)
	struct UAnimInstance* m_animInstance; // 0x160(0x08)
	char pad_168[0xc8]; // 0x168(0xc8)

	void OnTakeDamage(struct FYDealtDamageData damageData); // Function Prospect.YAIStaggerComponent.OnTakeDamage // (Final|Native|Public|HasOutParms) // @ game+0x190cf90
	void OnMontageEndedOrBlendingOut(struct UAnimMontage* montageEnded, bool interrupted); // Function Prospect.YAIStaggerComponent.OnMontageEndedOrBlendingOut // (Final|Native|Private) // @ game+0x190cc90
	void AddScalarParameterUpdate(struct FName ParameterName, float TargetValue, float originalValue, float InterpolationTime); // Function Prospect.YAIStaggerComponent.AddScalarParameterUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x190c030
};

// Class Prospect.YAITokenComponent
// Size: 0xb8 (Inherited: 0xb0)
struct UYAITokenComponent : UActorComponent {
	bool m_hasDamageTokenForCurrentTarget; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
};

// Class Prospect.YAITurnComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UYAITurnComponent : UActorComponent {
	float m_turnYawThreshold; // 0xb0(0x04)
	float m_turnAnimatBlockTime; // 0xb4(0x04)
	char pad_B8[0x4]; // 0xb8(0x04)
	bool m_turnEnabled; // 0xbc(0x01)
	char pad_BD[0x3]; // 0xbd(0x03)
};

// Class Prospect.YAITurretController
// Size: 0x3d8 (Inherited: 0x368)
struct AYAITurretController : AAIController {
	bool m_canTargetHumanPlayers; // 0x368(0x01)
	bool m_canTargetOtherTurrets; // 0x369(0x01)
	char pad_36A[0x6]; // 0x36a(0x06)
	struct FMulticastInlineDelegate BP_OnAimTargetChanged; // 0x370(0x10)
	struct FName m_aimAtCharacterSocketName; // 0x380(0x08)
	struct FRotator m_initialAimRotation; // 0x388(0x0c)
	char pad_394[0x4]; // 0x394(0x04)
	struct AYTurretPawn* m_controlledTurret; // 0x398(0x08)
	struct UBehaviorTree* m_behaviorTree; // 0x3a0(0x08)
	struct UAISenseConfig_Sight* m_sightConfig; // 0x3a8(0x08)
	struct FYAimTargetInfo m_aimTargetInfo; // 0x3b0(0x18)
	struct TArray<struct AActor*> m_seenEnemyActors; // 0x3c8(0x10)

	void SetAimTargetLocation(struct FVector aimTargetLocation); // Function Prospect.YAITurretController.SetAimTargetLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x19109a0
	void SetAimTarget(struct AActor* AimTarget); // Function Prospect.YAITurretController.SetAimTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1910910
	void OnTurretStateChanged(enum class EYTurretState newState); // Function Prospect.YAITurretController.OnTurretStateChanged // (Final|Native|Protected) // @ game+0x1910890
	void OnPerceptionUpdated(struct TArray<struct AActor*> UpdatedActors); // Function Prospect.YAITurretController.OnPerceptionUpdated // (Final|Native|Protected|HasOutParms) // @ game+0x19107e0
	bool HasValidTargetLocation(); // Function Prospect.YAITurretController.HasValidTargetLocation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19107b0
	struct TArray<struct AActor*> GetSeenEnemies(); // Function Prospect.YAITurretController.GetSeenEnemies // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19106f0
	struct FVector GetAimTargetLocation(); // Function Prospect.YAITurretController.GetAimTargetLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x19106b0
	struct AActor* GetAimTarget(); // Function Prospect.YAITurretController.GetAimTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1910680
	struct FRotator GetAimRotation(); // Function Prospect.YAITurretController.GetAimRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1910640
	void ClearAimTarget(); // Function Prospect.YAITurretController.ClearAimTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1910620
};

// Class Prospect.YAIUpdateManager
// Size: 0xc8 (Inherited: 0xb0)
struct UYAIUpdateManager : UActorComponent {
	struct TArray<struct UYAIAggroComponent*> m_aiAggroComponents; // 0xb0(0x10)
	char pad_C0[0x8]; // 0xc0(0x08)
};

// Class Prospect.YAmmoExternalFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAmmoExternalFunctions : UObject {
};

// Class Prospect.YAnalytics
// Size: 0x30 (Inherited: 0x28)
struct UYAnalytics : UObject {
	struct UYAnalyticsSender* m_analyticsSender; // 0x28(0x08)

	void SetAnalyticsContextData(struct FString UserId, struct FString GameMode, bool isRanked); // Function Prospect.YAnalytics.SetAnalyticsContextData // (Final|Native|Public) // @ game+0x1917680
	void OnLoginSucceeded(); // Function Prospect.YAnalytics.OnLoginSucceeded // (Final|Native|Public|Const) // @ game+0x1916e20
	void BP_SendAnalyticsNoPlayer(struct FString EventName, struct FYBaseAnalyticsEvent anyAnalyticsStruct); // Function Prospect.YAnalytics.BP_SendAnalyticsNoPlayer // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ecb80
	void BP_SendAnalytics(struct FUniqueNetIdRepl PlayerId, struct FString EventName, struct FYBaseAnalyticsEvent anyAnalyticsStruct); // Function Prospect.YAnalytics.BP_SendAnalytics // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x14ec930
};

// Class Prospect.YAnalyticsFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UYAnalyticsFunctionLibrary : UBlueprintFunctionLibrary {

	void SendMeteorAnalyticsEvent(struct AActor* meteorActorContext, bool isLanded); // Function Prospect.YAnalyticsFunctionLibrary.SendMeteorAnalyticsEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19175c0
	void SendDistanceTravelledEvent(struct AYPlayerCharacter* Instigator, float distanceTravelled); // Function Prospect.YAnalyticsFunctionLibrary.SendDistanceTravelledEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1917500
	void SendBigDrillFlyToEvent(struct UObject* WorldContextObject, struct FVector currentLocation, struct FVector flyToLocation); // Function Prospect.YAnalyticsFunctionLibrary.SendBigDrillFlyToEvent // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x19173e0
};

// Class Prospect.YAnalyticsLootHelper
// Size: 0x28 (Inherited: 0x28)
struct UYAnalyticsLootHelper : UObject {
};

// Class Prospect.YAnimationFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAnimationFunctions : UBlueprintFunctionLibrary {

	enum class EYHitZone DetermineHitZoneWithZoneMapping(struct FYDealtDamageData Data, struct TMap<enum class EYHitZone, struct FName> boneToHitZoneMapping); // Function Prospect.YAnimationFunctions.DetermineHitZoneWithZoneMapping // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x19166c0
};

// Class Prospect.YAnimHelperFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAnimHelperFunctions : UObject {

	bool PlayMontageRatedScaledToMatchDuration(struct UAnimInstance* animtInstance, struct UAnimMontage* AnimMontage, float durationToMatch, float outPlayRate, float playRateMin, float playRateMax); // Function Prospect.YAnimHelperFunctions.PlayMontageRatedScaledToMatchDuration // (Final|Native|Static|Private|HasOutParms|BlueprintCallable) // @ game+0x1917130
};

// Class Prospect.YAnimNotify_BlendToRagdoll
// Size: 0x38 (Inherited: 0x38)
struct UYAnimNotify_BlendToRagdoll : UAnimNotify {
};

// Class Prospect.YAnimNotify_PlayParticleBlueprint
// Size: 0x90 (Inherited: 0x90)
struct UYAnimNotify_PlayParticleBlueprint : UAnimNotify_PlayParticleEffect {

	void PlayParticle(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Prospect.YAnimNotify_PlayParticleBlueprint.PlayParticle // (Final|Native|Private|BlueprintCallable|Const) // @ game+0x1917310
};

// Class Prospect.YAnimNotifyState_BlockLeftHand
// Size: 0x30 (Inherited: 0x30)
struct UYAnimNotifyState_BlockLeftHand : UAnimNotifyState {
};

// Class Prospect.AnimNotifyState_BranchingPoint
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_BranchingPoint : UAnimNotifyState {
};

// Class Prospect.YAnimNotifyState_DTRateScaleAdjustment
// Size: 0x30 (Inherited: 0x30)
struct UYAnimNotifyState_DTRateScaleAdjustment : UAnimNotifyState {
};

// Class Prospect.YAnimNotifyState_PlayLoopingSound
// Size: 0x48 (Inherited: 0x30)
struct UYAnimNotifyState_PlayLoopingSound : UAnimNotifyState {
	struct USoundBase* m_sound; // 0x30(0x08)
	float m_fadeOutTime; // 0x38(0x04)
	char pad_3C[0xc]; // 0x3c(0x0c)
};

// Class Prospect.YAnimNotifyState_PlayRate
// Size: 0x30 (Inherited: 0x30)
struct UYAnimNotifyState_PlayRate : UAnimNotifyState {
};

// Class Prospect.YAnimNotifyState_TargetConverge
// Size: 0x30 (Inherited: 0x30)
struct UYAnimNotifyState_TargetConverge : UAnimNotifyState {

	void ReceiveRootMotionExtracted(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, struct FTransform RootMotion, float FrameDeltaTime, float currentTime, float RemainingTime); // Function Prospect.YAnimNotifyState_TargetConverge.ReceiveRootMotionExtracted // (Event|Public|HasDefaults|BlueprintEvent|Const) // @ game+0x1e02480
};

// Class Prospect.YMapMarkerData
// Size: 0x148 (Inherited: 0x28)
struct UYMapMarkerData : UObject {
	struct TArray<struct APlayerController*> m_discoveredPlayers; // 0x28(0x10)
	struct AActor* m_owner; // 0x38(0x08)
	struct UYCharacterCloakComponent* m_cloakComponent; // 0x40(0x08)
	struct TArray<struct APlayerController*> m_forcedVisibilityPlayers; // 0x48(0x10)
	enum class EYMapMarkerType m_markerType; // 0x58(0x01)
	enum class EYMapMarkerState m_markerState; // 0x59(0x01)
	char pad_5A[0x6]; // 0x5a(0x06)
	struct FText m_markerTitle; // 0x60(0x18)
	char pad_78[0x10]; // 0x78(0x10)
	struct UYWidget_MapMarker* m_markerWidgetClass; // 0x88(0x08)
	bool m_onlyRelevantToOwner; // 0x90(0x01)
	bool m_onlyRelevantToOwnerTeam; // 0x91(0x01)
	bool m_alwaysVisible; // 0x92(0x01)
	bool m_visibleDuringLobby; // 0x93(0x01)
	bool m_onlyRelevantInLobby; // 0x94(0x01)
	bool m_staysRelevantOnceDiscovered; // 0x95(0x01)
	bool m_centerMinimapOnThisMarker; // 0x96(0x01)
	bool m_shouldFollowActorPosition; // 0x97(0x01)
	bool m_onlyFollowActorPositionForAlly; // 0x98(0x01)
	bool m_autoRemoveWhenHealthEmpty; // 0x99(0x01)
	bool m_canChangeStateDuringEvacuation; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
	float m_timeLeft; // 0xa0(0x04)
	float m_timeOutDuration; // 0xa4(0x04)
	bool m_hideFromOwner; // 0xa8(0x01)
	bool m_ownerIsDead; // 0xa9(0x01)
	char pad_AA[0x2]; // 0xaa(0x02)
	float m_distanceTowardsLocalPlayer; // 0xac(0x04)
	bool m_shouldShowLocalDistanceTowardsPlayer; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	int32_t m_visibilityDistance; // 0xb4(0x04)
	struct FVector m_initialLocation; // 0xb8(0x0c)
	struct FVector m_worldLocation; // 0xc4(0x0c)
	struct FVector m_authorithyLastCachedLocation; // 0xd0(0x0c)
	struct FRotator m_authorithyLastCachedRotation; // 0xdc(0x0c)
	float m_surveilledActorTimeOutDuration; // 0xe8(0x04)
	float m_surveilledActorRefreshTime; // 0xec(0x04)
	int32_t m_localEvaluationHandle; // 0xf0(0x04)
	char pad_F4[0x20]; // 0xf4(0x20)
	struct FRotator m_worldRotation; // 0x114(0x0c)
	char pad_120[0x28]; // 0x120(0x28)

	void OnRep_MarkerWidgetClass(); // Function Prospect.YMapMarkerData.OnRep_MarkerWidgetClass // (Final|Native|Private) // @ game+0x19be570
};

// Class Prospect.YAreaMapMarkerData
// Size: 0x158 (Inherited: 0x148)
struct UYAreaMapMarkerData : UYMapMarkerData {
	float m_searchRadius; // 0x148(0x04)
	float m_randAngleRad; // 0x14c(0x04)
	float m_randRadius; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)

	void SetSearchRadius(float Radius); // Function Prospect.YAreaMapMarkerData.SetSearchRadius // (Final|Native|Public|BlueprintCallable) // @ game+0x19177c0
	float GetSearchRadius(); // Function Prospect.YAreaMapMarkerData.GetSearchRadius // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1916b20
	struct FVector2D GetRandomizedScreenOffset(float mapScaleValue); // Function Prospect.YAreaMapMarkerData.GetRandomizedScreenOffset // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1916a80
};

// Class Prospect.YArmorComponent
// Size: 0x128 (Inherited: 0xb0)
struct UYArmorComponent : UActorComponent {
	struct FMulticastInlineDelegate OnArmorUpdated; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnArmorDurabilityUpdated; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnArmorBrokenEvent; // 0xd0(0x10)
	float m_effectiveHealthPerArmorConstant; // 0xe0(0x04)
	float m_damageReductionScalarMin; // 0xe4(0x04)
	float m_damageReductionScalarMax; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct TArray<struct FYActiveArmorData> m_activeArmor; // 0xf0(0x10)
	struct TArray<struct FGuid> m_perksApplied; // 0x100(0x10)
	struct TArray<struct FGuid> m_attributesApplied; // 0x110(0x10)
	char pad_120[0x8]; // 0x120(0x08)

	void OnRep_ActiveArmor(); // Function Prospect.YArmorComponent.OnRep_ActiveArmor // (Final|Native|Protected) // @ game+0x1916ed0
	bool HasArmorEquipped(enum class EYItemType ItemType); // Function Prospect.YArmorComponent.HasArmorEquipped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1916cf0
	void HandleOnPlayerStateChanged(struct APlayerState* PlayerState); // Function Prospect.YArmorComponent.HandleOnPlayerStateChanged // (Final|Native|Protected) // @ game+0x1916c60
	void HandleOnPlayerSetUpdated(struct UYStateInventoryComponent* stateInventoryComponent); // Function Prospect.YArmorComponent.HandleOnPlayerSetUpdated // (Final|Native|Protected) // @ game+0x1916bd0
	void HandleOnControllerChanged(struct AController* Controller); // Function Prospect.YArmorComponent.HandleOnControllerChanged // (Final|Native|Protected) // @ game+0x1916b40
	struct TArray<struct FYActiveArmorData> GetActiveArmor(); // Function Prospect.YArmorComponent.GetActiveArmor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1916990
	void EvaluateDamage(struct FYDealtDamageData outModifiedDamageData); // Function Prospect.YArmorComponent.EvaluateDamage // (Final|Native|Protected|HasOutParms) // @ game+0x19168a0
};

// Class Prospect.YAssetVariationComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UYAssetVariationComponent : UActorComponent {
	struct FMulticastInlineDelegate BP_OnRowLoaded; // 0xb0(0x10)
	struct TArray<struct UObject*> m_loadedAssets; // 0xc0(0x10)

	void OnRowLoaded(struct FDataTableRowHandle rowHandle); // Function Prospect.YAssetVariationComponent.OnRowLoaded // (Final|Native|Private) // @ game+0x1916ef0
	void LoadRowAsync(struct FDataTableRowHandle rowHandle); // Function Prospect.YAssetVariationComponent.LoadRowAsync // (Final|Native|Public|BlueprintCallable) // @ game+0x1916d80
};

// Class Prospect.YAudioActorSupportComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYAudioActorSupportComponent : UActorComponent {

	void OnSquadsChanged(struct TArray<struct FYOutpostFriendInfo> squadMemberInfos); // Function Prospect.YAudioActorSupportComponent.OnSquadsChanged // (Final|Native|Protected|HasOutParms) // @ game+0x1916f90
	void OnPlayerStateSetOnLocalPlayerController(struct APlayerState* PlayerState); // Function Prospect.YAudioActorSupportComponent.OnPlayerStateSetOnLocalPlayerController // (Final|Native|Protected) // @ game+0x1916e40
	void OnPlayerStateAssigned(struct AYPlayerState* PlayerState); // Function Prospect.YAudioActorSupportComponent.OnPlayerStateAssigned // (Final|Native|Protected) // @ game+0x1916e40
};

// Class Prospect.YAudioManager
// Size: 0xb8 (Inherited: 0x28)
struct UYAudioManager : UObject {
	struct TArray<struct UObject*> m_referencingAysncLoadedVoiceLines; // 0x28(0x10)
	float m_multiplierTransientMasterVolumeDucking; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct TArray<struct FSoftObjectPath> m_audioDataTablesToLoadAsync; // 0x40(0x10)
	struct TArray<struct UDataTable*> m_loadedDatatables; // 0x50(0x10)
	char pad_60[0x8]; // 0x60(0x08)
	struct TMap<struct FString, struct FDataTableRowHandle> m_cachedVORowHandles; // 0x68(0x50)
};

// Class Prospect.YAudioValidationFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAudioValidationFunctions : UObject {
};

// Class Prospect.YAudioVolume
// Size: 0x350 (Inherited: 0x2e8)
struct AYAudioVolume : AAudioVolume {
	struct TSoftObjectPtr<struct USoundCue> m_onEnterSoundCue; // 0x2e8(0x28)
	struct USoundClass* m_soundClass; // 0x310(0x08)
	float m_volumeMultiplier; // 0x318(0x04)
	float m_pitchMultiplier; // 0x31c(0x04)
	struct FVector m_soundLocation; // 0x320(0x0c)
	float m_fadeInDuration; // 0x32c(0x04)
	float m_fadeVolumeLevel; // 0x330(0x04)
	float m_fadeOutDuration; // 0x334(0x04)
	float m_fadeOutVolumeLevel; // 0x338(0x04)
	char pad_33C[0x4]; // 0x33c(0x04)
	struct UAudioComponent* m_audioComponent; // 0x340(0x08)
	struct AYPlayerCharacter* m_listeningPlayer; // 0x348(0x08)

	void HandleOnSoundLoaded(); // Function Prospect.YAudioVolume.HandleOnSoundLoaded // (Final|Native|Private) // @ game+0x191b8f0
	void HandleOnListenerDied(struct UYCharacterDeathComponent* deathComponent); // Function Prospect.YAudioVolume.HandleOnListenerDied // (Final|Native|Private) // @ game+0x191b860
	void HandleOnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Prospect.YAudioVolume.HandleOnEndOverlap // (Final|Native|Private) // @ game+0x191b700
	void HandleOnBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Prospect.YAudioVolume.HandleOnBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0x191b4d0
};

// Class Prospect.YAudioVolumeHelperFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAudioVolumeHelperFunctions : UObject {

	void SetVolume(float Value, enum class EYVolumeBusType volumeType); // Function Prospect.YAudioVolumeHelperFunctions.SetVolume // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x191c2d0
	float GetVolume(enum class EYVolumeBusType volumeType); // Function Prospect.YAudioVolumeHelperFunctions.GetVolume // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x191b450
};

// Class Prospect.YAuthorization
// Size: 0xd8 (Inherited: 0x28)
struct UYAuthorization : UObject {
	struct FMulticastInlineDelegate OnRegistered; // 0x28(0x10)
	struct FMulticastInlineDelegate OnAuthServerLoginResult; // 0x38(0x10)
	char pad_48[0x10]; // 0x48(0x10)
	struct FMulticastInlineDelegate OnMaintenanceModeStateReceived; // 0x58(0x10)
	char pad_68[0x8]; // 0x68(0x08)
	struct FString m_authBaseUrlSteam; // 0x70(0x10)
	struct FString m_authBaseUrlEos; // 0x80(0x10)
	struct UYPlayfabInstance* m_playfabInstance; // 0x90(0x08)
	char pad_98[0x40]; // 0x98(0x40)

	bool TryAutoLogin(); // Function Prospect.YAuthorization.TryAutoLogin // (Final|Native|Public|BlueprintCallable) // @ game+0x191c520
	void OnPlayfabLoginDone(bool SUCCESS, struct FString playfabTitleId); // Function Prospect.YAuthorization.OnPlayfabLoginDone // (Final|Native|Protected) // @ game+0x191bf50
	bool Login(struct FString Login, struct FString Password, struct FString authType); // Function Prospect.YAuthorization.Login // (Final|Native|Public|BlueprintCallable) // @ game+0x191bc50
	bool isConnected(); // Function Prospect.YAuthorization.isConnected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x191c630
	struct UYAuthorization* GetInstance(struct UObject* objectContext); // Function Prospect.YAuthorization.GetInstance // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191b2b0
	enum class EYAuthorizationUsageType GetAuthorizationType(); // Function Prospect.YAuthorization.GetAuthorizationType // (Final|Native|Public|BlueprintCallable) // @ game+0x191afc0
	void AuthServerRegisteredDelegate__DelegateSignature(bool Result, struct FString Error); // DelegateFunction Prospect.YAuthorization.AuthServerRegisteredDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
	void AuthServerReceivedMaintenanceModeState__DelegateSignature(bool Result, struct FString Error); // DelegateFunction Prospect.YAuthorization.AuthServerReceivedMaintenanceModeState__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
	void AuthServerLoginResultDelegate__DelegateSignature(enum class EYLoginResult loginResult); // DelegateFunction Prospect.YAuthorization.AuthServerLoginResultDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
};

// Class Prospect.YAutoDestroyComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYAutoDestroyComponent : UActorComponent {

	void OnRelatedPlayerCharacterDestroyed(struct AActor* actorDestroyed); // Function Prospect.YAutoDestroyComponent.OnRelatedPlayerCharacterDestroyed // (Final|Native|Public) // @ game+0x191c040
};

// Class Prospect.YAutomationHelperFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYAutomationHelperFunctions : UObject {

	void YRequestQuit(bool Force, struct FString quitWithErrorMessage); // Function Prospect.YAutomationHelperFunctions.YRequestQuit // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191c550
	struct AActor* SpawnAutomationMangerActor(struct AActor* Actor, struct UObject* ActorClass, struct FTransform ActorLotation); // Function Prospect.YAutomationHelperFunctions.SpawnAutomationMangerActor // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x191c390
	void PrepareData(struct TArray<struct FYWeaponSuitableMods> weaponSuitableMods, struct TArray<struct FYWeaponSuitableModsCombination> outCombinationNames); // Function Prospect.YAutomationHelperFunctions.PrepareData // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x191c0d0
	void ModDamageDataToCSV(struct TArray<struct FYWeaponModCombinationWithDamage> damageData); // Function Prospect.YAutomationHelperFunctions.ModDamageDataToCSV // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191be60
	void LogWeaponDamageAutomationString(struct FString LogString); // Function Prospect.YAutomationHelperFunctions.LogWeaponDamageAutomationString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191b9d0
	void LogTestResult(enum class EYAutomationTestResult testResult, struct FString LogString, struct FString testName); // Function Prospect.YAutomationHelperFunctions.LogTestResult // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191bab0
	void LogSoakTestString(struct FString LogString); // Function Prospect.YAutomationHelperFunctions.LogSoakTestString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191b9d0
	void LogErrorWeaponDamageAutomationString(struct FString LogString); // Function Prospect.YAutomationHelperFunctions.LogErrorWeaponDamageAutomationString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191b9d0
	void LogErrorSoakTestString(struct FString LogString); // Function Prospect.YAutomationHelperFunctions.LogErrorSoakTestString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191b9d0
	bool IsAutomationTesting(); // Function Prospect.YAutomationHelperFunctions.IsAutomationTesting // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x191b910
	bool IsAutomatedSmokecheck(); // Function Prospect.YAutomationHelperFunctions.IsAutomatedSmokecheck // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x8da950
	struct FName GetStreamingLevelNameFromActor(struct AActor* Actor); // Function Prospect.YAutomationHelperFunctions.GetStreamingLevelNameFromActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x191b3c0
	struct FString GetMapName(); // Function Prospect.YAutomationHelperFunctions.GetMapName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191b340
	void GetCombinationsOfMods(struct TArray<struct FYWeaponSuitableMods> weaponSuitableMods, struct TArray<struct FYWeaponSuitableModsCombination> outCombination, int32_t numOfModSlots, int32_t numOfCombinations, int32_t currentModSlotIdx); // Function Prospect.YAutomationHelperFunctions.GetCombinationsOfMods // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x191aff0
	struct FYPlayerAutomationData FindActiveAutomationData(struct UObject* objectContext); // Function Prospect.YAutomationHelperFunctions.FindActiveAutomationData // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191ad50
	void CleanupProfilingFolder(); // Function Prospect.YAutomationHelperFunctions.CleanupProfilingFolder // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x191ac40
};

// Class Prospect.YAutomationManager
// Size: 0x78 (Inherited: 0x28)
struct UYAutomationManager : UObject {
	struct FYAutomationLoadingMetrics m_automationMetrics; // 0x28(0x50)

	void FinishedLoadingMap(); // Function Prospect.YAutomationManager.FinishedLoadingMap // (Final|Native|Public|BlueprintCallable) // @ game+0x191afa0
};

// Class Prospect.YBackendControllerLibrary
// Size: 0x28 (Inherited: 0x28)
struct UYBackendControllerLibrary : UObject {

	bool isConnected(struct UObject* objectContext); // Function Prospect.YBackendControllerLibrary.isConnected // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x191b940
	struct FString FindUniqueId(struct UObject* objectContext, enum class EYBackendValidation validation); // Function Prospect.YBackendControllerLibrary.FindUniqueId // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x191ae90
};

// Class Prospect.YBackendFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UYBackendFunctionLibrary : UObject {
};

// Class Prospect.YBackendInventoryModel
// Size: 0xf0 (Inherited: 0x28)
struct UYBackendInventoryModel : UObject {
	struct FMulticastInlineDelegate OnInitialized; // 0x28(0x10)
	struct FMulticastInlineDelegate OnInventoryStateChanged; // 0x38(0x10)
	struct FString m_userId; // 0x48(0x10)
	int32_t m_status; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FYPlayerInventory m_backendRawInventory; // 0x60(0x18)
	struct FYInventorySnapshot m_data; // 0x78(0x78)

	void EvaluateInitializationStatus(struct TArray<enum class EYInventoryPlayerTypes> Type); // Function Prospect.YBackendInventoryModel.EvaluateInitializationStatus // (Final|Native|Private) // @ game+0x191ac60
};

// Class Prospect.YBannerActor
// Size: 0x258 (Inherited: 0x240)
struct AYBannerActor : AActor {
	bool m_isLocalAttachedBanner; // 0x240(0x01)
	char pad_241[0x7]; // 0x241(0x07)
	struct UYDataTableRowAssociationComponent* m_rowAssociationComponent; // 0x248(0x08)
	bool m_isCustomizationBanner; // 0x250(0x01)
	char pad_251[0x7]; // 0x251(0x07)

	void BP_SetIsAttached(bool attachedStatus); // Function Prospect.YBannerActor.BP_SetIsAttached // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void BP_OnOwnerChanged(); // Function Prospect.YBannerActor.BP_OnOwnerChanged // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YBBObject_MeleeAttackInfo
// Size: 0x48 (Inherited: 0x28)
struct UYBBObject_MeleeAttackInfo : UObject {
	int32_t m_attackIndex; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct UAnimMontage* m_animMontage; // 0x30(0x08)
	struct FVector m_attackLocation; // 0x38(0x0c)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Prospect.YBBObject_StabilityAnimationInfo
// Size: 0x48 (Inherited: 0x28)
struct UYBBObject_StabilityAnimationInfo : UObject {
	bool m_canBeInterruptedByDodge; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct UAnimMontage* m_animMontage; // 0x30(0x08)
	float m_yawRotationGoal; // 0x38(0x04)
	struct FName m_stabilityDefinitionName; // 0x3c(0x08)
	float m_stabilityPriorityLevel; // 0x44(0x04)
};

// Class Prospect.YBIHookHelperFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYBIHookHelperFunctions : UObject {

	bool IsInStation(struct UObject* WorldContextObject); // Function Prospect.YBIHookHelperFunctions.IsInStation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19213c0
	bool IsInLobby(struct UObject* WorldContextObject); // Function Prospect.YBIHookHelperFunctions.IsInLobby // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1921330
	struct FString GetUniquePlayerIDAsString(struct AActor* actorContext); // Function Prospect.YBIHookHelperFunctions.GetUniquePlayerIDAsString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x19211b0
	int32_t GetTimeSinceJoined(struct APlayerState* PlayerState); // Function Prospect.YBIHookHelperFunctions.GetTimeSinceJoined // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1921120
	int32_t GetMatchTimeInSeconds(struct UObject* WorldContextObject); // Function Prospect.YBIHookHelperFunctions.GetMatchTimeInSeconds // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1921090
	int32_t GetLobbyTimeInSecondsServer(struct UObject* WorldContextObject); // Function Prospect.YBIHookHelperFunctions.GetLobbyTimeInSecondsServer // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1921000
	struct FString FindSpecificGameContext(struct UObject* WorldContextObject); // Function Prospect.YBIHookHelperFunctions.FindSpecificGameContext // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1920de0
};

// Class Prospect.YBlockableComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UYBlockableComponent : UActorComponent {
	bool m_isBlocked; // 0xb0(0x01)
	bool m_canBlock; // 0xb1(0x01)
	char pad_B2[0xe]; // 0xb2(0x0e)

	void UnblockObject(); // Function Prospect.YBlockableComponent.UnblockObject // (Final|Native|Public|BlueprintCallable) // @ game+0x1921950
	bool IsBlocked(); // Function Prospect.YBlockableComponent.IsBlocked // (Final|Native|Public|BlueprintCallable) // @ game+0x1921310
	void BlockObject(int32_t timeToBlock); // Function Prospect.YBlockableComponent.BlockObject // (Final|Native|Public|BlueprintCallable) // @ game+0x1920580
};

// Class Prospect.YBlueprintFunctionsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UYBlueprintFunctionsLibrary : UObject {

	bool TryGetItemTextDataFromBlueprintRowHandle(struct UObject* objCtx, struct FDataTableRowHandle bpRowHandle, struct FYCraftSuccessfulPopupText craftSuccessfulPopupText); // Function Prospect.YBlueprintFunctionsLibrary.TryGetItemTextDataFromBlueprintRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1921790
	bool TryGetDeviceTypeTextFromItemType(struct UObject* objCtx, struct FYItemDataTableRowBase itemDataTableRowBase, struct FYCraftSuccessfulPopupText FYCraftSuccessfulPopupText); // Function Prospect.YBlueprintFunctionsLibrary.TryGetDeviceTypeTextFromItemType // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x19215b0
	bool IsAnimationPreview(struct AActor* Actor); // Function Prospect.YBlueprintFunctionsLibrary.IsAnimationPreview // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1921280
	struct FString GetCraftingStationRowName(); // Function Prospect.YBlueprintFunctionsLibrary.GetCraftingStationRowName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1920f80
	int32_t FindPlayerFactionLevelForFaction(struct AActor* actorContext, struct FString factionId); // Function Prospect.YBlueprintFunctionsLibrary.FindPlayerFactionLevelForFaction // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1920d00
	bool FindAllShopHandleFromShopRow(struct UDataTable* factionDataTable, bool excludeQuickShop, struct TArray<struct FDataTableRowHandle> outRowHandles); // Function Prospect.YBlueprintFunctionsLibrary.FindAllShopHandleFromShopRow // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1920bd0
	bool DoesShopStringCorrespondToAFaction(struct FString shopId); // Function Prospect.YBlueprintFunctionsLibrary.DoesShopStringCorrespondToAFaction // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1920b30
	bool DoesShopNameCorrespondToAFaction(struct FName shopId); // Function Prospect.YBlueprintFunctionsLibrary.DoesShopNameCorrespondToAFaction // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1920aa0
	struct FText CraftingUnavailableReasonToText(enum class EYCraftingUnavailableReason unavailableReason); // Function Prospect.YBlueprintFunctionsLibrary.CraftingUnavailableReasonToText // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19209c0
	bool CanSkipItemCrafting(struct AActor* wlrdCtx, struct FString callerContextString, struct FYShopItem shopItem); // Function Prospect.YBlueprintFunctionsLibrary.CanSkipItemCrafting // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1920830
	bool CanCraftItem(struct AActor* wlrdCtx, struct FString callerContextString, struct FYShopItem shopItem, enum class EYCraftingUnavailableReason outUnavailableReason, int32_t repeatTimes); // Function Prospect.YBlueprintFunctionsLibrary.CanCraftItem // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1920610
};

// Class Prospect.YBlueprintLogFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYBlueprintLogFunctions : UObject {

	void LogString(struct UObject* optionalContextObject, struct FString String, enum class EYLogCategory logCategory, enum class EYLogVerbosity Verbosity); // Function Prospect.YBlueprintLogFunctions.LogString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1921450
};

// Class Prospect.YBoolHelperFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYBoolHelperFunctions : UObject {

	struct FString GetBoolAsStringWithColor(bool Value); // Function Prospect.YBoolHelperFunctions.GetBoolAsStringWithColor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1920eb0
};

// Class Prospect.YBTDecorator_DoesPathExist
// Size: 0xd0 (Inherited: 0xc8)
struct UYBTDecorator_DoesPathExist : UBTDecorator_DoesPathExist {
	float m_maxPathLength; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
};

// Class Prospect.YBTService_Aggro
// Size: 0xd0 (Inherited: 0x98)
struct UYBTService_Aggro : UBTService_BlueprintBase {
	struct AYAIController* m_controllerAIOwner; // 0x98(0x08)
	struct UYAIAggroComponent* m_cachedAIDataComponent; // 0xa0(0x08)
	struct FBlackboardKeySelector m_combatActorKey; // 0xa8(0x28)

	void BP_OnCombatTargetUpdated(struct AActor* targetActor, struct FYAITargetInfo targetInfo); // Function Prospect.YBTService_Aggro.BP_OnCombatTargetUpdated // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YBTService_AIActionContextName
// Size: 0xa0 (Inherited: 0x70)
struct UYBTService_AIActionContextName : UBTService {
	struct FBlackboardKeySelector m_keyAIActionContextName; // 0x70(0x28)
	struct FName m_aiContextActionName; // 0x98(0x08)
};

// Class Prospect.YBTService_BoolGuard
// Size: 0x98 (Inherited: 0x98)
struct UYBTService_BoolGuard : UBTService_BlackboardBase {
};

// Class Prospect.YBTService_EvaluateMeleeAttacks
// Size: 0x168 (Inherited: 0x70)
struct UYBTService_EvaluateMeleeAttacks : UBTService {
	char pad_70[0x50]; // 0x70(0x50)
	struct FBlackboardKeySelector m_keyCombatTarget; // 0xc0(0x28)
	struct FBlackboardKeySelector m_keyMeleeAttack; // 0xe8(0x28)
	struct FBlackboardKeySelector m_keyIsInComboWindow; // 0x110(0x28)
	struct FBlackboardKeySelector m_keyAttackOutAnimMontage; // 0x138(0x28)
	struct UAnimMontage* m_cachedAttackMontage; // 0x160(0x08)
};

// Class Prospect.YBTService_GameplayFocus
// Size: 0xa0 (Inherited: 0xa0)
struct UYBTService_GameplayFocus : UBTService_DefaultFocus {
};

// Class Prospect.YBTService_Stability
// Size: 0xe8 (Inherited: 0x70)
struct UYBTService_Stability : UBTService {
	struct FBlackboardKeySelector m_keyStabilityAnimationInfo; // 0x70(0x28)
	struct FBlackboardKeySelector m_keyStabilityAnimationIsBlocked; // 0x98(0x28)
	struct FBlackboardKeySelector m_keyCurrentAIAction; // 0xc0(0x28)

	void OnStabilityLevelThresholdReached(struct APawn* Pawn, struct FYStabilityData stabilityData, struct FYAIStabilityDefinition stabilityDefinition, struct FYDealtDamageData damageData); // Function Prospect.YBTService_Stability.OnStabilityLevelThresholdReached // (Final|Native|Public|HasOutParms) // @ game+0x1926080
};

// Class Prospect.YBTTask_AimTurretAtBBEntry
// Size: 0xa0 (Inherited: 0xa0)
struct UYBTTask_AimTurretAtBBEntry : UBTTask_RotateToFaceBBEntry {
};

// Class Prospect.YBTTask_PlayAnimation
// Size: 0x110 (Inherited: 0xa8)
struct UYBTTask_PlayAnimation : UBTTask_BlueprintBase {
	struct AYAICharacter* m_characterAIOwner; // 0xa8(0x08)
	struct UAnimInstance* m_animInstance; // 0xb0(0x08)
	struct UAnimMontage* m_animationMontage; // 0xb8(0x08)
	enum class EYAnimTaskFinishCondition m_taskFinishCondition; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
	struct FBlackboardKeySelector m_blackboardValueToObserve; // 0xc8(0x28)
	bool m_expectedValueAfterChange; // 0xf0(0x01)
	char pad_F1[0x3]; // 0xf1(0x03)
	float m_timeBeforeMontageEnds; // 0xf4(0x04)
	struct FName m_montageSectionToPlay; // 0xf8(0x08)
	char pad_100[0x10]; // 0x100(0x10)

	void OnMontageEndedOrBlendingOut(struct UAnimMontage* montageEnded, bool interrupted); // Function Prospect.YBTTask_PlayAnimation.OnMontageEndedOrBlendingOut // (Final|Native|Public) // @ game+0x1925f70
	struct UAnimMontage* GetAnimationToPlay(bool allowPhysicsRotationDuringAnimation, bool finishNodeSuccesfullyIfNoAnimIsProvided); // Function Prospect.YBTTask_PlayAnimation.GetAnimationToPlay // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1e02480
	void FinishTaskDueTimer(); // Function Prospect.YBTTask_PlayAnimation.FinishTaskDueTimer // (Final|Native|Public) // @ game+0x1924ff0
	void BP_OnNodeEnds(bool succeeded); // Function Prospect.YBTTask_PlayAnimation.BP_OnNodeEnds // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YBTTask_RunBehaviorDynamic
// Size: 0x88 (Inherited: 0x88)
struct UYBTTask_RunBehaviorDynamic : UBTTask_RunBehaviorDynamic {
};

// Class Prospect.YBTTask_RunEQSQuery
// Size: 0x150 (Inherited: 0x150)
struct UYBTTask_RunEQSQuery : UBTTask_RunEQSQuery {
};

// Class Prospect.YBugReporter
// Size: 0xe0 (Inherited: 0x28)
struct UYBugReporter : UObject {
	char pad_28[0x48]; // 0x28(0x48)
	struct FString LogFilePath; // 0x70(0x10)
	struct FString ScreenshotFilePath; // 0x80(0x10)
	struct TArray<struct FString> CurrentBugReportFiles; // 0x90(0x10)
	struct FString JiraURL; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnJiraTicketCreatedEvent; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnInitializingBugReport; // 0xc0(0x10)
	struct FString AuthKey; // 0xd0(0x10)

	void YBugDataPrepared__DelegateSignature(); // DelegateFunction Prospect.YBugReporter.YBugDataPrepared__DelegateSignature // (Public|Delegate) // @ game+0x1e02480
	void SetBugDataPreparedDelegate(struct FDelegate Delegate); // Function Prospect.YBugReporter.SetBugDataPreparedDelegate // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1926920
	void OpenFileDialog(struct FString DialogTitle, struct FString DefaultPath, struct FString FileTypes, struct TArray<struct FString> OutFileNames); // Function Prospect.YBugReporter.OpenFileDialog // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1926410
	void OnScreenshotCreated(); // Function Prospect.YBugReporter.OnScreenshotCreated // (Final|Native|Public) // @ game+0x1926060
	struct FString GetSettingsTable(); // Function Prospect.YBugReporter.GetSettingsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925bc0
	struct FString GetScreenShotPath(); // Function Prospect.YBugReporter.GetScreenShotPath // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925b40
	struct FString GetLogPath(); // Function Prospect.YBugReporter.GetLogPath // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925aa0
	struct FString GetHardwareInfoTable(); // Function Prospect.YBugReporter.GetHardwareInfoTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925a00
	struct UWorld* GetCurrentWorld(struct AActor* WorldContextObject); // Function Prospect.YBugReporter.GetCurrentWorld // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925930
	struct FString GetCurrentPlayerViewLocationRotation(struct UWorld* World); // Function Prospect.YBugReporter.GetCurrentPlayerViewLocationRotation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925860
	struct FString GetCurrentPlayerName(); // Function Prospect.YBugReporter.GetCurrentPlayerName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19257e0
	struct FString GetCurrentPlayerID(); // Function Prospect.YBugReporter.GetCurrentPlayerID // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925760
	struct FString GetCurrentPlatform(struct UWorld* World); // Function Prospect.YBugReporter.GetCurrentPlatform // (Final|Native|Public|BlueprintCallable) // @ game+0x1925680
	struct FString GetCurrentMap(struct UWorld* World); // Function Prospect.YBugReporter.GetCurrentMap // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19255b0
	struct FString GetCurrentGamemode(struct UWorld* World); // Function Prospect.YBugReporter.GetCurrentGamemode // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19254e0
	struct FString GetCurrentEnvironment(struct UWorld* World); // Function Prospect.YBugReporter.GetCurrentEnvironment // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925410
	struct FString GetCurrentChangelist(); // Function Prospect.YBugReporter.GetCurrentChangelist // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925390
	struct FString GetCurrentBattleServer(struct UWorld* World); // Function Prospect.YBugReporter.GetCurrentBattleServer // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19252c0
	struct UYBugReporter* GetBugReporter(); // Function Prospect.YBugReporter.GetBugReporter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925290
	struct FString GetActualVersion(); // Function Prospect.YBugReporter.GetActualVersion // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19251d0
	struct FString FormatDescription(struct FString Behavior, struct FString ReproSteps); // Function Prospect.YBugReporter.FormatDescription // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925090
	void FlushAllPressedKeys(struct AYPlayerController* CurrentPlayerController); // Function Prospect.YBugReporter.FlushAllPressedKeys // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1925010
	bool CreateJiraBug(struct FString InUrl, struct FString InIssueTypeId, struct FString InProject, struct FString InSummary, struct FString InDescription, struct TArray<struct FString> InLabels, struct TMap<struct FString, struct FString> InAdditionalFields, struct TMap<struct FString, struct FString> InAdditionalPicker); // Function Prospect.YBugReporter.CreateJiraBug // (Final|Native|Public|BlueprintCallable) // @ game+0x1924800
	void CollectScreenshot(); // Function Prospect.YBugReporter.CollectScreenshot // (Final|Native|Private|BlueprintCallable) // @ game+0x19247e0
	void CollectLog(); // Function Prospect.YBugReporter.CollectLog // (Final|Native|Private|BlueprintCallable) // @ game+0x19247c0
	void BugReporterCollectLogAndScreenshot(struct AYPlayerController* Player); // Function Prospect.YBugReporter.BugReporterCollectLogAndScreenshot // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1924740
	bool AttachFile(struct FString InUrl, struct FString InJiraKey, struct FString InFilePath); // Function Prospect.YBugReporter.AttachFile // (Final|Native|Public|BlueprintCallable) // @ game+0x1924530
	void AddFile(struct FString FilePath); // Function Prospect.YBugReporter.AddFile // (Final|Native|Public|BlueprintCallable) // @ game+0x1924490
};

// Class Prospect.YBugReportingComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYBugReportingComponent : UActorComponent {

	void RequestToeTrapBugReportInput(); // Function Prospect.YBugReportingComponent.RequestToeTrapBugReportInput // (Final|Native|Public) // @ game+0xfa96f0
	void RequestBugReporter(); // Function Prospect.YBugReportingComponent.RequestBugReporter // (Final|Native|Public|BlueprintCallable) // @ game+0x1926660
	void BP_RequestBugReporter(); // Function Prospect.YBugReportingComponent.BP_RequestBugReporter // (Event|Public|BlueprintEvent) // @ game+0x1e02480
	void BP_OnBugReportToeTrapRequest(); // Function Prospect.YBugReportingComponent.BP_OnBugReportToeTrapRequest // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YBundleFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYBundleFunctions : UObject {

	bool IsPlatformEntitlement(struct UObject* objectContext, struct FString rowId); // Function Prospect.YBundleFunctions.IsPlatformEntitlement // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1925cf0
};

// Class Prospect.YButton
// Size: 0x4c8 (Inherited: 0x438)
struct UYButton : UButton {
	struct FMulticastInlineDelegate OnYClicked; // 0x438(0x10)
	struct USlateWidgetStyleAsset* m_buttonStyleAsset; // 0x448(0x08)
	struct USlateWidgetStyleAsset* m_buttonIsSelectedStyleAsset; // 0x450(0x08)
	struct FString m_biButtonName; // 0x458(0x10)
	struct FString m_biLocationName; // 0x468(0x10)
	struct USlateWidgetStyleAsset* m_currentlyUsedStyleAsset; // 0x478(0x08)
	char pad_480[0x48]; // 0x480(0x48)

	void SetSelectionState(bool IsSelected); // Function Prospect.YButton.SetSelectionState // (Final|Native|Protected|BlueprintCallable) // @ game+0x1926c30
	void SetButtonStyleAsset(struct USlateWidgetStyleAsset* Style); // Function Prospect.YButton.SetButtonStyleAsset // (Final|Native|Public|BlueprintCallable) // @ game+0x19269b0
	bool IsSelected(); // Function Prospect.YButton.IsSelected // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1925dd0
	void HandleUnhovered(); // Function Prospect.YButton.HandleUnhovered // (Native|Protected) // @ game+0x1925ca0
	void HandleReleased(); // Function Prospect.YButton.HandleReleased // (Final|Native|Protected) // @ game+0xfa96f0
	void HandlePressed(); // Function Prospect.YButton.HandlePressed // (Native|Protected) // @ game+0x1925c80
	void HandleHovered(); // Function Prospect.YButton.HandleHovered // (Native|Protected) // @ game+0x1925c60
	void HandleClicked(); // Function Prospect.YButton.HandleClicked // (Native|Protected) // @ game+0x1925c40
};

// Class Prospect.YCameraActor
// Size: 0x7c0 (Inherited: 0x7c0)
struct AYCameraActor : ACameraActor {
};

// Class Prospect.YCameraInteractionComponent
// Size: 0x100 (Inherited: 0xb0)
struct UYCameraInteractionComponent : UActorComponent {
	struct USceneComponent* m_cameraFocusComponent; // 0xb0(0x08)
	char pad_B8[0x8]; // 0xb8(0x08)
	struct FTransform m_baseTransform; // 0xc0(0x30)
	bool m_allowRotation; // 0xf0(0x01)
	char pad_F1[0xf]; // 0xf1(0x0f)

	bool SetCameraFocusComponent(struct USceneComponent* SceneComponent, bool cacheDefaultTransform); // Function Prospect.YCameraInteractionComponent.SetCameraFocusComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x1926a40
	bool ResetRotation(); // Function Prospect.YCameraInteractionComponent.ResetRotation // (Final|Native|Public|BlueprintCallable) // @ game+0x1926680
};

// Class Prospect.YCameraMenuExternalFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYCameraMenuExternalFunctions : UObject {

	void StartCameraTransitionTo(struct UObject* WorldContextObject); // Function Prospect.YCameraMenuExternalFunctions.StartCameraTransitionTo // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1926cc0
	bool SetCameraForWeaponNoVanity(struct AActor* ctxActor, struct FName weaponID, enum class EYCameraIntentionType intentionType); // Function Prospect.YCameraMenuExternalFunctions.SetCameraForWeaponNoVanity // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1926b10
	bool SetActiveCustomizationDataForItem(struct AActor* contextActor, struct FName vanityId, struct FString contextString, enum class EYVanityType vanityType, enum class EYCameraIntentionType intention, bool modifyItemBasedOnEquippedItem); // Function Prospect.YCameraMenuExternalFunctions.SetActiveCustomizationDataForItem // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x19266b0
};

// Class Prospect.YCapsuleComponent
// Size: 0x460 (Inherited: 0x460)
struct UYCapsuleComponent : UCapsuleComponent {
};

// Class Prospect.YCarryableComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYCarryableComponent : UActorComponent {

	struct FString BP_GetDebugDescription(); // Function Prospect.YCarryableComponent.BP_GetDebugDescription // (Event|Public|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YCharacterAbilityComponent
// Size: 0x180 (Inherited: 0xb0)
struct UYCharacterAbilityComponent : UActorComponent {
	struct FMulticastInlineDelegate OnCharacterAbilityConsumed; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnAbilityStateChanged; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnCooldownInputPressed; // 0xd0(0x10)
	struct FString m_abilityItemID; // 0xe0(0x10)
	struct FDataTableRowHandle m_abilityRowHandle; // 0xf0(0x10)
	char pad_100[0x8]; // 0x100(0x08)
	struct FDataTableRowHandle m_abilityActionRowHandle; // 0x108(0x10)
	char pad_118[0x8]; // 0x118(0x08)
	enum class EYAbilityState m_abilityState; // 0x120(0x01)
	char pad_121[0xf]; // 0x121(0x0f)
	struct UYPlayerCharacterStateComponent* m_characterStateComponent; // 0x130(0x08)
	struct AYPlacementActor* m_placementActor; // 0x138(0x08)
	char pad_140[0x40]; // 0x140(0x40)

	void ServerSetAbilityState(enum class EYAbilityState newAbilityState); // Function Prospect.YCharacterAbilityComponent.ServerSetAbilityState // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x192b580
	void ServerOnEnterState_Activating(); // Function Prospect.YCharacterAbilityComponent.ServerOnEnterState_Activating // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x192b530
	void OnStopWeaponSpinup(bool wasInterupted); // Function Prospect.YCharacterAbilityComponent.OnStopWeaponSpinup // (Final|Native|Protected) // @ game+0x192af90
	void OnStartWeaponSpinup(); // Function Prospect.YCharacterAbilityComponent.OnStartWeaponSpinup // (Final|Native|Protected) // @ game+0x192af70
	void OnRep_AbilityState(enum class EYAbilityState oldAbilityState); // Function Prospect.YCharacterAbilityComponent.OnRep_AbilityState // (Final|Native|Protected) // @ game+0x192ae50
	void OnRep_AbilityRowHandle(); // Function Prospect.YCharacterAbilityComponent.OnRep_AbilityRowHandle // (Final|Native|Protected) // @ game+0x192ae30
	void OnHideAttachedMesh(); // Function Prospect.YCharacterAbilityComponent.OnHideAttachedMesh // (Final|Native|Protected) // @ game+0x192acd0
	void OnDeactivateAbilityCallback(); // Function Prospect.YCharacterAbilityComponent.OnDeactivateAbilityCallback // (Final|Native|Protected) // @ game+0x192a9b0
	int32_t GetChargeAmount(); // Function Prospect.YCharacterAbilityComponent.GetChargeAmount // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1929f40
	void EnterState_Finished(); // Function Prospect.YCharacterAbilityComponent.EnterState_Finished // (Final|Native|Protected) // @ game+0x1929f20
	void DeactivateAbilityCharacterState(); // Function Prospect.YCharacterAbilityComponent.DeactivateAbilityCharacterState // (Final|Native|Protected) // @ game+0x1929e30
	void ActivateAbilityInput(); // Function Prospect.YCharacterAbilityComponent.ActivateAbilityInput // (Final|Native|Public|BlueprintCallable) // @ game+0x1929d70
};

// Class Prospect.YCharacterBagComponent
// Size: 0x108 (Inherited: 0xb0)
struct UYCharacterBagComponent : UActorComponent {
	struct FMulticastInlineDelegate OnBagMeshChangedEvent; // 0xb0(0x10)
	struct TArray<struct UMeshComponent*> m_bagMeshes; // 0xc0(0x10)
	char pad_D0[0x38]; // 0xd0(0x38)

	void OnBagMeshChangedSignature__DelegateSignature(); // DelegateFunction Prospect.YCharacterBagComponent.OnBagMeshChangedSignature__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
	void HandleOnPlayerSetUpdated(struct UYStateInventoryComponent* stateInventoryComponent); // Function Prospect.YCharacterBagComponent.HandleOnPlayerSetUpdated // (Final|Native|Private) // @ game+0x192a340
	void HandleOnMeshViewStateChanged(enum class EYMeshViewState newViewState); // Function Prospect.YCharacterBagComponent.HandleOnMeshViewStateChanged // (Final|Native|Private) // @ game+0x192a2c0
	void HandleOnMeshLoaded(); // Function Prospect.YCharacterBagComponent.HandleOnMeshLoaded // (Final|Native|Private) // @ game+0x192a2a0
	void HandleOnLootCreated(struct FYPickupItem pickupItem, struct AYPickupActor* pickUpActor); // Function Prospect.YCharacterBagComponent.HandleOnLootCreated // (Final|Native|Private|HasOutParms) // @ game+0x192a110
	void HandleOnDropItem(struct UYPlayerDropComponent* playerDropComponent, struct FYInventoryItem Item, enum class EYLootSourceType lootType); // Function Prospect.YCharacterBagComponent.HandleOnDropItem // (Final|Native|Private|HasOutParms) // @ game+0x1929f70
};

// Class Prospect.YCharacterBannerComponent
// Size: 0x128 (Inherited: 0xb0)
struct UYCharacterBannerComponent : UActorComponent {
	struct FMulticastInlineDelegate BP_OnBannerSpawned; // 0xb0(0x10)
	enum class EYVanityType m_selectedVanityType; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
	struct FYGlobalVanityItem m_SelectedVanityItem; // 0xc8(0x18)
	char pad_E0[0x20]; // 0xe0(0x20)
	struct AYBannerActor* m_localBannerAttachActor; // 0x100(0x08)
	struct AYBannerActor* m_spawnedBannerAuthority; // 0x108(0x08)
	struct TArray<struct AYSprayActor*> m_spawnedSpraysAuthority; // 0x110(0x10)
	int32_t m_spawnedSprayCounter; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)

	void StartBannerInput(); // Function Prospect.YCharacterBannerComponent.StartBannerInput // (Final|Native|Public) // @ game+0x192b940
	void SetBannerLocalAttachState(bool Visible); // Function Prospect.YCharacterBannerComponent.SetBannerLocalAttachState // (Final|Native|Protected) // @ game+0x192b830
	void ServerSpawnSpray(struct FYGlobalVanityItem vanityItem); // Function Prospect.YCharacterBannerComponent.ServerSpawnSpray // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x192b730
	void ServerSpawnBanner(struct FYGlobalVanityItem vanityItem); // Function Prospect.YCharacterBannerComponent.ServerSpawnBanner // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x192b630
	void ReleaseBannerInput(); // Function Prospect.YCharacterBannerComponent.ReleaseBannerInput // (Final|Native|Public) // @ game+0x192b450
	void OnTransitionFirstPerson(); // Function Prospect.YCharacterBannerComponent.OnTransitionFirstPerson // (Final|Native|Protected) // @ game+0x192b020
	void OnClearBannerState(); // Function Prospect.YCharacterBannerComponent.OnClearBannerState // (Final|Native|Protected) // @ game+0x192a7e0
	void OnBannerStateClear(bool wasInterrupted); // Function Prospect.YCharacterBannerComponent.OnBannerStateClear // (Final|Native|Protected) // @ game+0x192a6b0
	void OnAuthorithySpawnBannerActor(struct FYGlobalVanityItem vanityItem); // Function Prospect.YCharacterBannerComponent.OnAuthorithySpawnBannerActor // (Final|Native|Protected) // @ game+0x192a5e0
	void OnActivatedBannerState(); // Function Prospect.YCharacterBannerComponent.OnActivatedBannerState // (Final|Native|Protected) // @ game+0x192a540
	void EnterBannerStateAndCreateBanner(struct FYGlobalVanityItem vanityItem); // Function Prospect.YCharacterBannerComponent.EnterBannerStateAndCreateBanner // (Final|Native|Public) // @ game+0x1929e70
};

// Class Prospect.YCharacterCameraTransitionComponent
// Size: 0xe8 (Inherited: 0xb0)
struct UYCharacterCameraTransitionComponent : UActorComponent {
	char pad_B0[0x38]; // 0xb0(0x38)

	bool StartCameraTransition(struct AActor* Owner, struct FYCameraTransitionData transitionData); // Function Prospect.YCharacterCameraTransitionComponent.StartCameraTransition // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x192b960
	void OnAnyStateChanged(enum class EYStateChangeType stateChange); // Function Prospect.YCharacterCameraTransitionComponent.OnAnyStateChanged // (Final|Native|Protected) // @ game+0x192a560
	bool IsTransitionActive(struct AActor* Owner); // Function Prospect.YCharacterCameraTransitionComponent.IsTransitionActive // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x192a4b0
};

// Class Prospect.YCharacterCloakComponent
// Size: 0x108 (Inherited: 0xb0)
struct UYCharacterCloakComponent : UActorComponent {
	struct UMaterialInstanceDynamic* m_cloakMaterialMID; // 0xb0(0x08)
	struct FYCloakRuntimeData m_runtimeData; // 0xb8(0x18)
	char pad_D0[0x8]; // 0xd0(0x08)
	struct TArray<struct FYCloakMaterialsInfo> m_nonCloakedMaterialInfos; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnCloakMIDStateChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnCloakStateChanged; // 0xf8(0x10)

	void OnRep_IsCloaked(struct FYCloakRuntimeData oldData); // Function Prospect.YCharacterCloakComponent.OnRep_IsCloaked // (Final|Native|Protected) // @ game+0x192aed0
	void OnChangedActiveWeapon(); // Function Prospect.YCharacterCloakComponent.OnChangedActiveWeapon // (Final|Native|Protected) // @ game+0x192a7c0
	void OnBagMeshChangedCallback(); // Function Prospect.YCharacterCloakComponent.OnBagMeshChangedCallback // (Final|Native|Protected) // @ game+0x192a690
	bool IsCloaked(); // Function Prospect.YCharacterCloakComponent.IsCloaked // (Final|Native|Public|BlueprintCallable) // @ game+0x192a480
	void DeactivateCloak(); // Function Prospect.YCharacterCloakComponent.DeactivateCloak // (Final|Native|Public|BlueprintCallable) // @ game+0x1929e50
	void ActivateCloak(struct FDataTableRowHandle desiredData); // Function Prospect.YCharacterCloakComponent.ActivateCloak // (Final|Native|Public|BlueprintCallable) // @ game+0x1929d90
};

// Class Prospect.YCharacterCosmeticVisualizationComponent
// Size: 0xe8 (Inherited: 0xb0)
struct UYCharacterCosmeticVisualizationComponent : UActorComponent {
	struct UYSkeletalMeshComponentFOV* m_cosmeticSecondaryWeaponMesh; // 0xb0(0x08)
	struct UYSkeletalMeshComponentFOV* m_cosmeticMeleeMesh; // 0xb8(0x08)
	struct FDataTableRowHandle m_equippedSecondaryWeapon; // 0xc0(0x10)
	char pad_D0[0x8]; // 0xd0(0x08)
	struct FMulticastInlineDelegate OnCosmeticStateChangedDelegate; // 0xd8(0x10)

	void ServerEquipNewCosmeticSlot(int32_t weaponIndex); // Function Prospect.YCharacterCosmeticVisualizationComponent.ServerEquipNewCosmeticSlot // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x192b470
	void RefreshCosmeticVisualization(); // Function Prospect.YCharacterCosmeticVisualizationComponent.RefreshCosmeticVisualization // (Final|Native|Protected) // @ game+0x192b430
	void OnVanityUpdatedCallback(struct TArray<struct FYVanityBackendItemInfo> newData); // Function Prospect.YCharacterCosmeticVisualizationComponent.OnVanityUpdatedCallback // (Final|Native|Public|HasOutParms) // @ game+0x192b040
	void OnGearSetItemsAvaiable(struct TArray<struct FYInventoryItem> gearSetItems); // Function Prospect.YCharacterCosmeticVisualizationComponent.OnGearSetItemsAvaiable // (Final|Native|Protected|HasOutParms) // @ game+0x192ab90
	void OnFinishedLoadingMeleeMesh(int32_t loadHandle); // Function Prospect.YCharacterCosmeticVisualizationComponent.OnFinishedLoadingMeleeMesh // (Final|Native|Protected|Const) // @ game+0x192ab00
	void OnFinishedAsyncloadingCosmeticMesh(int32_t Handle); // Function Prospect.YCharacterCosmeticVisualizationComponent.OnFinishedAsyncloadingCosmeticMesh // (Final|Native|Protected|Const) // @ game+0x192aa70
	void OnCosmeticStateChanged(struct FYPlayerCosmeticReplicatedData oldData, struct FYPlayerCosmeticReplicatedData newData); // Function Prospect.YCharacterCosmeticVisualizationComponent.OnCosmeticStateChanged // (Final|Native|Protected|HasOutParms) // @ game+0x192a800
	bool IsCharacterComseticStateActive(struct AActor* relevantContext); // Function Prospect.YCharacterCosmeticVisualizationComponent.IsCharacterComseticStateActive // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x192a3f0
};

// Class Prospect.YCharacterCustomizationArchetypeFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYCharacterCustomizationArchetypeFunctions : UObject {

	void UpdateOwnedArchetypes(struct UObject* objCtx, struct FDelegate Delegate); // Function Prospect.YCharacterCustomizationArchetypeFunctions.UpdateOwnedArchetypes // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19304e0
	enum class EYCustomizationBodyType FindBodyTypeGivenArchetypeID(struct UObject* objCtx, struct FName archetypeId); // Function Prospect.YCharacterCustomizationArchetypeFunctions.FindBodyTypeGivenArchetypeID // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x192ef50
};

// Class Prospect.YCharacterCustomizationCheatFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYCharacterCustomizationCheatFunctions : UObject {

	void YDebugResetActiveCharacter(struct AActor* actorContext); // Function Prospect.YCharacterCustomizationCheatFunctions.YDebugResetActiveCharacter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19308a0
	void YDebugRandomizeActiveCharacter(struct AActor* actorContext); // Function Prospect.YCharacterCustomizationCheatFunctions.YDebugRandomizeActiveCharacter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1930820
	void YDebugChangeArchetype(struct AActor* actorContext, struct FDataTableRowHandle archetypeRowHandle); // Function Prospect.YCharacterCustomizationCheatFunctions.YDebugChangeArchetype // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1930750
	void YDebugChangeActiveCharacterCustomizationBodyPart(struct AActor* actorContext, struct FDataTableRowHandle desiredRowHandle, int32_t MaterialIndex, bool isTemporary, bool ignoreBackend); // Function Prospect.YCharacterCustomizationCheatFunctions.YDebugChangeActiveCharacterCustomizationBodyPart // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19305b0
};

// Class Prospect.YCharacterCustomizationComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UYCharacterCustomizationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnMeshInitializedDelegate; // 0xb0(0x10)
	char pad_C0[0x8]; // 0xc0(0x08)
	struct TArray<struct USkeletalMeshComponent*> m_meshComponents; // 0xc8(0x10)

	void YOnMeshInitialized__DelegateSignature(); // DelegateFunction Prospect.YCharacterCustomizationComponent.YOnMeshInitialized__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
	void OnFinishedLoadedAssets(); // Function Prospect.YCharacterCustomizationComponent.OnFinishedLoadedAssets // (Final|Native|Protected) // @ game+0x192fd70
	void OnCustomizationDataAvailable(struct FYActiveCustomizationData requestedBodyType); // Function Prospect.YCharacterCustomizationComponent.OnCustomizationDataAvailable // (Final|Native|Protected) // @ game+0x192faf0
	bool IsMeshInitialized(); // Function Prospect.YCharacterCustomizationComponent.IsMeshInitialized // (Final|Native|Public|BlueprintCallable) // @ game+0x192fa40
};

// Class Prospect.YCharacterCustomizationManager
// Size: 0x78 (Inherited: 0x28)
struct UYCharacterCustomizationManager : UObject {
	struct TMap<struct FString, struct UYCharacterCustomizationModel*> m_models; // 0x28(0x50)
};

// Class Prospect.YCharacterCustomizationModel
// Size: 0x220 (Inherited: 0x28)
struct UYCharacterCustomizationModel : UObject {
	struct FMulticastInlineDelegate OnCharacterUpdated; // 0x28(0x10)
	struct FYCharacterVanity m_characterVanity; // 0x38(0xc0)
	struct FYCharacterVanity m_pendingCharacterVanity; // 0xf8(0xc0)
	struct TMap<struct FName, struct FYCharacterVanity> m_persistentArchetypeToVanity; // 0x1b8(0x50)
	struct TArray<struct FName> m_ownedArchetypes; // 0x208(0x10)
	char pad_218[0x8]; // 0x218(0x08)

	bool IsPendingAndPersistentEqual(); // Function Prospect.YCharacterCustomizationModel.IsPendingAndPersistentEqual // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x192fa60
};

// Class Prospect.YCharacterCustomizationPlayerActor
// Size: 0x5a0 (Inherited: 0x5a0)
struct AYCharacterCustomizationPlayerActor : AYCharacterCustomizationActor {

	void OnShowCustomizationCategory(struct FYShowBodyTypeCategoryUpdateData customizationCategory); // Function Prospect.YCharacterCustomizationPlayerActor.OnShowCustomizationCategory // (Final|Native|Public) // @ game+0x19301e0
	void OnResetRequest(enum class EYCharacterVanityResetRequest Request); // Function Prospect.YCharacterCustomizationPlayerActor.OnResetRequest // (Final|Native|Public) // @ game+0x1930160
};

// Class Prospect.YCharacterCustomizationPreviewActor
// Size: 0x5b0 (Inherited: 0x5a0)
struct AYCharacterCustomizationPreviewActor : AYCharacterCustomizationActor {
	struct AActor* m_relevantCameraActor; // 0x5a0(0x08)
	struct UYCharacterCustomizationModel* m_model; // 0x5a8(0x08)

	void OnTypeSet(enum class EYCustomizationModelType Type); // Function Prospect.YCharacterCustomizationPreviewActor.OnTypeSet // (Final|Native|Protected) // @ game+0x1930280
};

// Class Prospect.YCharacterCustomizationRuntimeFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYCharacterCustomizationRuntimeFunctions : UObject {

	bool FindEquippedPartForCategory(enum class EYCustomizationCategory categoryType, struct AActor* actorContext, struct FYCharacterCustomizationBodyPart outData); // Function Prospect.YCharacterCustomizationRuntimeFunctions.FindEquippedPartForCategory // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x192f7c0
	struct FText FindCustomizationCategoryNameFromID(struct UObject* objectContext, struct FDataTableRowHandle rowHandle); // Function Prospect.YCharacterCustomizationRuntimeFunctions.FindCustomizationCategoryNameFromID // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x192f4b0
	enum class EYCustomizationBodyType FindBodyType(struct AActor* actorContext); // Function Prospect.YCharacterCustomizationRuntimeFunctions.FindBodyType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x192eec0
	struct FYActiveCustomizationData FindActiveCustomizationData(struct AActor* actorContext); // Function Prospect.YCharacterCustomizationRuntimeFunctions.FindActiveCustomizationData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x192e8a0
	struct FName FindActiveArchetypeId(struct AActor* actorContext); // Function Prospect.YCharacterCustomizationRuntimeFunctions.FindActiveArchetypeId // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x192e810
	struct UAnimMontage* FindActiveAnimationForCategory(enum class EYCustomizationCategory Category, struct AActor* activeActor); // Function Prospect.YCharacterCustomizationRuntimeFunctions.FindActiveAnimationForCategory // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x192e740
};

// Class Prospect.YCharacterCustomizationStaticFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYCharacterCustomizationStaticFunctions : UObject {

	bool FindDefaultCharacterCustomizationData(struct UObject* objCtx, struct FYCharacterCustomizationDefaultDataRow outData); // Function Prospect.YCharacterCustomizationStaticFunctions.FindDefaultCharacterCustomizationData // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x192f6d0
	struct TSoftObjectPtr<struct UTexture2D> FindCustomizationImageFromBodyPart(struct FYCharacterCustomizationBodyPart part); // Function Prospect.YCharacterCustomizationStaticFunctions.FindCustomizationImageFromBodyPart // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x192f5f0
	bool FindCompatibleItemsForCategory(struct UObject* objCtx, struct TArray<enum class EYCustomizationCategory> Categories, struct FName archetypeId, struct TArray<struct FDataTableRowHandle> outRowHandles, enum class EYCustomizationBodyType bodyType); // Function Prospect.YCharacterCustomizationStaticFunctions.FindCompatibleItemsForCategory // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x192f2e0
	bool FindCompatibleItemsForArchetypeCategory(struct UObject* objCtx, struct TArray<enum class EYCustomizationCategory> Categories, struct FName archetypeId, struct TArray<struct FDataTableRowHandle> outRowHandles); // Function Prospect.YCharacterCustomizationStaticFunctions.FindCompatibleItemsForArchetypeCategory // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x192f150
	struct FText FindCategoryCustomizationNameFromCategory(struct UObject* objectContext, enum class EYCustomizationCategory Category); // Function Prospect.YCharacterCustomizationStaticFunctions.FindCategoryCustomizationNameFromCategory // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x192f020
	bool FindBodyPartFromCategory(struct UObject* objCtx, enum class EYCustomizationCategory customizationCategory, struct TArray<struct FYCharacterCustomizationBodyPart> Data, struct FYCharacterCustomizationBodyPart outHandle); // Function Prospect.YCharacterCustomizationStaticFunctions.FindBodyPartFromCategory // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x192ed30
	bool FindArchetypeRefRowGivenId(struct UObject* objCtx, struct FName archetypeId, struct FYCharacterCustomizationArchetypeRow outRow); // Function Prospect.YCharacterCustomizationStaticFunctions.FindArchetypeRefRowGivenId // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x192e980
	bool CalculateRandomCustomizationData(struct UObject* objCtx, struct FYActiveCustomizationData outData); // Function Prospect.YCharacterCustomizationStaticFunctions.CalculateRandomCustomizationData // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x192e540
};

// Class Prospect.YResourceComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UYResourceComponent : UActorComponent {
	struct FMulticastInlineDelegate BP_OnResourceRegeneratingChanged; // 0xb0(0x10)
	struct FMulticastInlineDelegate BP_OnResourceDataChanged; // 0xc0(0x10)

	float GetResourceValueRatio(); // Function Prospect.YResourceComponent.GetResourceValueRatio // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a0e140
	float GetResourceRegenerationProgressRatio(); // Function Prospect.YResourceComponent.GetResourceRegenerationProgressRatio // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a0e100
	int32_t GetResourceNumSegments(); // Function Prospect.YResourceComponent.GetResourceNumSegments // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a0e0d0
	float GetResourceMaxValueRatio(); // Function Prospect.YResourceComponent.GetResourceMaxValueRatio // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a0e090
	float GetResourceMaxValue(); // Function Prospect.YResourceComponent.GetResourceMaxValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a0e050
	float GetResourceAbsoluteValueRatio(); // Function Prospect.YResourceComponent.GetResourceAbsoluteValueRatio // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a0e010
	float GetResourceAbsoluteMaxValue(); // Function Prospect.YResourceComponent.GetResourceAbsoluteMaxValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a0dfd0
	int32_t GetGlobalResourceNumSegments(); // Function Prospect.YResourceComponent.GetGlobalResourceNumSegments // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a0dfa0
	float GetGlobalResourceMaxValue(); // Function Prospect.YResourceComponent.GetGlobalResourceMaxValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1a0df60
};

// Class Prospect.YCharacterDBNOComponent
// Size: 0x1d8 (Inherited: 0xd0)
struct UYCharacterDBNOComponent : UYResourceComponent {
	struct FMulticastInlineDelegate OnTeleportStateChanged; // 0xd0(0x10)
	struct AYGameState_Match* m_gameStateMatch; // 0xe0(0x08)
	struct FMulticastInlineDelegate OnRevived; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnPreExecuted; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnExecuted; // 0x108(0x10)
	struct FMulticastInlineDelegate OnTeleported; // 0x118(0x10)
	struct FMulticastInlineDelegate OnEnterDBNOEvent; // 0x128(0x10)
	struct FMulticastInlineDelegate OnLeaveDBNOEvent; // 0x138(0x10)
	struct FMulticastInlineDelegate OnPreTeleportedDBNO; // 0x148(0x10)
	struct FMulticastInlineDelegate OnTeleportedDBNO; // 0x158(0x10)
	struct FMulticastInlineDelegate CurrentDBNOShieldHealthChangedDelegate; // 0x168(0x10)
	struct FMulticastInlineDelegate BP_OnTeleportChargsAmountChanged; // 0x178(0x10)
	struct FMulticastInlineDelegate OnRecoveredDBNO; // 0x188(0x10)
	char pad_198[0x4]; // 0x198(0x04)
	float m_timestampEnteredDBNO; // 0x19c(0x04)
	int32_t m_dbnoTeleportChargesLeft; // 0x1a0(0x04)
	float m_dbnoShieldHealth; // 0x1a4(0x04)
	float m_currentDBNOTotalDuration; // 0x1a8(0x04)
	char pad_1AC[0x2c]; // 0x1ac(0x2c)

	void TryFadeFromBlackAfterDBNOTeleport(); // Function Prospect.YCharacterDBNOComponent.TryFadeFromBlackAfterDBNOTeleport // (Final|Native|Public) // @ game+0x19304a0
	void TeleportStopInput(); // Function Prospect.YCharacterDBNOComponent.TeleportStopInput // (Final|Native|Public) // @ game+0x1930480
	void TeleportStartInput(); // Function Prospect.YCharacterDBNOComponent.TeleportStartInput // (Final|Native|Public) // @ game+0x1930460
	void SetDBNOTeleportCharges(int32_t chargesAmount); // Function Prospect.YCharacterDBNOComponent.SetDBNOTeleportCharges // (Final|Native|Public|BlueprintCallable) // @ game+0x19303d0
	void SetCurrentDBNOShieldHealth(float shieldHealthValue); // Function Prospect.YCharacterDBNOComponent.SetCurrentDBNOShieldHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1930350
	void ServerTeleportToStartLocation(); // Function Prospect.YCharacterDBNOComponent.ServerTeleportToStartLocation // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1930300
	void OnTeleportActiveDBNO(); // Function Prospect.YCharacterDBNOComponent.OnTeleportActiveDBNO // (Final|Native|Public|BlueprintCallable) // @ game+0x1930260
	void OnRep_TeleportChargesLeftChanged(); // Function Prospect.YCharacterDBNOComponent.OnRep_TeleportChargesLeftChanged // (Final|Native|Protected) // @ game+0x1930140
	void OnRep_DBNOShieldHealth(); // Function Prospect.YCharacterDBNOComponent.OnRep_DBNOShieldHealth // (Final|Native|Protected) // @ game+0x1930100
	void OnOwnerTakeDamage(struct FYDealtDamageData Data); // Function Prospect.YCharacterDBNOComponent.OnOwnerTakeDamage // (Final|Native|Protected|HasOutParms) // @ game+0x1930010
	void OnLeaveDBNO(bool wasInterupted); // Function Prospect.YCharacterDBNOComponent.OnLeaveDBNO // (Final|Native|Protected) // @ game+0x192ff80
	void OnInteractionStarted_Revive(enum class EYInteractionType interactionType, struct AYPlayerController_Match* interactingPlayer); // Function Prospect.YCharacterDBNOComponent.OnInteractionStarted_Revive // (Final|Native|Public) // @ game+0x192feb0
	void OnInteractionComplete_Revive(enum class EYInteractionType interactionType, struct AYPlayerController_Match* interactingPlayer, bool perfectInteraction); // Function Prospect.YCharacterDBNOComponent.OnInteractionComplete_Revive // (Final|Native|Public) // @ game+0x192fd90
	void OnEnterRevive(); // Function Prospect.YCharacterDBNOComponent.OnEnterRevive // (Final|Native|Protected) // @ game+0x192fd50
	void OnEnterDBNO(); // Function Prospect.YCharacterDBNOComponent.OnEnterDBNO // (Final|Native|Protected) // @ game+0x192fd30
	void OnDBNOTimerCompleted(); // Function Prospect.YCharacterDBNOComponent.OnDBNOTimerCompleted // (Final|Native|Protected) // @ game+0x192fc20
	void MulticastOnTeleported(); // Function Prospect.YCharacterDBNOComponent.MulticastOnTeleported // (Net|Native|Event|NetMulticast|Protected) // @ game+0x192fab0
	void MulticastOnExecuted(); // Function Prospect.YCharacterDBNOComponent.MulticastOnExecuted // (Net|Native|Event|NetMulticast|Protected) // @ game+0x192fa90
	bool IsActorInDBNO(struct AActor* actorContext); // Function Prospect.YCharacterDBNOComponent.IsActorInDBNO // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x192f9b0
	bool HasDBNOTeleportCharges(); // Function Prospect.YCharacterDBNOComponent.HasDBNOTeleportCharges // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x192f980
	float GetDBNOShieldMaxHealth(); // Function Prospect.YCharacterDBNOComponent.GetDBNOShieldMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x192f950
	float GetDBNOShieldHealthRation(); // Function Prospect.YCharacterDBNOComponent.GetDBNOShieldHealthRation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x192f920
	float GetDBNOShieldCurrentHealth(); // Function Prospect.YCharacterDBNOComponent.GetDBNOShieldCurrentHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x192f900
	void Execute(struct AYPlayerController* interactingPlayer, bool perfectInteraction); // Function Prospect.YCharacterDBNOComponent.Execute // (Final|Native|Public) // @ game+0x192e670
};

// Class Prospect.YCharacterDeathComponent
// Size: 0x288 (Inherited: 0xb0)
struct UYCharacterDeathComponent : UActorComponent {
	bool m_isExplodingOnDeath; // 0xb0(0x01)
	char pad_B1[0x17]; // 0xb1(0x17)
	struct FYDeathAnimMontageInfo m_deathInfo; // 0xc8(0x138)
	float m_minRagdollDuration; // 0x200(0x04)
	float m_maxRagdollDuration; // 0x204(0x04)
	float m_minDotRagdollCleanUp; // 0x208(0x04)
	float m_minDistanceRagdollCleanUp; // 0x20c(0x04)
	float m_freezeRagdollDelay; // 0x210(0x04)
	float m_intervalRetryRagdollCleanUp; // 0x214(0x04)
	float m_destroyOwnerDelay; // 0x218(0x04)
	struct FGameplayTag m_gameplayTagKeepCollisionPostDeath; // 0x21c(0x08)
	char pad_224[0x4]; // 0x224(0x04)
	struct FMulticastInlineDelegate BP_OnDeathPreUnpossess; // 0x228(0x10)
	struct FMulticastInlineDelegate BP_OnDeath; // 0x238(0x10)
	struct FMulticastInlineDelegate BP_OnBlendToRagdollOnDeathWithoutDeathAnim; // 0x248(0x10)
	struct FMulticastInlineDelegate BP_OnBlendToRagdoll; // 0x258(0x10)
	char pad_268[0x20]; // 0x268(0x20)

	void TryRagdollCleanUp(); // Function Prospect.YCharacterDeathComponent.TryRagdollCleanUp // (Final|Native|Protected) // @ game+0x19304c0
	void OnRep_Death(); // Function Prospect.YCharacterDeathComponent.OnRep_Death // (Final|Native|Protected) // @ game+0x1930120
	void OnDestroySafetyTimerExpired(); // Function Prospect.YCharacterDeathComponent.OnDestroySafetyTimerExpired // (Final|Native|Protected) // @ game+0x192fd10
	void OnDeath_Authority(struct UYHealthComponent* healthComponent, struct AActor* Instigator); // Function Prospect.YCharacterDeathComponent.OnDeath_Authority // (Native|Protected) // @ game+0x192fc40
	void FreezeRagdoll(); // Function Prospect.YCharacterDeathComponent.FreezeRagdoll // (Final|Native|Protected) // @ game+0x192f8e0
	void DestroyOwner(); // Function Prospect.YCharacterDeathComponent.DestroyOwner // (Final|Native|Protected) // @ game+0x192e650
	void BlendToRagdollAndTriggerDestroy(); // Function Prospect.YCharacterDeathComponent.BlendToRagdollAndTriggerDestroy // (Final|Native|Public|BlueprintCallable) // @ game+0x192e520
};

// Class Prospect.YCharacterEmoteComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UYCharacterEmoteComponent : UActorComponent {
	struct FMulticastInlineDelegate BP_OnEmoted; // 0xb0(0x10)
	struct FYSelectedEmote m_selectedEmote; // 0xc0(0x08)
	char pad_C8[0x18]; // 0xc8(0x18)

	void TryEmoteStateAndPlayEmoteAnimation(); // Function Prospect.YCharacterEmoteComponent.TryEmoteStateAndPlayEmoteAnimation // (Final|Native|Public) // @ game+0x19364e0
	void StartEmoteInput(); // Function Prospect.YCharacterEmoteComponent.StartEmoteInput // (Final|Native|Public) // @ game+0x19364c0
	void ServerSetSelectedEmote(int32_t SlotIndex); // Function Prospect.YCharacterEmoteComponent.ServerSetSelectedEmote // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1936400
	void SelectedNewEmote(int32_t itemSlotID); // Function Prospect.YCharacterEmoteComponent.SelectedNewEmote // (Final|Native|Public) // @ game+0x1936370
	void ReleaseEmoteInput(); // Function Prospect.YCharacterEmoteComponent.ReleaseEmoteInput // (Final|Native|Public) // @ game+0x1936190
	void OnTransitionFirstPersonState(); // Function Prospect.YCharacterEmoteComponent.OnTransitionFirstPersonState // (Final|Native|Protected) // @ game+0x1936170
	void OnRep_SelectedEmoteChanged(); // Function Prospect.YCharacterEmoteComponent.OnRep_SelectedEmoteChanged // (Final|Native|Protected) // @ game+0x19360a0
	void OnRemoveEmoteState(); // Function Prospect.YCharacterEmoteComponent.OnRemoveEmoteState // (Final|Native|Protected) // @ game+0x1936080
	void OnMovementInputProcessed(); // Function Prospect.YCharacterEmoteComponent.OnMovementInputProcessed // (Final|Native|Protected) // @ game+0x1936060
	void OnEmoteStateDeactivated(bool wasInterrupted); // Function Prospect.YCharacterEmoteComponent.OnEmoteStateDeactivated // (Final|Native|Protected) // @ game+0x1935f10
	void OnCommWheelUsed(struct UYCommWheelVOComponent* commWheelComponent, struct FDataTableRowHandle commWheelEntry); // Function Prospect.YCharacterEmoteComponent.OnCommWheelUsed // (Final|Native|Protected) // @ game+0x1935e30
	void OnActivatedEmoteState(); // Function Prospect.YCharacterEmoteComponent.OnActivatedEmoteState // (Final|Native|Protected) // @ game+0x1935d80
};

// Class Prospect.YCharacterLandingComponent
// Size: 0xe8 (Inherited: 0xb0)
struct UYCharacterLandingComponent : UActorComponent {
	float m_moveSpeedModifier; // 0xb0(0x04)
	char pad_B4[0x14]; // 0xb4(0x14)
	struct UCurveVector* m_currentActviveMoveAndLookSpeedCurve; // 0xc8(0x08)
	float m_timestampCurveSet; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct FMulticastInlineDelegate BP_OnLanding; // 0xd8(0x10)

	void OnEvaluateLanding(struct FYFallingDamageInfo Info); // Function Prospect.YCharacterLandingComponent.OnEvaluateLanding // (Final|Native|Private|HasOutParms) // @ game+0x1935fa0
	void OnCancelledHardLanding(bool interrupt); // Function Prospect.YCharacterLandingComponent.OnCancelledHardLanding // (Final|Native|Private) // @ game+0x1935da0
	void FinishHardLanding(); // Function Prospect.YCharacterLandingComponent.FinishHardLanding // (Final|Native|Private) // @ game+0x19356e0
};

// Class Prospect.YCharacterLocationComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UYCharacterLocationComponent : UActorComponent {
	char pad_B0[0x10]; // 0xb0(0x10)

	void RemoveTag(struct FName RemoveTag); // Function Prospect.YCharacterLocationComponent.RemoveTag // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x19361b0
	bool HasTags(struct TArray<struct FName> Tags); // Function Prospect.YCharacterLocationComponent.HasTags // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1935860
	bool HasTag(struct FName Tag); // Function Prospect.YCharacterLocationComponent.HasTag // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x19357c0
	bool HasAtleastOneTag(struct TArray<struct FName> Tags); // Function Prospect.YCharacterLocationComponent.HasAtleastOneTag // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1935700
	void AddTag(struct FName newTag); // Function Prospect.YCharacterLocationComponent.AddTag // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x19353f0
};

// Class Prospect.YCharacterModelFunctions
// Size: 0x28 (Inherited: 0x28)
struct UYCharacterModelFunctions : UObject {

	bool ResetCharacterCustomizationCategoryToPersistent(struct UObject* objCtx, struct FString UserId, enum class EYCustomizationCategory Category); // Function Prospect.YCharacterModelFunctions.ResetCharacterCustomizationCategoryToPersistent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1936240
	bool IsPersistentAndPendingStorageEqualForLocal(struct UObject* objCtx); // Function Prospect.YCharacterModelFunctions.IsPersistentAndPendingStorageEqualForLocal // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1935bf0
	bool IsPersistentAndPendingStorageEqual(struct UObject* objCtx, struct FString UserId); // Function Prospect.YCharacterModelFunctions.IsPersistentAndPendingStorageEqual // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1935b10
	bool IsPendingStorageOwned(struct UObject* objCtx); // Function Prospect.YCharacterModelFunctions.IsPendingStorageOwned // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1935a80
	bool IsCharacterModelItemEquipped(struct UObject* objCtx, struct FString UserId, struct FName ID, enum class EYCustomizationModelType modelType); // Function Prospect.YCharacterModelFunctions.IsCharacterModelItemEquipped // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1935920
	struct FName FindModelSelectedArchetype(struct UObject* objCtx, enum class EYCustomizationModelType modelType); // Function Prospect.YCharacterModelFunctions.FindModelSelectedArchetype // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1935610
	struct UYCharacterCustomizationModel* FindLocalCharacterCustomizationModel(struct UObject* objCtx); // Function Prospect.YCharacterModelFunctions.FindLocalCharacterCustomizationModel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1935580
};

// Class Prospect.YCharacterRevivingComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UYCharacterRevivingComponent : UActorComponent {
	struct TArray<struct FGuid> m_appliedAttributeModifiers; // 0xb0(0x10)
	char pad_C0[0x10]; // 0xc0(0x10)

	void OnReviveDeactivated(bool wasInterupted); // Function Prospect.YCharacterRevivingComponent.OnReviveDeactivated // (Final|Native|Private) // @ game+0x19360e0
	void OnReviveActivated(); // Function Prospect.YCharacterRevivingComponent.OnReviveActivated // (Final|Native|Private) // @ game+0x19360c0
	void LeaveReviveState(); // Function Prospect.YCharacterRevivingComponent.LeaveReviveState // (Final|Native|Private) // @ game+0x1935c80
	void EndBlockMovement(); // Function Prospect.YCharacterRevivingComponent.EndBlockMovement // (Final|Native|Private) // @ game+0x1935480
};

// Class Prospect.YCharacterStatusEffectAreaComponent
// Size: 0x100 (Inherited: 0xb0)
struct UYCharacterStatusEffectAreaComponent : UActorComponent {
	char pad_B0[0x50]; // 0xb0(0x50)

	void LeftStatusEffectArea(struct FDataTableRowHandle statusEffectRowHandle, struct AActor* Actor); // Function Prospect.YCharacterStatusEffectAreaComponent.LeftStatusEffectArea // (Final|Native|Public|BlueprintCallable) // @ game+0x1935ca0
	void EnteredStatusEffectArea(struct FDataTableRowHandle statusEffectRowHandle, struct AActor* Actor); // Function Prospect.YCharacterStatusEffectAreaComponent.EnteredStatusEffectArea // (Final|Native|Public|BlueprintCallable) // @ game+0x19354a0
};

// Class Prospect.YCharacterVanityDataComponent
// Size: 0x1a0 (Inherited: 0xb0)
struct UYCharacterVanityDataComponent : UActorComponent {
	struct FYActiveGlobalRuntimeVanityData m_activeData; // 0xb0(0x80)
	struct FDataTableRowHandle m_socialRow; // 0x130(0x10)
	struct FMulticastInlineDelegate OnGlobalVanityUpdatedDelegate; // 0x140(0x10)
	struct FMulticastInlineDelegate OnAsyncloadingStateChanged; // 0x150(0x10)
	struct FMulticastInlineDelegate OnGlobalVanityEntryUpdatedDelegate; // 0x160(0x10)
	struct FMulticastInlineDelegate OnSocialRowChanged; // 0x170(0x10)
	char pad_180[0x8]; // 0x180(0x08)
	struct TArray<struct UObject*> m_hardReferenedAsyncloadData; // 0x188(0x10)
	bool m_shouldAsyncloadData; // 0x198(0x01)
	bool m_finishedAsyncloading; // 0x199(0x01)
	char pad_19A[0x6]; // 0x19a(0x06)

	void SetGlobalVanityRuntimeData(struct FYActiveGlobalRuntimeVanityData newData); // Function Prospect.YCharacterVanityDataComponent.SetGlobalVanityRuntimeData // (Final|Native|Public|HasOutParms) // @ game+0x193d210
	void OnUpdatedGlobalVanityData(struct FYActiveGlobalRuntimeVanityData oldVanityData); // Function Prospect.YCharacterVanityDataComponent.OnUpdatedGlobalVanityData // (Final|Native|Protected|HasOutParms) // @ game+0x193ccc0
	void OnRep_SocialProfileRow(); // Function Prospect.YCharacterVanityDataComponent.OnRep_SocialProfileRow // (Final|Native|Protected) // @ game+0x193cc80
	void OnRep_ActiveData(struct FYActiveGlobalRuntimeVanityData oldData); // Function Prospect.YCharacterVanityDataComponent.OnRep_ActiveData // (Final|Native|Protected) // @ game+0x193ca40
	void OnPlayerProfileUpdated(struct FYPlayerProfile PlayerProfile); // Function Prospect.YCharacterVanityDataComponent.OnPlayerProfileUpdated // (Final|Native|Protected|HasOutParms) // @ game+0x193c980
	void OnFinishedAsyncLoading(int32_t loadHandle); // Function Prospect.YCharacterVanityDataComponent.OnFinishedAsyncLoading // (Final|Native|Protected) // @ game+0x193c6b0
	bool FindVanityDataItem(struct AActor* actorContext, enum class EYVanityType vanityType, struct FYGlobalVanityItem outData, int32_t itemSlotID); // Function Prospect.YCharacterVanityDataComponent.FindVanityDataItem // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x193c350
};

// Class Prospect.YCharacterVehicleComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UYCharacterVehicleComponent : UActorComponent {
	bool m_boostStateReplicated; // 0xb0(0x01)
	bool m_boostStateActiveLocal; // 0xb1(0x01)
	char pad_B2[0x6]; // 0xb2(0x06)
	struct FMulticastInlineDelegate OnDataTableRowHandleChanged; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnVehiclePossesionChangedDelegate; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnBoostStateChanged; // 0xd8(0x10)
	struct AYVehicle* m_vehicle; // 0xe8(0x08)

	void OnVehicleDeactivated(bool wasInterupted); // Function Prospect.YCharacterVehicleComponent.OnVehicleDeactivated // (Final|Native|Protected) // @ game+0x193ce00
	void OnVehicleActivated(); // Function Prospect.YCharacterVehicleComponent.OnVehicleActivated // (Final|Native|Protected) // @ game+0x193cde0
	void OnRep_Vehicle(); // Function Prospect.YCharacterVehicleComponent.OnRep_Vehicle // (Final|Native|Protected) // @ game+0x193cca0
	void OnRep_BoostStateChanged(); // Function Prospect.YCharacterVehicleComponent.OnRep_BoostStateChanged // (Final|Native|Protected) // @ game+0x193cc60
	void OnMovementImpact(struct FHitResult Hit, struct FVector moveDelta); // Function Prospect.YCharacterVehicleComponent.OnMovementImpact // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x193c850
	void OnMovementDataChanged(struct FYMovementModeDataChanged newData); // Function Prospect.YCharacterVehicleComponent.OnMovementDataChanged // (Final|Native|Protected) // @ game+0x193c7d0
};

// Class Prospect.YCharacterWeaponGlintComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYCharacterWeaponGlintComponent : UActorComponent {

	bool ShouldCreateGlint(); // Function Prospect.YCharacterWeaponGlintComponent.ShouldCreateGlint // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x193d5b0
	void OnLeaveTargeting(bool interupted); // Function Prospect.YCharacterWeaponGlintComponent.OnLeaveTargeting // (Final|Native|Protected) // @ game+0x193c740
	void OnEnterTargeting(); // Function Prospect.YCharacterWeaponGlintComponent.OnEnterTargeting // (Final|Native|Protected) // @ game+0x193c690
	void BP_OnLeaveTargeting(bool ShouldCreateGlint); // Function Prospect.YCharacterWeaponGlintComponent.BP_OnLeaveTargeting // (Native|Event|Protected|BlueprintEvent) // @ game+0x193bd90
	void BP_OnEnterTargeting(bool ShouldCreateGlint); // Function Prospect.YCharacterWeaponGlintComponent.BP_OnEnterTargeting // (Native|Event|Protected|BlueprintEvent) // @ game+0x193bd00
};

// Class Prospect.YChatFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UYChatFunctionLibrary : UObject {
};

// Class Prospect.YCheatManager
// Size: 0x88 (Inherited: 0x78)
struct UYCheatManager : UCheatManager {
	char pad_78[0x10]; // 0x78(0x10)

	void YToggleDebugger(); // Function Prospect.YCheatManager.YToggleDebugger // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YToggleAIPrototypeSpawning(); // Function Prospect.YCheatManager.YToggleAIPrototypeSpawning // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YSkipMatchState(); // Function Prospect.YCheatManager.YSkipMatchState // (Final|Exec|Native|Private|Const) // @ game+0x1942820
	void YSetSeasonLevel(int32_t Level); // Function Prospect.YCheatManager.YSetSeasonLevel // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YSetPlayerGamemodeRank(int32_t rank, struct FString GameMode); // Function Prospect.YCheatManager.YSetPlayerGamemodeRank // (Final|Exec|Native|Private|Const) // @ game+0x19425e0
	void YSetContractsBoardsRefreshTimeMinutesFromNow(int32_t howManyMinutesFromNow); // Function Prospect.YCheatManager.YSetContractsBoardsRefreshTimeMinutesFromNow // (Final|Exec|Native|Private) // @ game+0x193c180
	void YSendInboxMessage(struct FString messageRowId, struct FString grantRowId); // Function Prospect.YCheatManager.YSendInboxMessage // (Final|Exec|Native|Private|Const) // @ game+0x193ebc0
	void YResetSeasonProgress(); // Function Prospect.YCheatManager.YResetSeasonProgress // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YResetPlayerData(); // Function Prospect.YCheatManager.YResetPlayerData // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YResetGamemodeRank(struct FString GameMode); // Function Prospect.YCheatManager.YResetGamemodeRank // (Final|Exec|Native|Private|Const) // @ game+0x193d3c0
	void YResetAllGamemodesRank(); // Function Prospect.YCheatManager.YResetAllGamemodesRank // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YPrintDebugStringToScreen(struct FString debugString); // Function Prospect.YCheatManager.YPrintDebugStringToScreen // (Final|Exec|Native|Public|Const) // @ game+0x1942730
	void YLeaveSquad(); // Function Prospect.YCheatManager.YLeaveSquad // (Final|Exec|Native|Private|Const) // @ game+0x1942710
	void YInfiniteInteractions(); // Function Prospect.YCheatManager.YInfiniteInteractions // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YGotoPerformanceCameraActor(struct FName cameraName); // Function Prospect.YCheatManager.YGotoPerformanceCameraActor // (Final|Exec|Native|Private|Const) // @ game+0x193bba0
	void YGiveSeasonXp(int32_t xpIncrement); // Function Prospect.YCheatManager.YGiveSeasonXp // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YGiveSeasonLevel(int32_t levelIncrement); // Function Prospect.YCheatManager.YGiveSeasonLevel // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YGiveProspectorLevelXP(int32_t XPToGive); // Function Prospect.YCheatManager.YGiveProspectorLevelXP // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YGivePlayerGamemodeRank(int32_t rankIncrement, struct FString GameMode); // Function Prospect.YCheatManager.YGivePlayerGamemodeRank // (Final|Exec|Native|Private|Const) // @ game+0x19425e0
	void YGivePerk(struct FName RowName); // Function Prospect.YCheatManager.YGivePerk // (Final|Exec|Native|Private|Const) // @ game+0x193bba0
	void YGetRequiredProspectorLevelXPForNextLevel(int32_t CurrentLevel); // Function Prospect.YCheatManager.YGetRequiredProspectorLevelXPForNextLevel // (Final|Exec|Native|Private|Const) // @ game+0x1942550
	void YGCSafe(); // Function Prospect.YCheatManager.YGCSafe // (Final|Exec|Native|Static|Private) // @ game+0x1942530
	void YForceSquadMembersUpdate(); // Function Prospect.YCheatManager.YForceSquadMembersUpdate // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YFlushAsyncLoading(); // Function Prospect.YCheatManager.YFlushAsyncLoading // (Final|Exec|Native|Static|Private) // @ game+0x1942510
	void YEnableCanMoveItemLogging(); // Function Prospect.YCheatManager.YEnableCanMoveItemLogging // (Final|Exec|Native|Private|Const) // @ game+0x19424f0
	void YDeclineSquadInvite(struct FString inviteId); // Function Prospect.YCheatManager.YDeclineSquadInvite // (Final|Exec|Native|Private|Const) // @ game+0x1942450
	void YDebugVivoxLogData(); // Function Prospect.YCheatManager.YDebugVivoxLogData // (Final|Exec|Native|Private|Const) // @ game+0x1942430
	void YDebugUpgradeActiveWeapon(int32_t levelAmount); // Function Prospect.YCheatManager.YDebugUpgradeActiveWeapon // (Final|Exec|Native|Private|Const) // @ game+0x19423a0
	void YDebugUpdatePresenceState(int32_t State); // Function Prospect.YCheatManager.YDebugUpdatePresenceState // (Final|Exec|Native|Private) // @ game+0x1942310
	void YDebugUpdatePlayerSet(); // Function Prospect.YCheatManager.YDebugUpdatePlayerSet // (Final|Exec|Native|Private|Const) // @ game+0x19422f0
	void YDebugTriggerServerInventoryConcurrencyTest(); // Function Prospect.YCheatManager.YDebugTriggerServerInventoryConcurrencyTest // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugTriggerPopUp(struct FName RowName); // Function Prospect.YCheatManager.YDebugTriggerPopUp // (Final|Exec|Native|Private|HasOutParms) // @ game+0x193d5e0
	void YDebugTriggerInventoryConcurrencyTest(); // Function Prospect.YCheatManager.YDebugTriggerInventoryConcurrencyTest // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugTriggerIdleKick(); // Function Prospect.YCheatManager.YDebugTriggerIdleKick // (Final|Exec|Native|Private|Const) // @ game+0x19422d0
	void YDebugTravelToMatchStation(); // Function Prospect.YCheatManager.YDebugTravelToMatchStation // (Final|Exec|Native|Private) // @ game+0x19422b0
	void YDebugToggleWeaponTransportDebug(); // Function Prospect.YCheatManager.YDebugToggleWeaponTransportDebug // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugToggleWeaponSpread(); // Function Prospect.YCheatManager.YDebugToggleWeaponSpread // (Final|Exec|Native|Private|Const) // @ game+0x1942290
	void YDebugToggleOnScreenVisualization(); // Function Prospect.YCheatManager.YDebugToggleOnScreenVisualization // (Final|Exec|Native|Private|Const) // @ game+0x1942270
	void YDebugToggleMapMarkers(); // Function Prospect.YCheatManager.YDebugToggleMapMarkers // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugToggleInfiniteStamina(); // Function Prospect.YCheatManager.YDebugToggleInfiniteStamina // (Final|Exec|Native|Private|BlueprintCallable|Const) // @ game+0xfa96f0
	void YDebugToggleInfiniteDBNO(); // Function Prospect.YCheatManager.YDebugToggleInfiniteDBNO // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YDebugToggleInfiniteClip(); // Function Prospect.YCheatManager.YDebugToggleInfiniteClip // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugToggleInfiniteAmmo(); // Function Prospect.YCheatManager.YDebugToggleInfiniteAmmo // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugToggleImpactDebug(); // Function Prospect.YCheatManager.YDebugToggleImpactDebug // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YDebugToggleGPA(); // Function Prospect.YCheatManager.YDebugToggleGPA // (Final|Exec|Native|Private|Const) // @ game+0x1942250
	void YDebugToggleGameplayDebugger(); // Function Prospect.YCheatManager.YDebugToggleGameplayDebugger // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugToggleEOSLogging(bool shallLog); // Function Prospect.YCheatManager.YDebugToggleEOSLogging // (Final|Exec|Native|Private) // @ game+0x193c2a0
	void YDebugToggleEncumberance(); // Function Prospect.YCheatManager.YDebugToggleEncumberance // (Final|Exec|Native|Private|BlueprintCallable|Const) // @ game+0xfa96f0
	void YDebugToggleDrawWeaponCollisionPrimitives(); // Function Prospect.YCheatManager.YDebugToggleDrawWeaponCollisionPrimitives // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YDebugToggleDrawCollisionDebug(); // Function Prospect.YCheatManager.YDebugToggleDrawCollisionDebug // (Final|Exec|Native|Static|Private) // @ game+0x1942230
	void YDebugToggleCameraStartsFollowRecoil(); // Function Prospect.YCheatManager.YDebugToggleCameraStartsFollowRecoil // (Final|Exec|Native|Private|Const) // @ game+0x1942210
	void YDebugToggleAimAssistInfo(); // Function Prospect.YCheatManager.YDebugToggleAimAssistInfo // (Final|Exec|Native|Private|Const) // @ game+0x19421f0
	void YDebugToggleAbilityCooldowns(); // Function Prospect.YCheatManager.YDebugToggleAbilityCooldowns // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugTeleportRandomLocation(int32_t State); // Function Prospect.YCheatManager.YDebugTeleportRandomLocation // (Final|Exec|Native|Private|Const) // @ game+0x1942160
	void YDebugTeleportMeToActivity(bool randomizePosition); // Function Prospect.YCheatManager.YDebugTeleportMeToActivity // (Final|Exec|Native|Private|Const) // @ game+0x193c2a0
	void YDebugTeleportMeInRange(int32_t InRange); // Function Prospect.YCheatManager.YDebugTeleportMeInRange // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YDebugStatsInitialize(); // Function Prospect.YCheatManager.YDebugStatsInitialize // (Final|Exec|Native|Private|Const) // @ game+0x1942140
	void YDebugStartTutorial(); // Function Prospect.YCheatManager.YDebugStartTutorial // (Final|Exec|Native|Private) // @ game+0x1942120
	void YDebugStartSessionState(int32_t State); // Function Prospect.YCheatManager.YDebugStartSessionState // (Final|Exec|Native|Private|Const) // @ game+0x1942090
	void YDebugStartScene(struct FString sceneName, bool doNpcTransition); // Function Prospect.YCheatManager.YDebugStartScene // (Final|Exec|Native|Private|Const) // @ game+0x1941fb0
	void YDebugStartMissionLine(struct FString missionArcId, struct FString missionId); // Function Prospect.YCheatManager.YDebugStartMissionLine // (Final|Exec|Native|Private|Const) // @ game+0x193be20
	void YDebugStartMatchmakingWithMap(struct FString fullMapName); // Function Prospect.YCheatManager.YDebugStartMatchmakingWithMap // (Final|Exec|Native|Private) // @ game+0x1941ec0
	void YDebugStartMatchmakingWithDebugOption(int32_t InstanceType, int32_t debugOption); // Function Prospect.YCheatManager.YDebugStartMatchmakingWithDebugOption // (Final|Exec|Native|Private) // @ game+0x1941df0
	void YDebugStartMatchmaking(); // Function Prospect.YCheatManager.YDebugStartMatchmaking // (Final|Exec|Native|Private) // @ game+0x1941dd0
	void YDebugSpawnBackgroundDropPod(); // Function Prospect.YCheatManager.YDebugSpawnBackgroundDropPod // (Final|Exec|Native|Private|Const) // @ game+0x1941db0
	void YDebugSocialRemoveFriend(struct FString targetPlayFabId); // Function Prospect.YCheatManager.YDebugSocialRemoveFriend // (Final|Exec|Native|Private|Const) // @ game+0x1941cc0
	void YDebugSocialManagerState(); // Function Prospect.YCheatManager.YDebugSocialManagerState // (Final|Exec|Native|Private|Const) // @ game+0x1941ca0
	void YDebugSocialDeclineFriendRequest(struct FString targetPlayFabId); // Function Prospect.YCheatManager.YDebugSocialDeclineFriendRequest // (Final|Exec|Native|Private|Const) // @ game+0x1941bb0
	void YDebugSocialAddFriend(struct FString targetPlayFabId); // Function Prospect.YCheatManager.YDebugSocialAddFriend // (Final|Exec|Native|Private|Const) // @ game+0x1941ac0
	void YDebugSocialAcceptFriendRequest(struct FString targetPlayFabId); // Function Prospect.YCheatManager.YDebugSocialAcceptFriendRequest // (Final|Exec|Native|Private|Const) // @ game+0x19419d0
	void YDebugSkipLegalAgreements(); // Function Prospect.YCheatManager.YDebugSkipLegalAgreements // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugSimulatePlayerAmount(int32_t Amount, int32_t Iterations, bool sendToBackend); // Function Prospect.YCheatManager.YDebugSimulatePlayerAmount // (Final|Exec|Native|Private|Const) // @ game+0x19418c0
	void YDebugSimulateDateTimeForSeasonsService(struct FString DateTime); // Function Prospect.YCheatManager.YDebugSimulateDateTimeForSeasonsService // (Final|Exec|Native|Private|Const) // @ game+0x193d960
	void YDebugShowMatchmakingSkill(); // Function Prospect.YCheatManager.YDebugShowMatchmakingSkill // (Final|Exec|Native|Private) // @ game+0x19418a0
	void YDebugShowCameraCollision(); // Function Prospect.YCheatManager.YDebugShowCameraCollision // (Final|Exec|Native|Static|Private) // @ game+0x1941880
	void YDebugShopTryOfferCheckout(struct FString OfferId, int32_t quantity); // Function Prospect.YCheatManager.YDebugShopTryOfferCheckout // (Final|Exec|Native|Private) // @ game+0x193db30
	void YDebugSetTutorialUserDataTutorialFlag(bool flag); // Function Prospect.YCheatManager.YDebugSetTutorialUserDataTutorialFlag // (Final|Exec|Native|Private|Const) // @ game+0x19417f0
	void YDebugSetTechTreeNodeLevel(struct FString nodeId, int32_t Level); // Function Prospect.YCheatManager.YDebugSetTechTreeNodeLevel // (Final|Exec|Native|Private) // @ game+0x193db30
	void YDebugSetStatsBatched(); // Function Prospect.YCheatManager.YDebugSetStatsBatched // (Final|Exec|Native|Private|Const) // @ game+0x19417d0
	void YDebugSetStat(struct FString StatName, struct FString gameModeType, int32_t activityType, int32_t NewValue); // Function Prospect.YCheatManager.YDebugSetStat // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x1941640
	void YDebugSetStashLimit(int32_t stashLimit); // Function Prospect.YCheatManager.YDebugSetStashLimit // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YDebugSetSharedState(bool newState); // Function Prospect.YCheatManager.YDebugSetSharedState // (Final|Exec|Native|Private|Const) // @ game+0x19415b0
	void YDebugSetShard(int32_t shardIndex); // Function Prospect.YCheatManager.YDebugSetShard // (Final|Exec|Native|Private|Const) // @ game+0x1941520
	void YDebugSetSessionState(struct FString SessionId, int32_t matchState); // Function Prospect.YCheatManager.YDebugSetSessionState // (Final|Exec|Native|Private) // @ game+0x19413f0
	void YDebugSetRecoilValue(float newRecoilValue); // Function Prospect.YCheatManager.YDebugSetRecoilValue // (Final|Exec|Native|Private|Const) // @ game+0x1941370
	void YDebugSetPlayerQuartersLevel(int32_t Level); // Function Prospect.YCheatManager.YDebugSetPlayerQuartersLevel // (Final|Exec|Native|Private) // @ game+0x193c180
	void YDebugSetPing(struct FString Region, int32_t Ping); // Function Prospect.YCheatManager.YDebugSetPing // (Final|Exec|Native|Private|Const) // @ game+0x1941240
	void YDebugSetPickaxeLevel(int32_t Level); // Function Prospect.YCheatManager.YDebugSetPickaxeLevel // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YDebugSetMuteState(bool setMuted, float Duration); // Function Prospect.YCheatManager.YDebugSetMuteState // (Final|Exec|Native|Private|Const) // @ game+0x1941170
	void YDebugSetMissionCount(struct FString missionId, struct FString missionArcId); // Function Prospect.YCheatManager.YDebugSetMissionCount // (Final|Exec|Native|Private|Const) // @ game+0x193be20
	void YDebugSetMissionCompleted(struct FString missionId, struct FString missionArcId); // Function Prospect.YCheatManager.YDebugSetMissionCompleted // (Final|Exec|Native|Private|Const) // @ game+0x193be20
	void YDebugSetMissionActive(struct FString missionArcId, struct FString missionId, bool newState); // Function Prospect.YCheatManager.YDebugSetMissionActive // (Final|Exec|Native|Private|Const) // @ game+0x1940fb0
	void YDebugSetMissionAcknowledged(struct FString missionArcId, struct FString missionId); // Function Prospect.YCheatManager.YDebugSetMissionAcknowledged // (Final|Exec|Native|Private|Const) // @ game+0x193be20
	void YDebugSetMatchTime(int32_t newTime); // Function Prospect.YCheatManager.YDebugSetMatchTime // (Final|Exec|Native|Private|Const) // @ game+0x1940f20
	void YDebugSetGlobalVanityLocal(struct FString ID); // Function Prospect.YCheatManager.YDebugSetGlobalVanityLocal // (Final|Exec|Native|Private|Const) // @ game+0x193d3c0
	void YDebugSetGlobalVanityIdBackend(struct FString ID, int32_t variation, int32_t slotId); // Function Prospect.YCheatManager.YDebugSetGlobalVanityIdBackend // (Final|Exec|Native|Private|Const) // @ game+0x1940dc0
	void YDebugSetCharacterRelevancyDistance(int32_t newRelevancyDistance); // Function Prospect.YCheatManager.YDebugSetCharacterRelevancyDistance // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YDebugSetBagLimit(int32_t bagLimit); // Function Prospect.YCheatManager.YDebugSetBagLimit // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YDebugSetActiveOnboardingMission(struct FString missionId, int32_t stepId); // Function Prospect.YCheatManager.YDebugSetActiveOnboardingMission // (Final|Exec|Native|Private|HasOutParms) // @ game+0x1940cd0
	void YDebugSetActiveContractProgress(struct FString contractId, int32_t objectiveIndex, int32_t newProgress); // Function Prospect.YCheatManager.YDebugSetActiveContractProgress // (Final|Exec|Native|Private) // @ game+0x1940bb0
	void YDebugSendSupportRequest(); // Function Prospect.YCheatManager.YDebugSendSupportRequest // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugSendServerFPSSummary(); // Function Prospect.YCheatManager.YDebugSendServerFPSSummary // (Final|Exec|Native|Private|Const) // @ game+0x1940b90
	void YDebugSendLogToAWS(); // Function Prospect.YCheatManager.YDebugSendLogToAWS // (Final|Exec|Native|Private|Const) // @ game+0x1940b70
	void YDebugSendLogFile(); // Function Prospect.YCheatManager.YDebugSendLogFile // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YDebugSearchUserName(struct FString Username); // Function Prospect.YCheatManager.YDebugSearchUserName // (Final|Exec|Native|Private|Const) // @ game+0x1940a80
	void YDebugSeamlessTravel(struct FString towards, int32_t TravelType, bool seamless); // Function Prospect.YCheatManager.YDebugSeamlessTravel // (Final|Exec|Native|Private|Const) // @ game+0x1940950
	void YDebugRestartServersSpecified(int32_t Type); // Function Prospect.YCheatManager.YDebugRestartServersSpecified // (Final|Exec|Native|Private|Const) // @ game+0x19408c0
	void YDebugRestartServers(); // Function Prospect.YCheatManager.YDebugRestartServers // (Final|Exec|Native|Private|Const) // @ game+0x19408a0
	void YDebugResetTutorialFlag(); // Function Prospect.YCheatManager.YDebugResetTutorialFlag // (Final|Exec|Native|Private|Const) // @ game+0x1940880
	void YDebugResetTechTree(); // Function Prospect.YCheatManager.YDebugResetTechTree // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugResetStats(); // Function Prospect.YCheatManager.YDebugResetStats // (Final|Exec|Native|Private|Const) // @ game+0x1940860
	void YDebugResetPlayer(); // Function Prospect.YCheatManager.YDebugResetPlayer // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugResetPersistentMatch(); // Function Prospect.YCheatManager.YDebugResetPersistentMatch // (Final|Exec|Native|Private|Const) // @ game+0x1940840
	void YDebugResetPassiveGenerator(struct FString generatorId); // Function Prospect.YCheatManager.YDebugResetPassiveGenerator // (Final|Exec|Native|Private|Const) // @ game+0x193d960
	void YDebugResetOnboardingProgress(); // Function Prospect.YCheatManager.YDebugResetOnboardingProgress // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugResetMission(struct FString missionArcId, struct FString missionId); // Function Prospect.YCheatManager.YDebugResetMission // (Final|Exec|Native|Private|Const) // @ game+0x193be20
	void YDebugResetInitialize(); // Function Prospect.YCheatManager.YDebugResetInitialize // (Final|Exec|Native|Private|Const) // @ game+0x1940820
	void YDebugResetFactionProgress(struct FString factionId); // Function Prospect.YCheatManager.YDebugResetFactionProgress // (Final|Exec|Native|Private) // @ game+0x193d960
	void YDebugResetAllPassiveGenerators(); // Function Prospect.YCheatManager.YDebugResetAllPassiveGenerators // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugResetAllFactionsProgress(); // Function Prospect.YCheatManager.YDebugResetAllFactionsProgress // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugRerollWeeklyChallenges(); // Function Prospect.YCheatManager.YDebugRerollWeeklyChallenges // (Final|Exec|Native|Private|Const) // @ game+0x1940800
	void YDebugRerollDailyChallenges(); // Function Prospect.YCheatManager.YDebugRerollDailyChallenges // (Final|Exec|Native|Private|Const) // @ game+0x1940800
	void YDebugRerollChallenges(int32_t Type); // Function Prospect.YCheatManager.YDebugRerollChallenges // (Final|Exec|Native|Private|Const) // @ game+0x1940770
	void YDebugRequestUpdatedSessionState(); // Function Prospect.YCheatManager.YDebugRequestUpdatedSessionState // (Final|Exec|Native|Private) // @ game+0x1940750
	void YDebugRequestTravel(bool loadMapDirectly); // Function Prospect.YCheatManager.YDebugRequestTravel // (Final|Exec|Native|Private|Const) // @ game+0x19406c0
	void YDebugRequestResourceStateChange(bool clearResources); // Function Prospect.YCheatManager.YDebugRequestResourceStateChange // (Final|Exec|Native|Private|Const) // @ game+0x1940630
	void YDebugRequestPlayerSet(); // Function Prospect.YCheatManager.YDebugRequestPlayerSet // (Final|Exec|Native|Private|Const) // @ game+0x1940610
	void YDebugRequestInventoryRefresh(); // Function Prospect.YCheatManager.YDebugRequestInventoryRefresh // (Final|Exec|Native|Private|Const) // @ game+0x19405f0
	void YDebugReportPlayer(enum class EYReportPlayerType reportType, struct FString UserId, struct FString Message); // Function Prospect.YCheatManager.YDebugReportPlayer // (Final|Exec|Native|Private|Const) // @ game+0x19404b0
	void YDebugRemoveVanityID(struct FString vanityId); // Function Prospect.YCheatManager.YDebugRemoveVanityID // (Final|Exec|Native|Private|Const) // @ game+0x1940410
	void YDebugRemoveTournamentUser(); // Function Prospect.YCheatManager.YDebugRemoveTournamentUser // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugRemoveThisUserFromAcceptedLegalAgreements(); // Function Prospect.YCheatManager.YDebugRemoveThisUserFromAcceptedLegalAgreements // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugRemoveFriendUserId(struct FString UserId); // Function Prospect.YCheatManager.YDebugRemoveFriendUserId // (Final|Exec|Native|Private) // @ game+0x1940320
	void YDebugRemoveDebugText(int32_t Handle); // Function Prospect.YCheatManager.YDebugRemoveDebugText // (Final|Exec|Native|Private|Const) // @ game+0x1940290
	void YDebugRemoveAllText(); // Function Prospect.YCheatManager.YDebugRemoveAllText // (Final|Exec|Native|Private|Const) // @ game+0x1940270
	void YDebugRemoveAllMaterialsFromPlayer(struct FName UserId); // Function Prospect.YCheatManager.YDebugRemoveAllMaterialsFromPlayer // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193d5e0
	void YDebugRemoveAllMaterials(); // Function Prospect.YCheatManager.YDebugRemoveAllMaterials // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugRemoveAllItemsFromPlayer(struct FName UserId); // Function Prospect.YCheatManager.YDebugRemoveAllItemsFromPlayer // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193d5e0
	void YDebugRemoveAllItems(); // Function Prospect.YCheatManager.YDebugRemoveAllItems // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugRemoveAllFriends(); // Function Prospect.YCheatManager.YDebugRemoveAllFriends // (Final|Exec|Native|Private) // @ game+0x1940250
	void YDebugRemoveAllActiveContracts(); // Function Prospect.YCheatManager.YDebugRemoveAllActiveContracts // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugRefreshAndLogActiveContractProgress(); // Function Prospect.YCheatManager.YDebugRefreshAndLogActiveContractProgress // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugRedeemPlayfabCoupon(struct FString CouponCode, struct FString CatalogVersion); // Function Prospect.YCheatManager.YDebugRedeemPlayfabCoupon // (Final|Exec|Native|Private) // @ game+0x193ebc0
	void YDebugReconnectSignalR(); // Function Prospect.YCheatManager.YDebugReconnectSignalR // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugRebuildInventory(); // Function Prospect.YCheatManager.YDebugRebuildInventory // (Final|Exec|Native|Private|Const) // @ game+0x1940230
	void YDebugQueryStats(); // Function Prospect.YCheatManager.YDebugQueryStats // (Final|Exec|Native|Private|Const) // @ game+0x1940210
	void YDebugPushStatsUpdate(); // Function Prospect.YCheatManager.YDebugPushStatsUpdate // (Final|Exec|Native|Private|Const) // @ game+0x19401f0
	void YDebugPurchaseOffer(struct FString OfferId, int32_t quantity); // Function Prospect.YCheatManager.YDebugPurchaseOffer // (Final|Exec|Native|Static|Private) // @ game+0x19400d0
	void YDebugProfanityWord(struct FString inWord); // Function Prospect.YCheatManager.YDebugProfanityWord // (Final|Exec|Native|Private|Const) // @ game+0x193ffe0
	void YDebugPrintStats(int32_t serverData); // Function Prospect.YCheatManager.YDebugPrintStats // (Final|Exec|Native|Private|Const) // @ game+0x193ff50
	void YDebugPrintServerPerfDataToLog(); // Function Prospect.YCheatManager.YDebugPrintServerPerfDataToLog // (Final|Exec|Native|Private|Const) // @ game+0x193ff30
	void YDebugPrintMissionData(); // Function Prospect.YCheatManager.YDebugPrintMissionData // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugPrintCheckedAssetTypes(); // Function Prospect.YCheatManager.YDebugPrintCheckedAssetTypes // (Final|Exec|Native|Static|Private) // @ game+0x193ff10
	void YDebugPlayAnnouncement(struct FName RowName); // Function Prospect.YCheatManager.YDebugPlayAnnouncement // (Final|Exec|Native|Private) // @ game+0x193bba0
	void YDebugOutputStateComponentDebugData(); // Function Prospect.YCheatManager.YDebugOutputStateComponentDebugData // (Final|Exec|Native|Private|Const) // @ game+0x193fef0
	void YDebugMutelistRemoveEntry(struct FString PlayerId); // Function Prospect.YCheatManager.YDebugMutelistRemoveEntry // (Final|Exec|Native|Static|Private) // @ game+0x193fe60
	void YDebugMutelistList(); // Function Prospect.YCheatManager.YDebugMutelistList // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YDebugMutelistAddEntry(struct FString PlayerId, bool muteChat, bool muteVoicechat); // Function Prospect.YCheatManager.YDebugMutelistAddEntry // (Final|Exec|Native|Static|Private) // @ game+0x193fd30
	void YDebugModifyUserSkill(int32_t skill, int32_t deviation); // Function Prospect.YCheatManager.YDebugModifyUserSkill // (Final|Exec|Native|Private|Const) // @ game+0x193fc60
	void YDebugMatchmakingSetUserNVR(int32_t nvr); // Function Prospect.YCheatManager.YDebugMatchmakingSetUserNVR // (Final|Exec|Native|Private) // @ game+0x193fbd0
	void YDebugMatchmakingSetSessionNVR(struct FString SessionId, int32_t nvr); // Function Prospect.YCheatManager.YDebugMatchmakingSetSessionNVR // (Final|Exec|Native|Private) // @ game+0x193faa0
	void YDebugMatchmakingListUserInfoRequest(); // Function Prospect.YCheatManager.YDebugMatchmakingListUserInfoRequest // (Final|Exec|Native|Private) // @ game+0x193fa80
	void YDebugMatchHasEnded(); // Function Prospect.YCheatManager.YDebugMatchHasEnded // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugMakeChannelIDActiveVoice(int32_t ChannelType); // Function Prospect.YCheatManager.YDebugMakeChannelIDActiveVoice // (Final|Exec|Native|Private|Const) // @ game+0x193f9f0
	void YDebugLogWeaponInfo(); // Function Prospect.YCheatManager.YDebugLogWeaponInfo // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugLogSessionInformation(); // Function Prospect.YCheatManager.YDebugLogSessionInformation // (Final|Exec|Native|Private) // @ game+0x193f940
	void YDebugLogPlayerVanity(); // Function Prospect.YCheatManager.YDebugLogPlayerVanity // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugLogPlayerStates(); // Function Prospect.YCheatManager.YDebugLogPlayerStates // (Final|Exec|Native|Private|Const) // @ game+0x193f920
	void YDebugLogoutVivox(bool tryReconnect); // Function Prospect.YCheatManager.YDebugLogoutVivox // (Final|Exec|Native|Private|Const) // @ game+0x193f960
	void YDebugLogin(struct FString Username, struct FString Password); // Function Prospect.YCheatManager.YDebugLogin // (Final|Exec|Native|Private|Const) // @ game+0x193be20
	void YDebugLogAllFactionsProgress(); // Function Prospect.YCheatManager.YDebugLogAllFactionsProgress // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListUserCurrencies(); // Function Prospect.YCheatManager.YDebugListUserCurrencies // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListSquadInfo(); // Function Prospect.YCheatManager.YDebugListSquadInfo // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListPersistentMatches(); // Function Prospect.YCheatManager.YDebugListPersistentMatches // (Final|Exec|Native|Private) // @ game+0x193f900
	void YDebugListPendingFriendRequests(); // Function Prospect.YCheatManager.YDebugListPendingFriendRequests // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListMatchmakingSettings(); // Function Prospect.YCheatManager.YDebugListMatchmakingSettings // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListItemToAcquisitionData(); // Function Prospect.YCheatManager.YDebugListItemToAcquisitionData // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListInteractingContainerInventory(); // Function Prospect.YCheatManager.YDebugListInteractingContainerInventory // (Final|Exec|Native|Private|Const) // @ game+0x193f8e0
	void YDebugListIngameInventory(); // Function Prospect.YCheatManager.YDebugListIngameInventory // (Final|Exec|Native|Private|Const) // @ game+0x193f8c0
	void YDebugListGrantToAcquisitionData(); // Function Prospect.YCheatManager.YDebugListGrantToAcquisitionData // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListFriendsList(); // Function Prospect.YCheatManager.YDebugListFriendsList // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListFeatureToggles(); // Function Prospect.YCheatManager.YDebugListFeatureToggles // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListCachedStores(); // Function Prospect.YCheatManager.YDebugListCachedStores // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListCachedOnlineOffers(); // Function Prospect.YCheatManager.YDebugListCachedOnlineOffers // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugListCachedNotifications(); // Function Prospect.YCheatManager.YDebugListCachedNotifications // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListCachedInboxMessages(); // Function Prospect.YCheatManager.YDebugListCachedInboxMessages // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YDebugListCachedGrants(); // Function Prospect.YCheatManager.YDebugListCachedGrants // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugListAcceptedLegalAgreements(); // Function Prospect.YCheatManager.YDebugListAcceptedLegalAgreements // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugLightning(int32_t lightningDebugLevel); // Function Prospect.YCheatManager.YDebugLightning // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YDebugLeaveStationInfo(); // Function Prospect.YCheatManager.YDebugLeaveStationInfo // (Final|Exec|Native|Private|Const) // @ game+0x193f8a0
	void YDebugKillAllCurrentAI(); // Function Prospect.YCheatManager.YDebugKillAllCurrentAI // (Final|Exec|Native|Private|Const) // @ game+0x193f880
	void YDebugJoinSquad(int32_t squadNumber); // Function Prospect.YCheatManager.YDebugJoinSquad // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void YDebugInteractionTrace(); // Function Prospect.YCheatManager.YDebugInteractionTrace // (Final|Exec|Native|Static|Private) // @ game+0x193f860
	void YDebugInitializationDebugState(); // Function Prospect.YCheatManager.YDebugInitializationDebugState // (Final|Exec|Native|Private) // @ game+0x193f840
	void YDebugIncreaseStat(struct FString StatName, struct FString gameModeType, int32_t activityType, int32_t incrementValue); // Function Prospect.YCheatManager.YDebugIncreaseStat // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193f6b0
	void YDebugImportFriendsFromCurrentPlatform(); // Function Prospect.YCheatManager.YDebugImportFriendsFromCurrentPlatform // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugImmortalMode(); // Function Prospect.YCheatManager.YDebugImmortalMode // (Final|Exec|Native|Private|Const) // @ game+0x193f690
	void YDebugGodMode(); // Function Prospect.YCheatManager.YDebugGodMode // (Final|Exec|Native|Private|BlueprintCallable|Const) // @ game+0xfa96f0
	void YDebugGiveWeaponWithVanity(struct FName weaponRowName, struct FName vanityRowName, struct FName charmRowName); // Function Prospect.YCheatManager.YDebugGiveWeaponWithVanity // (Final|Exec|Native|Private) // @ game+0x193f580
	void YDebugGiveWeapon(struct FName weaponRowName); // Function Prospect.YCheatManager.YDebugGiveWeapon // (Final|Exec|Native|Private|Const) // @ game+0x193f4f0
	void YDebugGiveRandomWeapon(); // Function Prospect.YCheatManager.YDebugGiveRandomWeapon // (Final|Exec|Native|Private|Const) // @ game+0x193f4d0
	void YDebugGivePlayerContractRewards(struct FString contractId); // Function Prospect.YCheatManager.YDebugGivePlayerContractRewards // (Final|Exec|Native|Private) // @ game+0x193d960
	void YDebugGiveMod(struct FName RowName); // Function Prospect.YCheatManager.YDebugGiveMod // (Final|Exec|Native|Private|Const) // @ game+0x193bba0
	void YDebugGiveItem(enum class EYItemType ItemType, struct FName RowName, int32_t Amount, bool forceEquip); // Function Prospect.YCheatManager.YDebugGiveItem // (Final|Exec|Native|Private|Const) // @ game+0x193f370
	void YDebugGiveHelmet(struct FName helmetRowName); // Function Prospect.YCheatManager.YDebugGiveHelmet // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193f2e0
	void YDebugGiveDevice(struct FName deviceRowName); // Function Prospect.YCheatManager.YDebugGiveDevice // (Final|Exec|Native|Private|Const) // @ game+0x193f250
	void YDebugGiveBackpack(struct FName backpackRowName); // Function Prospect.YCheatManager.YDebugGiveBackpack // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193f1c0
	void YDebugGiveArmor(struct FName armorRowName); // Function Prospect.YCheatManager.YDebugGiveArmor // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193f130
	void YDebugGiveAmmoType(struct FName RowName); // Function Prospect.YCheatManager.YDebugGiveAmmoType // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193f0a0
	void YDebugGiveAmmo(struct FName ammoRowName); // Function Prospect.YCheatManager.YDebugGiveAmmo // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193f010
	void YDebugGiveAbility(struct FName RowName); // Function Prospect.YCheatManager.YDebugGiveAbility // (Final|Exec|Native|Private|Const) // @ game+0x193ef80
	void YDebugGetStat(struct FString StatName, struct FString gameModeType, struct FString activityType); // Function Prospect.YCheatManager.YDebugGetStat // (Final|Exec|Native|Private|Const) // @ game+0x193ee30
	void YDebugGetAIStats(); // Function Prospect.YCheatManager.YDebugGetAIStats // (Final|Exec|Native|Private) // @ game+0x193ee10
	void YDebugGenerateServerStationReport(); // Function Prospect.YCheatManager.YDebugGenerateServerStationReport // (Final|Exec|Native|Private|Const) // @ game+0x193edf0
	void YDebugFriendInviteUserID(struct FString UserId, bool immediateAccept); // Function Prospect.YCheatManager.YDebugFriendInviteUserID // (Final|Exec|Native|Private) // @ game+0x193ecc0
	void YDebugForceRefreshContractsBoards(); // Function Prospect.YCheatManager.YDebugForceRefreshContractsBoards // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugForceFetchPlayFabStore(struct FString StoreId, struct FString CatalogVersion); // Function Prospect.YCheatManager.YDebugForceFetchPlayFabStore // (Final|Exec|Native|Private|Const) // @ game+0x193ebc0
	void YDebugExecuteAzureFunction(struct FString FunctionName); // Function Prospect.YCheatManager.YDebugExecuteAzureFunction // (Final|Exec|Native|Private|Const) // @ game+0x193ead0
	void YDebugEscape(); // Function Prospect.YCheatManager.YDebugEscape // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugEnfOfMatchStats(int32_t Placement, int32_t playerResult, struct FString Mode); // Function Prospect.YCheatManager.YDebugEnfOfMatchStats // (Final|Exec|Native|Private|Const) // @ game+0x193e970
	void YDebugDumpSocialInformation(); // Function Prospect.YCheatManager.YDebugDumpSocialInformation // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YDebugDumpNPCInfo(); // Function Prospect.YCheatManager.YDebugDumpNPCInfo // (Final|Exec|Native|Private|Const) // @ game+0x193e930
	void YDebugDumpNetworkActors(); // Function Prospect.YCheatManager.YDebugDumpNetworkActors // (Final|Exec|Native|Private) // @ game+0x193e950
	void YDebugDumpLatencyAnalytics(); // Function Prospect.YCheatManager.YDebugDumpLatencyAnalytics // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugDumpInputState(); // Function Prospect.YCheatManager.YDebugDumpInputState // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YDebugDumpInitializationData(); // Function Prospect.YCheatManager.YDebugDumpInitializationData // (Final|Exec|Native|Private) // @ game+0x193e910
	void YDebugDumpDragState(); // Function Prospect.YCheatManager.YDebugDumpDragState // (Final|Exec|Native|Private|Const) // @ game+0x193e8f0
	void YDebugDumpCustomizationData(); // Function Prospect.YCheatManager.YDebugDumpCustomizationData // (Final|Exec|Native|Private|Const) // @ game+0x193e8d0
	void YDebugDumpAbilityAnalytics(); // Function Prospect.YCheatManager.YDebugDumpAbilityAnalytics // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugDrawStatesDebug(); // Function Prospect.YCheatManager.YDebugDrawStatesDebug // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void YDebugDisplayTrackedMessages(); // Function Prospect.YCheatManager.YDebugDisplayTrackedMessages // (Final|Exec|Native|Private) // @ game+0x193e8b0
	void YDebugDestroyFromClass(struct FString ClassName, int32_t replicateServer); // Function Prospect.YCheatManager.YDebugDestroyFromClass // (Final|Exec|Native|Private|Const) // @ game+0x193e780
	void YDebugCreateChannel(struct FString channelId); // Function Prospect.YCheatManager.YDebugCreateChannel // (Final|Exec|Native|Private|Const) // @ game+0x193e690
	void YDebugCraftItemFromShopWithRarity(struct FName blueprintName, struct FString fromShop, int32_t bpRarity); // Function Prospect.YCheatManager.YDebugCraftItemFromShopWithRarity // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193e560
	void YDebugCraftItemAllShopsAllRarities(struct FName blueprintName); // Function Prospect.YCheatManager.YDebugCraftItemAllShopsAllRarities // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193d5e0
	void YDebugConnectionStarted(); // Function Prospect.YCheatManager.YDebugConnectionStarted // (Final|Exec|Native|Private|Const) // @ game+0x193e540
	void YDebugClearSpecificCompletedOneTimeContract(struct FString contractId); // Function Prospect.YCheatManager.YDebugClearSpecificCompletedOneTimeContract // (Final|Exec|Native|Private) // @ game+0x193d960
	void YDebugClearPopupConfigEntries(); // Function Prospect.YCheatManager.YDebugClearPopupConfigEntries // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugClearChannel(struct FString channelId); // Function Prospect.YCheatManager.YDebugClearChannel // (Final|Exec|Native|Private|Const) // @ game+0x193e450
	void YDebugClearAllMissionLines(); // Function Prospect.YCheatManager.YDebugClearAllMissionLines // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YDebugClearAllCompletedOneTimeContracts(); // Function Prospect.YCheatManager.YDebugClearAllCompletedOneTimeContracts // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugChangeServerStationShardBackend(int32_t shardIndex); // Function Prospect.YCheatManager.YDebugChangeServerStationShardBackend // (Final|Exec|Native|Private|Const) // @ game+0x193e3c0
	void YDebugChangeBodyPart(struct FString ID, int32_t Type, int32_t colorVariation); // Function Prospect.YCheatManager.YDebugChangeBodyPart // (Final|Exec|Native|Private|Const) // @ game+0x193e260
	void YDebugChangeArchetypeId(struct FString ID); // Function Prospect.YCheatManager.YDebugChangeArchetypeId // (Final|Exec|Native|Private|Const) // @ game+0x193e170
	void YDebugCalculateCurrentGlicko(bool sendDataToBe); // Function Prospect.YCheatManager.YDebugCalculateCurrentGlicko // (Final|Exec|Native|Private) // @ game+0x193e0e0
	void YDebugAutomationData(); // Function Prospect.YCheatManager.YDebugAutomationData // (Final|Exec|Native|Private) // @ game+0x193e0c0
	void YDebugAddVanityIDAmount(struct FString vanityId, int32_t Amount); // Function Prospect.YCheatManager.YDebugAddVanityIDAmount // (Final|Exec|Native|Private|Const) // @ game+0x193dfe0
	void YDebugAddTournamentUser(); // Function Prospect.YCheatManager.YDebugAddTournamentUser // (Final|Exec|Native|Private) // @ game+0xfa96f0
	void YDebugAddRecentlyPlayed(struct FString UserId); // Function Prospect.YCheatManager.YDebugAddRecentlyPlayed // (Final|Exec|Native|Private|Const) // @ game+0x193def0
	void YDebugAddRandomMissingAmmoType(); // Function Prospect.YCheatManager.YDebugAddRandomMissingAmmoType // (Final|Exec|Native|Private|Const) // @ game+0x193ded0
	void YDebugAddPlayerImpulse(float Impulse); // Function Prospect.YCheatManager.YDebugAddPlayerImpulse // (Final|Exec|Native|Private|Const) // @ game+0x193de50
	void YDebugAddNotification(int32_t Type, int32_t messageType, bool isPermanent, struct FString Name, struct FString Message); // Function Prospect.YCheatManager.YDebugAddNotification // (Final|Exec|Native|Private|Const) // @ game+0x193dc10
	void YDebugAddInventoryCurrency(struct FString currencyName, int32_t Amount); // Function Prospect.YCheatManager.YDebugAddInventoryCurrency // (Final|Exec|Native|Private|Const) // @ game+0x193db30
	void YDebugAddFactionProgress(struct FString factionId, int32_t repIncrese); // Function Prospect.YCheatManager.YDebugAddFactionProgress // (Final|Exec|Native|Private) // @ game+0x193db30
	void YDebugAddDebugText(struct FString DebugText, int32_t colorType); // Function Prospect.YCheatManager.YDebugAddDebugText // (Final|Exec|Native|Private) // @ game+0x193da00
	void YDebugAddAllVanityOfType(int32_t vanityType); // Function Prospect.YCheatManager.YDebugAddAllVanityOfType // (Final|Exec|Native|Private) // @ game+0x193c180
	void YDebugActivateContractByRowName(struct FString contractId); // Function Prospect.YCheatManager.YDebugActivateContractByRowName // (Final|Exec|Native|Private) // @ game+0x193d960
	void YDebugActionFriendInvites(bool accept); // Function Prospect.YCheatManager.YDebugActionFriendInvites // (Final|Exec|Native|Private) // @ game+0x193d8d0
	void YClearInventory(); // Function Prospect.YCheatManager.YClearInventory // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void YActivitiesShowMinimapDebug(enum class EYActivityType Type); // Function Prospect.YCheatManager.YActivitiesShowMinimapDebug // (Final|Exec|Native|Private|Const) // @ game+0x193d850
	void YAcceptSquadInvite(struct FString inviteId); // Function Prospect.YCheatManager.YAcceptSquadInvite // (Final|Exec|Native|Private|Const) // @ game+0x193d7b0
	void Volume(float Volume); // Function Prospect.YCheatManager.Volume // (Final|Exec|Native|Static|Private) // @ game+0x193d730
	void ToggleDebugMenu(); // Function Prospect.YCheatManager.ToggleDebugMenu // (Final|Exec|Native|Private|Const) // @ game+0x193d710
	void Suicide(float Timer); // Function Prospect.YCheatManager.Suicide // (Final|Exec|Native|Private) // @ game+0x193d690
	void StartMatch(); // Function Prospect.YCheatManager.StartMatch // (Final|Exec|Native|Private|Const) // @ game+0x193d670
	void ShowMousePosition(); // Function Prospect.YCheatManager.ShowMousePosition // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void ShowItemsOfPlayer(struct FName UserId); // Function Prospect.YCheatManager.ShowItemsOfPlayer // (Final|Exec|Native|Private|Const) // @ game+0x193bba0
	void ShowItems(); // Function Prospect.YCheatManager.ShowItems // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void ShowCraftingMaterialsOfPlayer(struct FName UserId); // Function Prospect.YCheatManager.ShowCraftingMaterialsOfPlayer // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193d5e0
	void ShowCraftingMaterials(); // Function Prospect.YCheatManager.ShowCraftingMaterials // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void SetVolume(float Volume); // Function Prospect.YCheatManager.SetVolume // (Final|Exec|Native|Static|Private) // @ game+0x193d530
	void SetUnfocusedVolumeMultiplier(float Volume); // Function Prospect.YCheatManager.SetUnfocusedVolumeMultiplier // (Final|Exec|Native|Static|Private) // @ game+0x193d4b0
	void SetSelectedFaction(struct FString factionId); // Function Prospect.YCheatManager.SetSelectedFaction // (Final|Exec|Native|Private|Const) // @ game+0x193d3c0
	void SetMatchTimer(int32_t remainingSeconds); // Function Prospect.YCheatManager.SetMatchTimer // (Final|Exec|Native|Private|Const) // @ game+0x193d330
	void SetCraftingMaterialAmountOfPlayer(struct FName UserId, struct FName materialName, int32_t Amount); // Function Prospect.YCheatManager.SetCraftingMaterialAmountOfPlayer // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193d0e0
	void SetCraftingMaterialAmount(struct FName materialName, int32_t Amount); // Function Prospect.YCheatManager.SetCraftingMaterialAmount // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193d010
	void SetAllCraftingMaterialsAmountOfPlayer(struct FName UserId, int32_t Amount); // Function Prospect.YCheatManager.SetAllCraftingMaterialsAmountOfPlayer // (Final|Exec|Native|Private|HasOutParms|Const) // @ game+0x193d010
	void SetAllCraftingMaterialsAmount(int32_t Amount); // Function Prospect.YCheatManager.SetAllCraftingMaterialsAmount // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void SendTestAnalyticsEvent(); // Function Prospect.YCheatManager.SendTestAnalyticsEvent // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void Revive(); // Function Prospect.YCheatManager.Revive // (Final|Exec|Native|Private|Const) // @ game+0x193cff0
	void ResetSession(struct FName ServerId); // Function Prospect.YCheatManager.ResetSession // (Final|Exec|Native|Private|Const) // @ game+0x193bba0
	void ResetAllWaitingRooms(); // Function Prospect.YCheatManager.ResetAllWaitingRooms // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void RequestFriendsList(); // Function Prospect.YCheatManager.RequestFriendsList // (Final|Exec|Native|Private|Const) // @ game+0x193cfd0
	void RemoveItemFromPlayer(struct FName UserId, struct FName ItemId); // Function Prospect.YCheatManager.RemoveItemFromPlayer // (Final|Exec|Native|Private|Const) // @ game+0x193bc30
	void RemoveItem(struct FName ItemId); // Function Prospect.YCheatManager.RemoveItem // (Final|Exec|Native|Private|Const) // @ game+0x193bba0
	void RemoveAllItemsFromPlayer(struct FName UserId); // Function Prospect.YCheatManager.RemoveAllItemsFromPlayer // (Final|Exec|Native|Private|Const) // @ game+0x193bba0
	void RemoveAllItems(); // Function Prospect.YCheatManager.RemoveAllItems // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void PrintDebugStringToScreen(struct UObject* WorldContextObject, struct FString debugString); // Function Prospect.YCheatManager.PrintDebugStringToScreen // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x193ceb0
	void PrintAllDebugEvents(); // Function Prospect.YCheatManager.PrintAllDebugEvents // (Final|Exec|Native|Private) // @ game+0x193ce90
	void MakeUIScreenshot(struct FString ScreenshotName, struct FString subfoldername); // Function Prospect.YCheatManager.MakeUIScreenshot // (Final|Native|Private|BlueprintCallable|Const) // @ game+0x193be20
	void ListRooms(); // Function Prospect.YCheatManager.ListRooms // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void ListQueues(); // Function Prospect.YCheatManager.ListQueues // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void HealSelf(float healAmount); // Function Prospect.YCheatManager.HealSelf // (Final|Exec|Native|Private|BlueprintCallable) // @ game+0x193c600
	void ForceStartMatch(struct FString GameMode, bool isRanked, struct FString Region); // Function Prospect.YCheatManager.ForceStartMatch // (Final|Exec|Native|Static|Private) // @ game+0x193c4c0
	void FakeLoginResponse(int32_t code); // Function Prospect.YCheatManager.FakeLoginResponse // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void Execute(); // Function Prospect.YCheatManager.Execute // (Final|Exec|Native|Private|Const) // @ game+0x193c330
	void DebugSetForceShowPlayerMarkers(bool IsEnabled); // Function Prospect.YCheatManager.DebugSetForceShowPlayerMarkers // (Final|Exec|Native|Private|Const) // @ game+0x193c2a0
	void DebugPickupActorsInRange(int32_t Range); // Function Prospect.YCheatManager.DebugPickupActorsInRange // (Final|Exec|Native|Private|Const) // @ game+0x193c210
	void DebugMarkerForActorInRange(int32_t Range); // Function Prospect.YCheatManager.DebugMarkerForActorInRange // (Final|Exec|Native|Private|Const) // @ game+0x193c180
	void DebugGiveRankedSeasonRewards(); // Function Prospect.YCheatManager.DebugGiveRankedSeasonRewards // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void DebugCheckPastSeasonRewards(); // Function Prospect.YCheatManager.DebugCheckPastSeasonRewards // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void DBNO(); // Function Prospect.YCheatManager.DBNO // (Final|Exec|Native|Private) // @ game+0x193c0d0
	void DamageSelf(float DamageAmount); // Function Prospect.YCheatManager.DamageSelf // (Final|Exec|Native|Private|BlueprintCallable) // @ game+0x193c0f0
	void CrashMeNullptr(); // Function Prospect.YCheatManager.CrashMeNullptr // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void CrashMe(float Timer, struct FString Msg); // Function Prospect.YCheatManager.CrashMe // (Final|Exec|Native|Private) // @ game+0x193bfa0
	void BypassLoginScreen(); // Function Prospect.YCheatManager.BypassLoginScreen // (Final|Exec|Native|Private|Const) // @ game+0xfa96f0
	void BugReportTest(); // Function Prospect.YCheatManager.BugReportTest // (Final|Exec|Native|Static|Private) // @ game+0x191ac40
	void BugReport(struct FString Title, struct FString Description); // Function Prospect.YCheatManager.BugReport // (Final|Exec|Native|Private|Const) // @ game+0x193be20
	void AddItemToPlayer(struct FName UserId, struct FName ItemId); // Function Prospect.YCheatManager.AddItemToPlayer // (Final|Exec|Native|Private|Const) // @ game+0x193bc30
	void AddItem(struct FName ItemId); // Function Prospect.YCheatManager.AddItem // (Final|Exec|Native|Private|Const) // @ game+0x193bba0
};

// Class Prospect.YCheatReportingComponent
// Size: 0xb8 (Inherited: 0xb0)
struct UYCheatReportingComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)

	void OnPlayerStateChanged(enum class EYStateChangeType stateChange); // Function Prospect.YCheatReportingComponent.OnPlayerStateChanged // (Final|Native|Public) // @ game+0x19489f0
	void OnPickRandomTeleportingPlace(); // Function Prospect.YCheatReportingComponent.OnPickRandomTeleportingPlace // (Final|Native|Public) // @ game+0x19489d0
	void OnOwnerGotDamaged(struct FYDealtDamageData Data); // Function Prospect.YCheatReportingComponent.OnOwnerGotDamaged // (Final|Native|Public|HasOutParms) // @ game+0x19488e0
	void OnOwnerDealDamage(struct FYDealtDamageData Data); // Function Prospect.YCheatReportingComponent.OnOwnerDealDamage // (Final|Native|Public|HasOutParms) // @ game+0x19487f0
	void OnMatchFinishedResult(struct AYPlayerState* PlayerState); // Function Prospect.YCheatReportingComponent.OnMatchFinishedResult // (Final|Native|Public) // @ game+0x1948760
	void OnDeath(); // Function Prospect.YCheatReportingComponent.OnDeath // (Final|Native|Public) // @ game+0x1948740
};

// Class Prospect.YProjectile
// Size: 0x398 (Inherited: 0x240)
struct AYProjectile : AActor {
	struct UProjectileMovementComponent* m_movementComponent; // 0x240(0x08)
	struct USphereComponent* m_collisionComp; // 0x248(0x08)
	struct UParticleSystemComponent* m_particleComponent; // 0x250(0x08)
	struct FYProjectileInititalizationData m_initData; // 0x258(0xa8)
	char pad_300[0x9]; // 0x300(0x09)
	bool m_destroyOnImpact; // 0x309(0x01)
	char pad_30A[0x2]; // 0x30a(0x02)
	float m_traceBehindDistanceOffset; // 0x30c(0x04)
	struct FVector m_groundTraceLocation; // 0x310(0x0c)
	bool m_traceToFindGround; // 0x31c(0x01)
	bool m_drawTraceResult; // 0x31d(0x01)
	char pad_31E[0x6a]; // 0x31e(0x6a)
	bool m_isLockedOnHomingTarget; // 0x388(0x01)
	char pad_389[0x7]; // 0x389(0x07)
	struct UYWeaponTransportComponent* m_weaponTransportComponent; // 0x390(0x08)

	void OnRetraceCollisionHit(struct FHitResult HitResult); // Function Prospect.YProjectile.OnRetraceCollisionHit // (Final|Native|Protected|HasOutParms) // @ game+0x1a01810
	void OnRep_InitData(); // Function Prospect.YProjectile.OnRep_InitData // (Final|Native|Public) // @ game+0x1a01770
	void OnProjectileHitCollision(struct FHitResult HitResult); // Function Prospect.YProjectile.OnProjectileHitCollision // (Final|Native|Public|HasOutParms) // @ game+0x1a01690
	void OnProjectileBounce(struct FHitResult ImpactResult, struct FVector ImpactVelocity); // Function Prospect.YProjectile.OnProjectileBounce // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1a01560
	void OnIgnoreInstigatorOrOwnerActorsChanged(struct TArray<struct AActor*> newIgnoreActors); // Function Prospect.YProjectile.OnIgnoreInstigatorOrOwnerActorsChanged // (Final|Native|Protected|HasOutParms) // @ game+0x1a012c0
	void BP_OnInitialized(); // Function Prospect.YProjectile.BP_OnInitialized // (Event|Protected|BlueprintEvent) // @ game+0x1e02480
	void ArmProjectile(); // Function Prospect.YProjectile.ArmProjectile // (Final|Native|Public) // @ game+0x19fc710
};

// Class Prospect.YClientProjectile
// Size: 0x398 (Inherited: 0x398)
struct AYClientProjectile : AYProjectile {
};

// Class Prospect.YCommand_TopMenuButton_ChangeScreen
// Size: 0x40 (Inherited: 0x28)
struct UYCommand_TopMenuButton_ChangeScreen : UYScreenCommand {
	struct UYScreenBase* m_screenToTriggerBP; // 0x28(0x08)
	struct FDataTableRowHandle m_sceenChange; // 0x30(0x10)
};

// Class Prospect.YCommWheelAnalyticsComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYCommWheelAnalyticsComponent : UActorComponent {

	void OnSocialActorUse(struct FYSocialActorPlacedData Data); // Function Prospect.YCommWheelAnalyticsComponent.OnSocialActorUse // (Final|Native|Public) // @ game+0x194cef0
	void OnPawnSet(struct APawn* Pawn, struct APawn* newPawn); // Function Prospect.YCommWheelAnalyticsComponent.OnPawnSet // (Final|Native|Public) // @ game+0x194ce00
	void OnCommWheelUse(struct UYCommWheelVOComponent* commWheelUsed, struct FDataTableRowHandle commWheelEntry); // Function Prospect.YCommWheelAnalyticsComponent.OnCommWheelUse // (Final|Native|Public) // @ game+0x194cd20
};

// Class Prospect.YCommWheelVOComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UYCommWheelVOComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct FMulticastInlineDelegate BP_OnCommWheelUse; // 0xb8(0x10)
	struct FTimerHandle m_timerHandleReduceSpamCount; // 0xc8(0x08)
	struct FText m_spamMessage; // 0xd0(0x18)
	struct UDataTable* m_commWheelItemsDatatable; // 0xe8(0x08)

	void ReduceSpamMessageCount(); // Function Prospect.YCommWheelVOComponent.ReduceSpamMessageCount // (Final|Native|Private) // @ game+0x194cf90
};

// Class Prospect.YConditionLocationActor
// Size: 0x250 (Inherited: 0x240)
struct AYConditionLocationActor : AYActorWithMapCheck {
	struct FDataTableRowHandle m_rowHandle; // 0x240(0x10)
};

// Class Prospect.YConstantWidgetUpdateInterface
// Size: 0x28 (Inherited: 0x28)
struct UYConstantWidgetUpdateInterface : UInterface {

	void Show(); // Function Prospect.YConstantWidgetUpdateInterface.Show // (Native|Public) // @ game+0x194cfe0
	bool ShouldWidgetBeKeptAlive(); // Function Prospect.YConstantWidgetUpdateInterface.ShouldWidgetBeKeptAlive // (Native|Public) // @ game+0x194cfb0
	void OnRemoveWidget(); // Function Prospect.YConstantWidgetUpdateInterface.OnRemoveWidget // (Native|Public) // @ game+0x194ced0
	void InitializeFor(struct AActor* Actor); // Function Prospect.YConstantWidgetUpdateInterface.InitializeFor // (Native|Public) // @ game+0x194cc90
	void Hide(); // Function Prospect.YConstantWidgetUpdateInterface.Hide // (Native|Public) // @ game+0x194cc70
	void CalculateScore(float outScore, bool outForceShow); // Function Prospect.YConstantWidgetUpdateInterface.CalculateScore // (Native|Public|HasOutParms) // @ game+0x194c360
};

// Class Prospect.YContractActorInterface
// Size: 0x28 (Inherited: 0x28)
struct UYContractActorInterface : UInterface {

	struct FString GetDebugDescription(); // Function Prospect.YContractActorInterface.GetDebugDescription // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
};

// Class Prospect.YContractsManager
// Size: 0xf8 (Inherited: 0x28)
struct UYContractsManager : UObject {
	char pad_28[0xd0]; // 0x28(0xd0)
};

// Class Prospect.YContractsUtils
// Size: 0x28 (Inherited: 0x28)
struct UYContractsUtils : UObject {

	bool TryGetContractDataTableRowHandle(struct UObject* WorldContext, struct FYContractRow contractConfigData, struct FDataTableRowHandle contractRowHandle); // Function Prospect.YContractsUtils.TryGetContractDataTableRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x194d150
	bool TryGetContractConfigData(struct UObject* worldCtx, struct FString contractId, struct FYContractRow contractConfigData); // Function Prospect.YContractsUtils.TryGetContractConfigData // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x194d000
	bool GetIfPlayerHasAnActiveContractForFaction(struct APlayerController* Owner, enum class EYFaction faction); // Function Prospect.YContractsUtils.GetIfPlayerHasAnActiveContractForFaction // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x194cba0
	bool GetContractFaction(struct UObject* worldCtx, struct FString contractId, enum class EYFaction faction); // Function Prospect.YContractsUtils.GetContractFaction // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x194ca70
	enum class EYContractStatus GetActiveContractStatus(struct FYContractRow activeContractConfigData, struct TArray<int32_t> currentProgress); // Function Prospect.YContractsUtils.GetActiveContractStatus // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x194c950
	struct FText DetermineContractObjectiveDescription(struct UObject* WorldContext, struct FYContractObjective objective); // Function Prospect.YContractsUtils.DetermineContractObjectiveDescription // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x194c770
	bool ContractIsLockedDueToFactionProgressionNotBeingHighEnough(struct AActor* actorCtx, struct FString factionId, struct FYContractProgressionUnlockData progressionUnlockCollectionData); // Function Prospect.YContractsUtils.ContractIsLockedDueToFactionProgressionNotBeingHighEnough // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x194c640
	struct FText ContractDifficultyToText(enum class EYContractDifficulty contractDifficulty); // Function Prospect.YContractsUtils.ContractDifficultyToText // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x194c560
	bool ContractCanBePurchased(struct FYContractRow contractConfigData, struct UObject* objCtx); // Function Prospect.YContractsUtils.ContractCanBePurchased // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x194c450
};

// Class Prospect.YControllerAnnouncementComponent
// Size: 0x188 (Inherited: 0xb0)
struct UYControllerAnnouncementComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct UAudioComponent* m_audioAnnouncementComponent; // 0xb8(0x08)
	struct FMulticastInlineDelegate BP_OnAnnouncementStarted; // 0xc0(0x10)
	struct FMulticastInlineDelegate BP_OnAnnouncementStopped; // 0xd0(0x10)
	struct FYAnnouncementPlayEntryData m_currentAnnouncementPlaying; // 0xe0(0x48)
	struct TArray<struct FYAnnouncementPlayEntryData> m_queuedAnnouncements; // 0x128(0x10)
	char pad_138[0x50]; // 0x138(0x50)

	int32_t RetrieveAnnouncementPriority(struct FDataTableRowHandle rowHandle); // Function Prospect.YControllerAnnouncementComponent.RetrieveAnnouncementPriority // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1951f70
	void OnLoadedAudio(struct TArray<struct FSoftObjectPath> LoadedObjects, struct FYAnnouncementRequestAysncLoadData Data, float timestampStartedLoad); // Function Prospect.YControllerAnnouncementComponent.OnLoadedAudio // (Final|Native|Protected) // @ game+0x1950fc0
	bool AllowedToQueueAnnouncement(struct FDataTableRowHandle rowHandle); // Function Prospect.YControllerAnnouncementComponent.AllowedToQueueAnnouncement // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x194f960
};

// Class Prospect.YControllerBackendMissionComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYControllerBackendMissionComponent : UActorComponent {

	void OnMissionDataUpdated(struct FYMissionProgressionUpdated Data); // Function Prospect.YControllerBackendMissionComponent.OnMissionDataUpdated // (Final|Native|Protected|HasOutParms) // @ game+0x1951390
};

// Class Prospect.YControllerCharacterCustomizationPersistentComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UYControllerCharacterCustomizationPersistentComponent : UActorComponent {
	struct FMulticastInlineDelegate OnNewCustomizationDataDelegate; // 0xb0(0x10)
	struct FDataTableRowHandle m_pendingArchetypeSwitchRequestRow; // 0xc0(0x10)
	char pad_D0[0x10]; // 0xd0(0x10)

	void ServerRequestSetPersistentCharacterData(struct FYCharacterVanity newData); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.ServerRequestSetPersistentCharacterData // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x19522e0
	void ServerRequestSelectedCharacterVanityReset(enum class EYCharacterVanityResetRequest resetRequest); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.ServerRequestSelectedCharacterVanityReset // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x1952260
	void ServerRequestRandomizationCharacterCustomization(); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.ServerRequestRandomizationCharacterCustomization // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x1952240
	void ServerRequestCustomizationItemEquipped(struct FYUpdateBodyPartRequestData Data); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.ServerRequestCustomizationItemEquipped // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x19520f0
	void ServerRequestArchetypeId(struct FDataTableRowHandle archetypeRowHandle, int32_t requestcounter); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.ServerRequestArchetypeId // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x1952010
	void RequestSelectedCharacterVanityReset(enum class EYCharacterVanityResetRequest resetRequest); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.RequestSelectedCharacterVanityReset // (Final|Native|Public|BlueprintCallable) // @ game+0x1951ef0
	void RequestRandomizationCharacterCustomization(); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.RequestRandomizationCharacterCustomization // (Final|Native|Public|BlueprintCallable) // @ game+0x1951eb0
	void RequestCustomizationItemEquipped(struct FYUpdateBodyPartRequestData Data); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.RequestCustomizationItemEquipped // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1951d30
	void RequestConfirmCharacterCustomization(); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.RequestConfirmCharacterCustomization // (Final|Native|Public|BlueprintCallable) // @ game+0x1951d10
	void RequestArchetypeId(struct FDataTableRowHandle archetypeRowHandle, int32_t requestcounter); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.RequestArchetypeId // (Final|Native|Public|BlueprintCallable) // @ game+0x1951c30
	void OnStateCustomizationDataChanged(struct FYActiveCustomizationData oldData, struct FYActiveCustomizationData newData, bool forceRefresh); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.OnStateCustomizationDataChanged // (Final|Native|Protected) // @ game+0x1951a00
	void OnCustomizationModelDataChanged(enum class EYCustomizationModelType Type); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.OnCustomizationModelDataChanged // (Final|Native|Protected) // @ game+0x1950f20
	void InitializeCustomization(); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.InitializeCustomization // (Final|Native|Protected) // @ game+0x1950ee0
	struct UYControllerCharacterCustomizationPersistentComponent* FindControllerCharacterCustomizationPersistentComponent(struct UObject* objCtx); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.FindControllerCharacterCustomizationPersistentComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x194feb0
	void ClientCompletedAsyncRequest(int32_t requestcounter); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.ClientCompletedAsyncRequest // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x194fb20
	bool CalculateActiveCustomizationData(struct FYActiveCustomizationData outData, enum class EYCustomizationModelType modelType); // Function Prospect.YControllerCharacterCustomizationPersistentComponent.CalculateActiveCustomizationData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x194fa00
};

// Class Prospect.YControllerCharacterCustomizationTemporaryComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYControllerCharacterCustomizationTemporaryComponent : UActorComponent {

	void RequestResetData(); // Function Prospect.YControllerCharacterCustomizationTemporaryComponent.RequestResetData // (Final|Native|Public|BlueprintCallable) // @ game+0x1951ed0
	void RequestCustomizationItemShow(struct FYUpdateBodyPartRequestData Data); // Function Prospect.YControllerCharacterCustomizationTemporaryComponent.RequestCustomizationItemShow // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1951df0
	struct UYControllerCharacterCustomizationTemporaryComponent* FindControllerCharacterCustomizationTemporaryComponent(struct UObject* objCtx); // Function Prospect.YControllerCharacterCustomizationTemporaryComponent.FindControllerCharacterCustomizationTemporaryComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x194ff40
};

// Class Prospect.YControllerChatComponent
// Size: 0x148 (Inherited: 0xb0)
struct UYControllerChatComponent : UActorComponent {
	struct FMulticastInlineDelegate OnMutedStateChanged; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnChannelTypeChanged; // 0xc0(0x10)
	char pad_D0[0x78]; // 0xd0(0x78)

	void OnSquadMembersUpdated(struct TArray<struct FYOutpostFriendInfo> squadMembers); // Function Prospect.YControllerChatComponent.OnSquadMembersUpdated // (Final|Native|Protected|HasOutParms) // @ game+0x1951860
	void OnRefreshActiveChannels(); // Function Prospect.YControllerChatComponent.OnRefreshActiveChannels // (Final|Native|Protected) // @ game+0x1951690
	void OnPlayerStateSet(); // Function Prospect.YControllerChatComponent.OnPlayerStateSet // (Final|Native|Protected) // @ game+0x1951670
	void OnPlayerMatchStateChanged(enum class EYPlayerMatchState State, struct AYPlayerState* PlayerState); // Function Prospect.YControllerChatComponent.OnPlayerMatchStateChanged // (Final|Native|Protected) // @ game+0x19515a0
	void OnMessageGotFromBackend(int32_t Duration, enum class EYMuteReason Reason); // Function Prospect.YControllerChatComponent.OnMessageGotFromBackend // (Final|Native|Protected) // @ game+0x19512c0
	void OnLoginResult(enum class EYLoginResult loginResult); // Function Prospect.YControllerChatComponent.OnLoginResult // (Final|Native|Protected) // @ game+0x1951240
	void OnLanguageChanged(); // Function Prospect.YControllerChatComponent.OnLanguageChanged // (Final|Native|Protected) // @ game+0x1950fa0
	void OnClearMutingTimeout(); // Function Prospect.YControllerChatComponent.OnClearMutingTimeout // (Final|Native|Protected) // @ game+0x1950f00
	bool FindLastMessageFromChannel(struct AActor* actorContext, enum class EYChannelType Type, int32_t previousMessageCount, struct FYChatHistoryEntry outData); // Function Prospect.YControllerChatComponent.FindLastMessageFromChannel // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x194ffd0
};

// Class Prospect.YControllerContractsActivesDataComponent
// Size: 0x118 (Inherited: 0xb0)
struct UYControllerContractsActivesDataComponent : UActorComponent {
	struct FMulticastInlineDelegate OnContractStatusChanged; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnActiveContractsProgressUpdated; // 0xc0(0x10)
	struct FMulticastInlineDelegate BP_OnDeadDropResult; // 0xd0(0x10)
	struct FYActiveContractsUIData m_activeContractsUIData; // 0xe0(0x10)
	struct FYContractsProgress m_contractsBackendProgressClamp; // 0xf0(0x10)
	struct FYContractsProgress m_contractsCurrentProgressClamp; // 0x100(0x10)
	char pad_110[0x8]; // 0x110(0x08)

	void TryConsumeDeadDropItems(struct AActor* deadDropActor); // Function Prospect.YControllerContractsActivesDataComponent.TryConsumeDeadDropItems // (Final|Native|Public|BlueprintCallable) // @ game+0x19526e0
	void TrackerProgressUpdate(struct FYContractsProgress newData); // Function Prospect.YControllerContractsActivesDataComponent.TrackerProgressUpdate // (Final|Native|Private|HasOutParms) // @ game+0x1952600
	void SetupActiveContractsTutorial(struct TArray<struct FYActiveContractInitData> activeContracts); // Function Prospect.YControllerContractsActivesDataComponent.SetupActiveContractsTutorial // (Final|Native|Public|BlueprintCallable) // @ game+0x19524f0
	void ServerTryConsumeDeadDropItems(struct AActor* deadDropActor); // Function Prospect.YControllerContractsActivesDataComponent.ServerTryConsumeDeadDropItems // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1952430
	void ServerRequestPlayerActiveContracts(struct FString UserId); // Function Prospect.YControllerContractsActivesDataComponent.ServerRequestPlayerActiveContracts // (Net|Native|Event|Public|NetServer) // @ game+0x19521a0
	void OnRep_ContractsCurrentProgressClamp(struct FYContractsProgress contractsCurrentProgressClamp); // Function Prospect.YControllerContractsActivesDataComponent.OnRep_ContractsCurrentProgressClamp // (Final|Native|Private|HasOutParms|Const) // @ game+0x1951780
	void OnRep_ActiveContractsUIData(struct FYActiveContractsUIData activeContractsUIData); // Function Prospect.YControllerContractsActivesDataComponent.OnRep_ActiveContractsUIData // (Final|Native|Private|HasOutParms|Const) // @ game+0x19516b0
	void OnPlayerFinishedMatch(enum class EYPlayerMatchFinishedResult newState); // Function Prospect.YControllerContractsActivesDataComponent.OnPlayerFinishedMatch // (Final|Native|Private) // @ game+0x1951520
	void HandlePlayerContractClaimFail(struct FString UserId, struct FString contractId, enum class EYClaimContractRewardsStatus contractRewardsStatus); // Function Prospect.YControllerContractsActivesDataComponent.HandlePlayerContractClaimFail // (Final|Native|Private) // @ game+0x19509a0
	void HandlePlayerContractClaimed(struct FYClaimedContractBackendData claimedContractBackendData); // Function Prospect.YControllerContractsActivesDataComponent.HandlePlayerContractClaimed // (Final|Native|Private|HasOutParms) // @ game+0x1950c20
	void HandlePlayerContractCancelled(struct FString UserId, struct FString contractThatHasJustBeenCanceledId); // Function Prospect.YControllerContractsActivesDataComponent.HandlePlayerContractCancelled // (Final|Native|Private) // @ game+0x19507a0
	void HandlePlayerContractActivated(struct FYActiveContractInitData activeContractInitData); // Function Prospect.YControllerContractsActivesDataComponent.HandlePlayerContractActivated // (Final|Native|Private|HasOutParms) // @ game+0x1950600
	void HandlePlayerActiveContractsReceived(struct FYActiveContractsInitData activeContractsInit); // Function Prospect.YControllerContractsActivesDataComponent.HandlePlayerActiveContractsReceived // (Final|Native|Private|HasOutParms) // @ game+0x1950500
	bool GetIsContractDataFullySetup(); // Function Prospect.YControllerContractsActivesDataComponent.GetIsContractDataFullySetup // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x1950440
	struct FYContractsProgress GetCachedBackendProgressClamped(); // Function Prospect.YControllerContractsActivesDataComponent.GetCachedBackendProgressClamped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19503c0
	struct FYActiveContractsUIData GetCachedActiveContractsUIData(); // Function Prospect.YControllerContractsActivesDataComponent.GetCachedActiveContractsUIData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19502e0
	struct FYContractsProgress GetCachedActiveContractsProgressClamped(); // Function Prospect.YControllerContractsActivesDataComponent.GetCachedActiveContractsProgressClamped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1950290
	bool GetCachedActiveContractProgressClamped(struct FString contractId, struct FYContractProgress activeContractCurrentProgressClamp); // Function Prospect.YControllerContractsActivesDataComponent.GetCachedActiveContractProgressClamped // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1950160
	struct UYControllerContractsActivesDataComponent* FindContractsActivesDataCompChecked(struct AActor* actorContext); // Function Prospect.YControllerContractsActivesDataComponent.FindContractsActivesDataCompChecked // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x194fd90
	struct UYControllerContractsActivesDataComponent* FindContractsActivesDataComp(struct AActor* actorContext); // Function Prospect.YControllerContractsActivesDataComponent.FindContractsActivesDataComp // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x194fd90
	void ClientDeadDropDepositResult(enum class EYDeadDropDepositResult Result); // Function Prospect.YControllerContractsActivesDataComponent.ClientDeadDropDepositResult // (Net|NetReliableNative|Event|Public|NetClient|NetValidate) // @ game+0x194fbb0
	void ActivesStateUpdate(struct FYActiveContractsUIData newData); // Function Prospect.YControllerContractsActivesDataComponent.ActivesStateUpdate // (Final|Native|Private|HasOutParms) // @ game+0x194f890
};

// Class Prospect.YControllerContractsBoardsDataComponent
// Size: 0x130 (Inherited: 0xb0)
struct UYControllerContractsBoardsDataComponent : UActorComponent {
	char pad_B0[0x20]; // 0xb0(0x20)
	struct FMulticastInlineDelegate OnBackendContractStatusChangeResponseReceived; // 0xd0(0x10)
	char pad_E0[0x50]; // 0xe0(0x50)

	void UpdateCachedBoardDataLockedState(struct FYPlayerFactionProgressionUIData playerFactionProgressionUIData); // Function Prospect.YControllerContractsBoardsDataComponent.UpdateCachedBoardDataLockedState // (Final|Native|Private|HasOutParms) // @ game+0x1952770
	void HandlePlayerContractsReceived(struct FYPlayerContractsInitData playerContractsInitData); // Function Prospect.YControllerContractsBoardsDataComponent.HandlePlayerContractsReceived // (Final|Native|Private|HasOutParms) // @ game+0x1950dc0
	void HandlePlayerContractClaimFail(struct FString UserId, struct FString contractId, enum class EYClaimContractRewardsStatus contractRewardsStatus); // Function Prospect.YControllerContractsBoardsDataComponent.HandlePlayerContractClaimFail // (Final|Native|Private) // @ game+0x1950ae0
	void HandlePlayerContractClaimed(struct FYClaimedContractBackendData claimedContractBackendData); // Function Prospect.YControllerContractsBoardsDataComponent.HandlePlayerContractClaimed // (Final|Native|Private|HasOutParms) // @ game+0x1950cf0
	void HandlePlayerContractCancelled(struct FString UserId, struct FString contractThatHasJustBeenCanceledId); // Function Prospect.YControllerContractsBoardsDataComponent.HandlePlayerContractCancelled // (Final|Native|Private) // @ game+0x19508a0
	void HandlePlayerContractActivated(struct FYActiveContractInitData activeContractInitData); // Function Prospect.YControllerContractsBoardsDataComponent.HandlePlayerContractActivated // (Final|Native|Private|HasOutParms) // @ game+0x19506d0
	void HandleBoardsContractsSettingsReceived(struct FYHoursAndMinutes refreshoursAndMinutesUtc); // Function Prospect.YControllerContractsBoardsDataComponent.HandleBoardsContractsSettingsReceived // (Final|Native|Private|HasOutParms) // @ game+0x1950460
	bool GetIfWaitingForBackendToReply(); // Function Prospect.YControllerContractsBoardsDataComponent.GetIfWaitingForBackendToReply // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1950410
	struct UYControllerContractsBoardsDataComponent* FindContractsBoardsDataComponentChecked(struct AActor* actorContext); // Function Prospect.YControllerContractsBoardsDataComponent.FindContractsBoardsDataComponentChecked // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x194fe20
	struct UYControllerContractsBoardsDataComponent* FindContractsBoardsDataComponent(struct AActor* actorContext); // Function Prospect.YControllerContractsBoardsDataComponent.FindContractsBoardsDataComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x194fe20
	void EnableContractInteractionAgain(struct FString callerUserId, bool isFail, bool anActiveContractHasBeenCancelled); // Function Prospect.YControllerContractsBoardsDataComponent.EnableContractInteractionAgain // (Final|Native|Private) // @ game+0x194fc60
};

// Class Prospect.YControllerContractsCheatsComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYControllerContractsCheatsComponent : UActorComponent {

	void ServerRequestPlayerActiveContracts(struct FString UserId, bool debugCall); // Function Prospect.YControllerContractsCheatsComponent.ServerRequestPlayerActiveContracts // (Net|Native|Event|Public|NetServer) // @ game+0x1955ee0
	void ServerDebugSetActiveContractProgress(struct FString UserId, struct FString contractId, int32_t objectiveIndex, int32_t newProgress); // Function Prospect.YControllerContractsCheatsComponent.ServerDebugSetActiveContractProgress // (Net|Native|Event|Public|NetServer) // @ game+0x1955c80
	void ServerDebugRemoveAllActiveContracts(struct FString UserId); // Function Prospect.YControllerContractsCheatsComponent.ServerDebugRemoveAllActiveContracts // (Net|Native|Event|Public|NetServer) // @ game+0x1955be0
	void ServerDebugGivePlayerContractRewards(struct FString UserId, struct FString contractId); // Function Prospect.YControllerContractsCheatsComponent.ServerDebugGivePlayerContractRewards // (Net|Native|Event|Public|NetServer) // @ game+0x1955ae0
	void ServerDebugActivateContractByRowName(struct FString UserId, struct FString contractId); // Function Prospect.YControllerContractsCheatsComponent.ServerDebugActivateContractByRowName // (Net|Native|Event|Public|NetServer) // @ game+0x19559e0
	struct UYControllerContractsCheatsComponent* FindContractsCheatComponentChecked(struct AActor* actorContext); // Function Prospect.YControllerContractsCheatsComponent.FindContractsCheatComponentChecked // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x19548e0
	struct UYControllerContractsCheatsComponent* FindContractsCheatComponent(struct AActor* actorContext); // Function Prospect.YControllerContractsCheatsComponent.FindContractsCheatComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x19548e0
	void DebugHandleActiveContractNewProgressReceived(struct FString UserId, struct FString activeContractId, int32_t objectiveIndex, int32_t newProgress); // Function Prospect.YControllerContractsCheatsComponent.DebugHandleActiveContractNewProgressReceived // (Final|Native|Private) // @ game+0x1954620
};

// Class Prospect.YControllerCraftingComponent
// Size: 0x148 (Inherited: 0xb0)
struct UYControllerCraftingComponent : UActorComponent {
	char pad_B0[0x10]; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnItemScrapped; // 0xc0(0x10)
	char pad_D0[0x78]; // 0xd0(0x78)

	void SetCraftingInProgress(struct FString UserId, struct FYCraftingInProgressData craftingInProgressData); // Function Prospect.YControllerCraftingComponent.SetCraftingInProgress // (Final|Native|Private|HasOutParms) // @ game+0x1956350
	void ScrapItem(struct TArray<struct FString> idsToScrap, struct FName factionId); // Function Prospect.YControllerCraftingComponent.ScrapItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x19558b0
	void PurchaseItem(struct FYShopItem shopItem, int32_t repeatTimes); // Function Prospect.YControllerCraftingComponent.PurchaseItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1955520
	void OnItemScrappedResult(struct FString Error); // Function Prospect.YControllerCraftingComponent.OnItemScrappedResult // (Final|Native|Private) // @ game+0x19553c0
	bool IsCraftingInProgress(); // Function Prospect.YControllerCraftingComponent.IsCraftingInProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1955080
	int32_t GetRemainingSeconds(); // Function Prospect.YControllerCraftingComponent.GetRemainingSeconds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1954e90
	struct FYShopItem GetItemBeingCrafted(); // Function Prospect.YControllerCraftingComponent.GetItemBeingCrafted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1954e00
	struct UYControllerCraftingComponent* FindCraftingComponentChecked(struct AActor* actorContext); // Function Prospect.YControllerCraftingComponent.FindCraftingComponentChecked // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1954970
	struct UYControllerCraftingComponent* FindCraftingComponent(struct AActor* actorContext); // Function Prospect.YControllerCraftingComponent.FindCraftingComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1954970
	void BackendResponseReceivedForItemPurchased(enum class EYPurchaseWeaponShopItemStatus Status); // Function Prospect.YControllerCraftingComponent.BackendResponseReceivedForItemPurchased // (Final|Native|Private) // @ game+0x19545a0
	void BackendResponseReceivedForItemCraftingStarted(enum class EYStartItemCraftingResultStatus Status); // Function Prospect.YControllerCraftingComponent.BackendResponseReceivedForItemCraftingStarted // (Final|Native|Private) // @ game+0x1954520
	void BackendResponseReceivedForItemCrafted(enum class EYClaimCraftedItemStatus Status); // Function Prospect.YControllerCraftingComponent.BackendResponseReceivedForItemCrafted // (Final|Native|Private) // @ game+0x19544a0
	void BackendClaimedItemReceived(struct FYCraftedBlueprintInfo craftedBlueprintInfo); // Function Prospect.YControllerCraftingComponent.BackendClaimedItemReceived // (Final|Native|Private|HasOutParms) // @ game+0x19543b0
};

// Class Prospect.YControllerCustomizationComponent
// Size: 0x148 (Inherited: 0xb0)
struct UYControllerCustomizationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnRequestCustomizationPartChange; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnSelectedNewCustomizationRowHandle; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnTemporaryShowCustomizationEntryUpdateDelegate; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnNewCustomizatonData; // 0xe0(0x10)
	struct FMulticastInlineDelegate OnResetRequest; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnRequestRotationState; // 0x100(0x10)
	struct FMulticastInlineDelegate OnRequestWeaponVanityTemporaryVisualization; // 0x110(0x10)
	struct FMulticastInlineDelegate OnWeaponCustomizationSetWeapon; // 0x120(0x10)
	struct FMulticastInlineDelegate OnGlobalVanityDataChanged; // 0x130(0x10)
	char pad_140[0x8]; // 0x140(0x08)

	void TryRetriveBackendGlobalVanityData(struct FString UserId); // Function Prospect.YControllerCustomizationComponent.TryRetriveBackendGlobalVanityData // (Final|Native|Protected) // @ game+0x19566f0
	void ServerRequestUpdateVanityAmount(struct FString vanityId, int32_t Amount); // Function Prospect.YControllerCustomizationComponent.ServerRequestUpdateVanityAmount // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x19561b0
	void ServerRequestSetVanityOnCustomItem(struct FString customItemID, struct FString vanityItemID, enum class EYVanityType vanityType); // Function Prospect.YControllerCustomizationComponent.ServerRequestSetVanityOnCustomItem // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1956070
	void ServerRequestRemoveVanity(struct FString vanityId); // Function Prospect.YControllerCustomizationComponent.ServerRequestRemoveVanity // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1955fd0
	void ServerRequestGlobalVanityUpdated(struct FDataTableRowHandle rowHandle, int32_t slotId); // Function Prospect.YControllerCustomizationComponent.ServerRequestGlobalVanityUpdated // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1955e00
	void RequestWeaponVanityTemporaryVisualization(struct FDataTableRowHandle Handle, bool shouldShow, bool overrideOtherVanity); // Function Prospect.YControllerCustomizationComponent.RequestWeaponVanityTemporaryVisualization // (Final|Native|Public) // @ game+0x1955790
	void RequestCustomizationCategorySlotVisualized(enum class EYCustomizationCategory customizationCategory); // Function Prospect.YControllerCustomizationComponent.RequestCustomizationCategorySlotVisualized // (Final|Native|Public|BlueprintCallable) // @ game+0x1955670
	void OnGlobalVanityDataAvailable(struct FYGlobalVanityData Data); // Function Prospect.YControllerCustomizationComponent.OnGlobalVanityDataAvailable // (Final|Native|Protected|HasOutParms) // @ game+0x1955210
	void InitializeCustomization(); // Function Prospect.YControllerCustomizationComponent.InitializeCustomization // (Final|Native|Protected) // @ game+0x1955060
	struct UYControllerCustomizationComponent* FindCustomizationComponent(struct AActor* actorContext); // Function Prospect.YControllerCustomizationComponent.FindCustomizationComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1954a00
};

// Class Prospect.YControllerCustomizationPreviewComponent
// Size: 0x120 (Inherited: 0xb0)
struct UYControllerCustomizationPreviewComponent : UActorComponent {
	struct FMulticastInlineDelegate OnCustomizationModeChangedDelegate; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnRotationModeChanged; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnWorldLocationChanged; // 0xd0(0x10)
	struct FYControllerCustomizationState m_state; // 0xe0(0x40)

	void SetWorldSpaceCustomizationLocation(struct UObject* objCtx, struct FTransform Location); // Function Prospect.YControllerCustomizationPreviewComponent.SetWorldSpaceCustomizationLocation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x19565e0
	void SetCustomizationModeStatic(struct UObject* objCtx, enum class EYCustomizationMode Mode, bool rotationEnabled); // Function Prospect.YControllerCustomizationPreviewComponent.SetCustomizationModeStatic // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1956450
	void SetCharacterCustomizationCategoryPreview(struct UObject* objCtx, enum class EYCustomizationCategory Category); // Function Prospect.YControllerCustomizationPreviewComponent.SetCharacterCustomizationCategoryPreview // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1956290
	void OnSceneAddedCallback(struct FDataTableRowHandle sceneRowHandle); // Function Prospect.YControllerCustomizationPreviewComponent.OnSceneAddedCallback // (Final|Native|Protected) // @ game+0x1955480
	void OnCustomizationModeActorsChanged(enum class EYCustomizationMode modeChange, bool stored); // Function Prospect.YControllerCustomizationPreviewComponent.OnCustomizationModeActorsChanged // (Final|Native|Protected) // @ game+0x1955140
	void OnActiveCameraActorStateChanged(struct AActor* relevantActor); // Function Prospect.YControllerCustomizationPreviewComponent.OnActiveCameraActorStateChanged // (Final|Native|Protected) // @ game+0x19550b0
	void HandleOnCustomizationCategoryChanged(enum class EYCustomizationCategory newCategory, enum class EYCustomizationMode Mode); // Function Prospect.YControllerCustomizationPreviewComponent.HandleOnCustomizationCategoryChanged // (Final|Native|Protected) // @ game+0x1954f90
	void HandleCustomizationModeStateChanged(enum class EYCustomizationMode Mode, bool IsActive); // Function Prospect.YControllerCustomizationPreviewComponent.HandleCustomizationModeStateChanged // (Final|Native|Protected) // @ game+0x1954ec0
	struct FYControllerCustomizationState GetCustomizationState(struct UObject* objCtx); // Function Prospect.YControllerCustomizationPreviewComponent.GetCustomizationState // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1954d20
	struct UYControllerCustomizationPreviewComponent* FindCustomizationPreviewComponent(struct UObject* objCtx); // Function Prospect.YControllerCustomizationPreviewComponent.FindCustomizationPreviewComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1954a90
};

// Class Prospect.YControllerCustomizationRotationComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UYControllerCustomizationRotationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnRotationDeltaDelegate; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnRotationResetDelegate; // 0xc0(0x10)
	char pad_D0[0x10]; // 0xd0(0x10)

	void SetEnableRotationMode(bool RotationMode); // Function Prospect.YControllerCustomizationRotationComponent.SetEnableRotationMode // (Final|Native|Public|BlueprintCallable) // @ game+0x1956550
	void RequestResetRotation(struct FString Context); // Function Prospect.YControllerCustomizationRotationComponent.RequestResetRotation // (Final|Native|Public|BlueprintCallable) // @ game+0x19556f0
	struct UYControllerCustomizationRotationComponent* FindCustomizationRotationComponent(struct UObject* objCtx); // Function Prospect.YControllerCustomizationRotationComponent.FindCustomizationRotationComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1954b20
};

// Class Prospect.YControllerDropComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UYControllerDropComponent : UActorComponent {
	struct FMulticastInlineDelegate OnDropStateChanged; // 0xb0(0x10)
	struct FYDragStateData m_currentState; // 0xc0(0x10)

	struct UYControllerDropComponent* FindDropComponent(struct AActor* actorContext); // Function Prospect.YControllerDropComponent.FindDropComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1954c90
	bool FindDragStateData(struct AActor* actorContext, struct FYDragStateData outData); // Function Prospect.YControllerDropComponent.FindDragStateData // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1954bb0
	void EnableDragging(struct AActor* actorContext, struct UDragDropOperation* Payload); // Function Prospect.YControllerDropComponent.EnableDragging // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1954820
	void DisableDragging(struct AActor* actorContext); // Function Prospect.YControllerDropComponent.DisableDragging // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19547a0
};

// Class Prospect.YControllerHeatMapComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UYControllerHeatMapComponent : UActorComponent {
	struct TArray<struct FYHeatMapReplicatedData> m_replicatedHeatMapData; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnDataUpdated; // 0xc0(0x10)
	char pad_D0[0x8]; // 0xd0(0x08)

	void OnRep_UpdateRelevantData(); // Function Prospect.YControllerHeatMapComponent.OnRep_UpdateRelevantData // (Final|Native|Protected) // @ game+0x1955460
};

// Class Prospect.YControllerInventoryAbilityComponent
// Size: 0x148 (Inherited: 0xb0)
struct UYControllerInventoryAbilityComponent : UActorComponent {
	struct FDataTableRowHandle m_emptyAbility; // 0xb0(0x10)
	struct TArray<struct UYCharacterAbilityComponent*> m_runtimeAbilityComponents; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnAbilityEquipped; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnAbilityUnequipped; // 0xe0(0x10)
	struct FMulticastInlineDelegate OnAbilityActivated; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnControllerAbilityConsumed; // 0x100(0x10)
	struct FMulticastInlineDelegate OnSelectedConsumableChanged; // 0x110(0x10)
	struct FMulticastInlineDelegate OnAbilityComponentsChanged; // 0x120(0x10)
	struct FMulticastInlineDelegate OnAbilityDropped; // 0x130(0x10)
	struct UYCharacterAbilityComponent* m_activeAbilityComponent; // 0x140(0x08)

	void OnRep_OnAbilityComponents(); // Function Prospect.YControllerInventoryAbilityComponent.OnRep_OnAbilityComponents // (Final|Native|Protected) // @ game+0x1959ec0
	void OnAbilityConsumedByUse(struct UYCharacterAbilityComponent* activatedComponent); // Function Prospect.YControllerInventoryAbilityComponent.OnAbilityConsumedByUse // (Final|Native|Protected) // @ game+0x1959d80
	struct UYCharacterAbilityComponent* CreateNewAbilityComponent(struct FYInventoryItem inventoryItem); // Function Prospect.YControllerInventoryAbilityComponent.CreateNewAbilityComponent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1959360
};

// Class Prospect.YControllerInventoryBackendComponent
// Size: 0x168 (Inherited: 0xb0)
struct UYControllerInventoryBackendComponent : UActorComponent {
	struct FMulticastInlineDelegate OnInventoryInitializationCompletedDelegate; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnEndOfMatchDataAvailable; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnCompleteInventoryRequestDelegate; // 0xd0(0x10)
	struct UYBackendInventoryModel* m_backendInventoryModel; // 0xe0(0x08)
	struct FYEomInventoryData m_endOfMatchData; // 0xe8(0x78)
	char pad_160[0x8]; // 0x160(0x08)

	bool TryGetEndOfMatchData(struct FYEomInventoryData outData); // Function Prospect.YControllerInventoryBackendComponent.TryGetEndOfMatchData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x195c0f0
	void ServerSendInventoryToBackend(struct FYNetPlayerInventoryUpdate inventoryUpdates, struct FYNetPlayerInventoryUpdate stashUpdates, struct FYPlayerDataSet playerSet, enum class EYCompleteInventoryUpdateReason Reason); // Function Prospect.YControllerInventoryBackendComponent.ServerSendInventoryToBackend // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0x195aa40
	void OnRep_EndOfMatchUpdates(); // Function Prospect.YControllerInventoryBackendComponent.OnRep_EndOfMatchUpdates // (Final|Native|Private) // @ game+0x1959ea0
	bool IsInitialized(); // Function Prospect.YControllerInventoryBackendComponent.IsInitialized // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1959c10
	void InitializeInventory(); // Function Prospect.YControllerInventoryBackendComponent.InitializeInventory // (Final|Native|Private) // @ game+0x1959bf0
	void HandleOnInventoryInitialized(); // Function Prospect.YControllerInventoryBackendComponent.HandleOnInventoryInitialized // (Final|Native|Private) // @ game+0x1959a70
	void HandleOnInventoryDataUpdated(struct TArray<enum class EYInventoryPlayerTypes> changed); // Function Prospect.YControllerInventoryBackendComponent.HandleOnInventoryDataUpdated // (Final|Native|Private) // @ game+0x1959980
	void HandleOnEndOfMatchDataChanged(); // Function Prospect.YControllerInventoryBackendComponent.HandleOnEndOfMatchDataChanged // (Final|Native|Private) // @ game+0x1959960
	void HandleOnBackendInventoryChanged(); // Function Prospect.YControllerInventoryBackendComponent.HandleOnBackendInventoryChanged // (Final|Native|Private) // @ game+0x1959940
};

// Class Prospect.YControllerInventoryInsuranceComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UYControllerInventoryInsuranceComponent : UActorComponent {
	struct FMulticastInlineDelegate OnActiveInsuranceUpdated; // 0xb0(0x10)
	struct FDataTableRowHandle m_pendingInsuranceForLoadout; // 0xc0(0x10)
	struct FYActiveInventoryInsurance m_activeInsurance; // 0xd0(0x20)

	void SetPendingInsuranceForLoadout(struct FDataTableRowHandle insuranceRowHandle); // Function Prospect.YControllerInventoryInsuranceComponent.SetPendingInsuranceForLoadout // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x195b580
	void RemoveItemFromPendingInsurance(struct FDataTableRowHandle insuranceRowHandle, struct FString ItemId); // Function Prospect.YControllerInventoryInsuranceComponent.RemoveItemFromPendingInsurance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1959f80
	void RemoveAllItemsFromPendingInsurance(struct FDataTableRowHandle insuranceRowHandle); // Function Prospect.YControllerInventoryInsuranceComponent.RemoveAllItemsFromPendingInsurance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1959ee0
	void OnRep_ActiveInsurance(); // Function Prospect.YControllerInventoryInsuranceComponent.OnRep_ActiveInsurance // (Final|Native|Private) // @ game+0x1916ed0
	bool HasPendingInsurance(); // Function Prospect.YControllerInventoryInsuranceComponent.HasPendingInsurance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1959b70
	bool HasInsurance(); // Function Prospect.YControllerInventoryInsuranceComponent.HasInsurance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1959b40
	void HandleOnPlayerSetUpdated(struct UYStateInventoryComponent* stateInventoryComponent); // Function Prospect.YControllerInventoryInsuranceComponent.HandleOnPlayerSetUpdated // (Final|Native|Private) // @ game+0x1959ab0
	void HandleOnInventoryInitialized(); // Function Prospect.YControllerInventoryInsuranceComponent.HandleOnInventoryInitialized // (Final|Native|Private) // @ game+0x1959a90
	enum class EYInsuranceStatus GetItemInsuranceStatus(struct FString ItemId); // Function Prospect.YControllerInventoryInsuranceComponent.GetItemInsuranceStatus // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1959760
	struct FYActiveInventoryInsurance GetActiveInsurance(); // Function Prospect.YControllerInventoryInsuranceComponent.GetActiveInsurance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x19596f0
	void ClearPendingInsuranceFromLoadout(); // Function Prospect.YControllerInventoryInsuranceComponent.ClearPendingInsuranceFromLoadout // (Final|Native|Public|BlueprintCallable) // @ game+0x19592b0
	bool CanItemBeInsured(struct FYInventoryItem Item); // Function Prospect.YControllerInventoryInsuranceComponent.CanItemBeInsured // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x19591a0
	struct FYInventoryInsuranceOffer CalculatePendingInsuranceOffer(); // Function Prospect.YControllerInventoryInsuranceComponent.CalculatePendingInsuranceOffer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1959160
	int32_t CalculateInsurancePayout(); // Function Prospect.YControllerInventoryInsuranceComponent.CalculateInsurancePayout // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1959130
	void AddItemToPendingInsurance(struct FDataTableRowHandle insuranceRowHandle, struct FString ItemId); // Function Prospect.YControllerInventoryInsuranceComponent.AddItemToPendingInsurance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1959030
	void AddAllItemsToPendingInsurance(struct FDataTableRowHandle insuranceRowHandle); // Function Prospect.YControllerInventoryInsuranceComponent.AddAllItemsToPendingInsurance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1958f90
};

// Class Prospect.YControllerInventoryInteractionComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UYControllerInventoryInteractionComponent : UActorComponent {
	char pad_B0[0x10]; // 0xb0(0x10)
	struct AActor* m_interactingActorContext; // 0xc0(0x08)
	struct UYStateInventoryComponent* m_interactingInventoryComponent; // 0xc8(0x08)

	void SetPlayerInventory(struct FYPlayerInventory Inventory); // Function Prospect.YControllerInventoryInteractionComponent.SetPlayerInventory // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x195b620
	void OnInventoryStateDeactivatedCallback(bool bWasInterrupted); // Function Prospect.YControllerInventoryInteractionComponent.OnInventoryStateDeactivatedCallback // (Final|Native|Public) // @ game+0x1959e10
	void OnInventoryClosed__DelegateSignature(struct UYControllerInventoryInteractionComponent* controllerInventoryInteractionComponent); // DelegateFunction Prospect.YControllerInventoryInteractionComponent.OnInventoryClosed__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
	bool HasValidInventoryInteraction(); // Function Prospect.YControllerInventoryInteractionComponent.HasValidInventoryInteraction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1959ba0
	struct FYPlayerInventory GetPlayerInventory(); // Function Prospect.YControllerInventoryInteractionComponent.GetPlayerInventory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1959810
	struct UYStateInventoryComponent* GetInteractingStateInventoryComponent(); // Function Prospect.YControllerInventoryInteractionComponent.GetInteractingStateInventoryComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1959740
	struct AActor* GetInteractingActorContext(); // Function Prospect.YControllerInventoryInteractionComponent.GetInteractingActorContext // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1905a70
};

// Class Prospect.YControllerInventoryRuntimeComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UYControllerInventoryRuntimeComponent : UActorComponent {
	struct UYPlayerDropComponent* m_cachedDropComponent; // 0xb0(0x08)
	struct FMulticastInlineDelegate OnInventoryFull; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnInventoryWeightChanged; // 0xc8(0x10)
	char pad_D8[0x8]; // 0xd8(0x08)

	bool TryRemoveItem(int32_t targetInventoryComponentId, struct FYInventoryItem itemToRemove, int32_t amountToRemove); // Function Prospect.YControllerInventoryRuntimeComponent.TryRemoveItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x195c8e0
	bool TryRemoveAttachmentFromWeapon(int32_t weaponInventoryComponentId, int32_t targetInventoryComponentId, struct FString weaponItemId, struct FString modItemId, enum class EYPlayerSetType targetSetType, struct FYInventoryItem outInventoryItem, bool dropAttachment, struct FString newlyGeneratedGUID); // Function Prospect.YControllerInventoryRuntimeComponent.TryRemoveAttachmentFromWeapon // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x195c5b0
	bool TryRemoveAllAttachmentsFromWeapon(int32_t weaponInventoryComponentId, int32_t targetInventoryComponentId, struct FString weaponItemId); // Function Prospect.YControllerInventoryRuntimeComponent.TryRemoveAllAttachmentsFromWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x195c490
	bool TryMoveItem(int32_t targetInventoryComponentId, int32_t originInventoryComponentId, struct FYInventoryItem itemToMove, int32_t amountToMove, enum class EYPlayerSetType newSetType, bool ignoreStacking, struct FString newlyGeneratedGUID); // Function Prospect.YControllerInventoryRuntimeComponent.TryMoveItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x195c1e0
	bool TryDropItemAmount(struct FYInventoryItem itemToDrop, int32_t amountToDrop, int32_t inventoryComponentId); // Function Prospect.YControllerInventoryRuntimeComponent.TryDropItemAmount // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x195bf40
	bool TryDropItem(struct FYInventoryItem itemToDrop, int32_t inventoryComponentId); // Function Prospect.YControllerInventoryRuntimeComponent.TryDropItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x195bde0
	bool TryAddNewItem(int32_t targetInventoryComponentId, struct FYInventoryItem itemToAdd, int32_t amountToAdd, enum class EYPlayerSetType targetSetType, enum class EYPlayerSetType originSetType); // Function Prospect.YControllerInventoryRuntimeComponent.TryAddNewItem // (Final|Native|Public|BlueprintCallable) // @ game+0x195bbc0
	bool TryAddItem(int32_t targetInventoryComponentId, struct FYInventoryItem itemToAdd, int32_t amountToAdd, enum class EYPlayerSetType targetSetType, enum class EYPlayerSetType originSetType, bool ignoreStacking, struct FString newlyGeneratedGUID); // Function Prospect.YControllerInventoryRuntimeComponent.TryAddItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x195b910
	bool TryAddAttachmentToWeapon(int32_t weaponInventoryComponentId, int32_t modInventoryComponentId, struct FString weaponItemId, struct FString modItemId, struct FString newlyGeneratedGUID); // Function Prospect.YControllerInventoryRuntimeComponent.TryAddAttachmentToWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0x195b740
	void ServerTryRemoveItem(int32_t targetInventoryComponentId, struct FYInventoryItem itemToRemove, int32_t amountToRemove); // Function Prospect.YControllerInventoryRuntimeComponent.ServerTryRemoveItem // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x195b3e0
	void ServerTryMoveItem(int32_t targetInventoryComponentId, int32_t originInventoryComponentId, struct FYInventoryItem itemToMove, int32_t amountToMove, enum class EYPlayerSetType newSetType, bool ignoreStacking, struct FString newlyGeneratedGUID); // Function Prospect.YControllerInventoryRuntimeComponent.ServerTryMoveItem // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x195b150
	void ServerTryAddItem(int32_t targetInventoryComponentId, struct FYInventoryItem itemToAdd, int32_t amountToAdd, enum class EYPlayerSetType targetSetType, enum class EYPlayerSetType originSetType, bool ignoreStacking, struct FString newlyGeneratedGUID); // Function Prospect.YControllerInventoryRuntimeComponent.ServerTryAddItem // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x195aeb0
	void ServerRemoveAttachmentFromWeapon(int32_t weaponInventoryComponentId, int32_t targetInventoryComponentId, struct FString weaponItemId, struct FString modItemId, enum class EYPlayerSetType targetSetType, bool dropAttachment, struct FString newlyGeneratedGUID); // Function Prospect.YControllerInventoryRuntimeComponent.ServerRemoveAttachmentFromWeapon // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x195a7f0
	void ServerRemoveAllAttachmentsFromWeapon(int32_t weaponInventoryComponentId, int32_t targetInventoryComponentId, struct FString weaponItemId); // Function Prospect.YControllerInventoryRuntimeComponent.ServerRemoveAllAttachmentsFromWeapon // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x195a6c0
	void ServerForceEquipItem(int32_t targetInventoryComponentId, int32_t originInventoryComponentId, struct FYInventoryItem itemToMove, int32_t amountToMove); // Function Prospect.YControllerInventoryRuntimeComponent.ServerForceEquipItem // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x195a4e0
	void ServerDropItemAmount(struct FYInventoryItem inventoryItem, int32_t amountToDrop, int32_t inventoryComponentId); // Function Prospect.YControllerInventoryRuntimeComponent.ServerDropItemAmount // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x195a340
	void ServerClearInventory(int32_t targetInventoryComponentId); // Function Prospect.YControllerInventoryRuntimeComponent.ServerClearInventory // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x194fb20
	void ServerAddAttachmentToWeapon(int32_t weaponInventoryComponentId, int32_t modInventoryComponentId, struct FString weaponItemId, struct FString modItemId, struct FString newlyGeneratedGUID); // Function Prospect.YControllerInventoryRuntimeComponent.ServerAddAttachmentToWeapon // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x195a170
	struct UYStateInventoryComponent* ResolveStateInventoryComponentForId(int32_t componentId, struct FString contextString); // Function Prospect.YControllerInventoryRuntimeComponent.ResolveStateInventoryComponentForId // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x195a080
	void OnAbilityConsumed(struct AActor* Owner, struct FYInventoryItem inventoryItem); // Function Prospect.YControllerInventoryRuntimeComponent.OnAbilityConsumed // (Final|Native|Private|HasOutParms) // @ game+0x1959c30
	void Initialize(); // Function Prospect.YControllerInventoryRuntimeComponent.Initialize // (Final|Native|Private) // @ game+0x1959bd0
	bool ForceEquipItem(int32_t targetInventoryComponentId, int32_t originInventoryComponentId, struct FYInventoryItem itemToMove, int32_t amountToMove); // Function Prospect.YControllerInventoryRuntimeComponent.ForceEquipItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1959500
	struct UYControllerInventoryRuntimeComponent* FindControllerInventoryRuntimeComponent(struct UObject* WorldContext); // Function Prospect.YControllerInventoryRuntimeComponent.FindControllerInventoryRuntimeComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1959470
	void ClientNotifyWeightUpdated(float newWeight); // Function Prospect.YControllerInventoryRuntimeComponent.ClientNotifyWeightUpdated // (Net|Native|Event|Public|NetClient) // @ game+0x19592d0
	void ClientNotifyInventoryFull(); // Function Prospect.YControllerInventoryRuntimeComponent.ClientNotifyInventoryFull // (Net|Native|Event|Public|NetClient) // @ game+0x192fa90
};

// Class Prospect.YControllerItemHoverComponent
// Size: 0xb8 (Inherited: 0xb0)
struct UYControllerItemHoverComponent : UActorComponent {
	struct UYWidget_ItemContainer* m_currentHoveredItemContainer; // 0xb0(0x08)

	void SetHoveredItemContainer(struct UYWidget_ItemContainer* newItemContainer); // Function Prospect.YControllerItemHoverComponent.SetHoveredItemContainer // (Final|Native|Public|BlueprintCallable) // @ game+0x1961d90
	struct UYControllerItemHoverComponent* FindHoverItemComponent(struct AActor* actorContext); // Function Prospect.YControllerItemHoverComponent.FindHoverItemComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19605b0
	void ClearHoveredItemContainer(struct UYWidget_ItemContainer* oldItemContainer); // Function Prospect.YControllerItemHoverComponent.ClearHoveredItemContainer // (Final|Native|Public|BlueprintCallable) // @ game+0x195f8e0
};

// Class Prospect.YControllerKeyboardLightiningComponent
// Size: 0xe8 (Inherited: 0xb0)
struct UYControllerKeyboardLightiningComponent : UActorComponent {
	char pad_B0[0x38]; // 0xb0(0x38)

	void OnPossedPawnDeathStateActivated(); // Function Prospect.YControllerKeyboardLightiningComponent.OnPossedPawnDeathStateActivated // (Final|Native|Protected) // @ game+0x1961220
	void OnPawnStateChanged(struct APawn* oldPawn, struct APawn* newPawn); // Function Prospect.YControllerKeyboardLightiningComponent.OnPawnStateChanged // (Final|Native|Protected) // @ game+0x1960e20
	void OnInputStackChanged(struct TArray<struct UInputComponent*> inputComponents); // Function Prospect.YControllerKeyboardLightiningComponent.OnInputStackChanged // (Final|Native|Protected) // @ game+0x1960be0
	int32_t ForceSpecificColorOnKeyboard(struct AActor* relevantActor, struct FYKeyOverrideColorData Data, bool clearPreviousExplicitColors); // Function Prospect.YControllerKeyboardLightiningComponent.ForceSpecificColorOnKeyboard // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1960760
	bool ForceSpecificActionNameColorOnKeyboard(struct AActor* relevantActor, struct FLinearColor explicitColor, enum class EYInputActionName ActionName); // Function Prospect.YControllerKeyboardLightiningComponent.ForceSpecificActionNameColorOnKeyboard // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1960640
	bool ClearSpecificAnimationKeyboardKeyOverride(struct AActor* relevantActor, enum class EYInputActionName ActionName); // Function Prospect.YControllerKeyboardLightiningComponent.ClearSpecificAnimationKeyboardKeyOverride // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x195f970
	void ClearCompleteKeyboardOverride(struct AActor* relevantActor, int32_t Handle); // Function Prospect.YControllerKeyboardLightiningComponent.ClearCompleteKeyboardOverride // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x195f820
};

// Class Prospect.YControllerPlayerMapMarkerComponent
// Size: 0xe8 (Inherited: 0xb0)
struct UYControllerPlayerMapMarkerComponent : UActorComponent {
	struct FMulticastInlineDelegate OnMarkerDataUpdated; // 0xb0(0x10)
	struct TArray<struct UYMapMarkerData*> m_mapMarkerData; // 0xc0(0x10)
	struct TArray<struct UYMapMarkerData*> m_clientMarkersData; // 0xd0(0x10)
	char pad_E0[0x8]; // 0xe0(0x08)

	void OnUpdateMarkersEvacuationState(enum class EYMapMarkerState newStateForMarkers); // Function Prospect.YControllerPlayerMapMarkerComponent.OnUpdateMarkersEvacuationState // (Final|Native|Protected) // @ game+0x1961520
	void OnRep_MarkerData(); // Function Prospect.YControllerPlayerMapMarkerComponent.OnRep_MarkerData // (Final|Native|Protected) // @ game+0x1961260
	void OnMarkerDataUpdated__DelegateSignature(); // DelegateFunction Prospect.YControllerPlayerMapMarkerComponent.OnMarkerDataUpdated__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1e02480
};

// Class Prospect.YControllerPlayerQuarterComponent
// Size: 0x160 (Inherited: 0xb0)
struct UYControllerPlayerQuarterComponent : UActorComponent {
	char pad_B0[0x18]; // 0xb0(0x18)
	struct FMulticastInlineDelegate OnPlayerQuartersLevelUpdated; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnPlayerTechtreeNodesUpdated; // 0xd8(0x10)
	struct FMulticastInlineDelegate PlayerQuarterPurchaseFailed; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnPlayerQuarterLevelUp; // 0xf8(0x10)
	char pad_108[0x50]; // 0x108(0x50)
	bool m_playerLeveledUp; // 0x158(0x01)
	char pad_159[0x7]; // 0x159(0x07)

	void OnUpgradeCompletedTimer(); // Function Prospect.YControllerPlayerQuarterComponent.OnUpgradeCompletedTimer // (Final|Native|Private) // @ game+0x19615a0
	void OnTechTreeNodesAvailable(struct FString UserId, struct TArray<struct FYTechTreeNodeStatus> techTreeNodes); // Function Prospect.YControllerPlayerQuarterComponent.OnTechTreeNodesAvailable // (Final|Native|Private|HasOutParms) // @ game+0x1961370
	void OnPlayerQuarterUpgradeCompletedTimer(); // Function Prospect.YControllerPlayerQuarterComponent.OnPlayerQuarterUpgradeCompletedTimer // (Final|Native|Private) // @ game+0x1960f90
	void OnPlayerQuartersLevelAvailable(struct FYPlayerQuarterStatus playerQuarterStatus); // Function Prospect.YControllerPlayerQuarterComponent.OnPlayerQuartersLevelAvailable // (Final|Native|Private|HasOutParms) // @ game+0x1960fb0
	void OnPlayerQuarterPurchaseFailed(struct FString Error); // Function Prospect.YControllerPlayerQuarterComponent.OnPlayerQuarterPurchaseFailed // (Final|Native|Private) // @ game+0x1960ef0
	struct UYControllerPlayerQuarterComponent* FindControllerPlayerQuarterComponent(struct AActor* actorContext); // Function Prospect.YControllerPlayerQuarterComponent.FindControllerPlayerQuarterComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1960520
};

// Class Prospect.YControllerQuestComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UYControllerQuestComponent : UActorComponent {
};

// Class Prospect.YControllerReleaseNotesComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UYControllerReleaseNotesComponent : UActorComponent {
	bool m_releaseNotesVisibility; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct FMulticastInlineDelegate OnReleaseNotesVisibilityStateChanged; // 0xb8(0x10)

	void ToggleReleaseNotes(); // Function Prospect.YControllerReleaseNotesComponent.ToggleReleaseNotes // (Final|Native|Public) // @ game+0x1961ec0
};

// Class Prospect.YControllerReplicationComponent
// Size: 0x118 (Inherited: 0xb0)
struct UYControllerReplicationComponent : UActorComponent {
	struct FYPlayerSpawnLocationInfo m_selectedSpawnLocation; // 0xb0(0x20)
	int32_t m_latencySample; // 0xd0(0x04)
	char pad_D4[0xc]; // 0xd4(0x0c)
	struct FMulticastInlineDelegate OnSpawnLocationSet; // 0xe0(0x10)
	struct FMulticastInlineDelegate OnLatencySampleReceived; // 0xf0(0x10)
	struct UYMapMarkerData* m_mapMarkerData; // 0x100(0x08)
	struct FMulticastInlineDelegate BP_OnAnyPlayerDBNOTeleported; // 0x108(0x10)

	void ServerSendLatencySample(); // Function Prospect.YControllerReplicationComponent.ServerSendLatencySample // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1961cb0
	void ServerSendImpactInitialization(struct FYImpactInitializationData impactInitialization); // Function Prospect.YControllerReplicationComponent.ServerSendImpactInitialization // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1961bf0
	void ServerPlayCommWheelEvent(struct AActor* Owner, struct FDataTableRowHandle commWheelEntry); // Function Prospect.YControllerReplicationComponent.ServerPlayCommWheelEvent // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1961ad0
	void ServerFireMeleeSphereHitTraceEntries(struct AActor* Owner, struct TArray<struct FYHitSphereTraceEntry> traceEntries, struct FDataTableRowHandle transportDataTableRow); // Function Prospect.YControllerReplicationComponent.ServerFireMeleeSphereHitTraceEntries // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x1961960
	void ServerFireMeleeHitScanTraceEntry(struct AActor* Owner, struct FYTransportRuntimeInitializationData transportData); // Function Prospect.YControllerReplicationComponent.ServerFireMeleeHitScanTraceEntry // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x19617a0
	void SendNotificationsAllPlayersData(struct UObject* WorldContext, struct FYNotificiationDataRequest notificationData); // Function Prospect.YControllerReplicationComponent.SendNotificationsAllPlayersData // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x19615e0
	void RequestLatencySample(); // Function Prospect.YControllerReplicationComponent.RequestLatencySample // (Final|Native|Public) // @ game+0x19615c0
	void OnRep_SelectedSpawnLocation(); // Function Prospect.YControllerReplicationComponent.OnRep_SelectedSpawnLocation // (Final|Native|Protected|Const) // @ game+0x1961280
	void OnRep_LatencySample(); // Function Prospect.YControllerReplicationComponent.OnRep_LatencySample // (Final|Native|Protected) // @ game+0x1961240
	void OnMatchStateChanged(enum class EYMatchState matchState); // Function Prospect.YControllerReplicationComponent.OnMatchStateChanged // (Final|Native|Protected) // @ game+0x1960cd0
	void MulticastPlayCommWheelEvent(struct AActor* Owner, struct FDataTableRowHandle commWheelEntry); // Function Prospect.YControllerReplicationComponent.MulticastPlayCommWheelEvent // (Net|Native|Event|NetMulticast|Public) // @ game+0x1960970
	void Multicast_ServerFireMeleeHitScanHit(struct AActor* Owner); // Function Prospect.YControllerReplicationComponent.Multicast_ServerFireMeleeHitScanHit // (Net|Native|Event|NetMulticast|Public) // @ game+0x1960a50
	void ClientTriggerOnItemCountUpdate(struct AYPickupActor* pickUpActor, int32_t newItemAmount); // Function Prospect.YControllerReplicationComponent.ClientTriggerOnItemCountUpdate // (Net|Native|Event|Public|NetClient) // @ game+0x1960340
	void ClientShowNotificationData(struct FYNotificiationDataRequest notificationRequest); // Function Prospect.YControllerReplicationComponent.ClientShowNotificationData // (Net|Native|Event|Public|NetClient) // @ game+0x19601b0
	void ClientPlayInventoryMoveAudio(struct AActor* Owner, struct FYInventoryItem Item, enum class EYPlayerSetType targetSetType, enum class EYInventoryAudioActionPerformed actionPerformed); // Function Prospect.YControllerReplicationComponent.ClientPlayInventoryMoveAudio // (Net|Native|Event|Public|NetClient) // @ game+0x195ffd0
	void ClientPlayHitscan(struct FDataTableRowHandle fxCategory, struct FYMulticastHitscanReplicationData replicatedData); // Function Prospect.YControllerReplicationComponent.ClientPlayHitscan // (Net|Native|Event|Public|NetClient) // @ game+0x195fe50
	void ClientPlayClientSideProjectile(struct AActor* Owner, struct TArray<struct FYProjectileInititalizationData> initializationData); // Function Prospect.YControllerReplicationComponent.ClientPlayClientSideProjectile // (Net|Native|Event|Public|NetClient) // @ game+0x195fd60
	void ClientPlayAnnouncementFromDT(struct FDataTableRowHandle rowHandle, struct FYAnnouncementPlaybackOptions playbackOptions); // Function Prospect.YControllerReplicationComponent.ClientPlayAnnouncementFromDT // (Net|Native|Event|Public|NetClient) // @ game+0x195fc30
	void ClientNotifyAPlayerDBNOTeleported(struct FYTeleportData teleportData); // Function Prospect.YControllerReplicationComponent.ClientNotifyAPlayerDBNOTeleported // (Net|Native|Event|Public|NetClient) // @ game+0x195fbb0
	void ClientApplyImpulseOnPlayer(struct FVector Impulse, struct FString Context); // Function Prospect.YControllerReplicationComponent.ClientApplyImpulseOnPlayer // (Net|Native|Event|Public|HasDefaults|NetClient) // @ game+0x195fad0
	void ClientAddImpactInternal(struct FYImpactInitializationData replicatedData); // Function Prospect.YControllerReplicationComponent.ClientAddImpactInternal // (Net|Native|Event|Public|NetClient) // @ game+0x195fa40
	void ApplyImpulseOnPlayer(struct AActor* actorContext, struct FVector Impulse, struct FString Context); // Function Prospect.YControllerReplicationComponent.ApplyImpulseOnPlayer // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x195f6f0
};

// Class Prospect.YControllerSessionComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UYControllerSessionComponent : UActorComponent {
	struct FGuid m_instanceGuid; // 0xb0(0x10)
	char pad_C0[0x8]; // 0xc0(0x08)
	bool m_initiatedTravel; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)

	void ServerReportSessionState(); // Function Prospect.YControllerSessionComponent.ServerReportSessionState // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x18f3bd0
	void OnPlayfabResponseSetTutorialStarted(struct FYAzureFunctionResult azureResult); // Function Prospect.YControllerSessionComponent.OnPlayfabResponseSetTutorialStarted // (Final|Native|Protected|HasOutParms) // @ game+0x1961130
	void OnPlayfabResponseGetTutorialStarted(struct FYAzureFunctionResult azureResult); // Function Prospect.YControllerSessionComponent.OnPlayfabResponseGetTutorialStarted // (Final|Native|Protected|HasOutParms) // @ game+0x1961040
	void OnFinishedMatchResult(enum class EYPlayerMatchFinishedResult Result); // Function Prospect.YControllerSessionComponent.OnFinishedMatchResult // (Final|Native|Protected) // @ game+0x1960b60
	void OnCompletedSessionState(enum class EYSessionEventType completedType); // Function Prospect.YControllerSessionComponent.OnCompletedSessionState // (Final|Native|Protected) // @ game+0x1960ae0
	void ClientReportSessionState(struct FString Output); // Function Prospect.YControllerSessionComponent.ClientReportSessionState // (Net|Native|Event|Protected|NetClient) // @ game+0x1955be0
};

// Class Prospect.YControllerStateInputComponent
// Size: 0x168 (Inherited: 0xb0)
struct UYControllerStateInputComponent : UActorComponent {
	struct FMulticastInlineDelegate OnInputStateChanged; // 0xb0(0x10)
	struct FYStateInputFrameCachedData m_inputData; // 0xc0(0x18)
	char pad_D8[0x50]; // 0xd8(0x50)
	struct UYPlayerCharacterStateComponent* m_characterStateComponent; // 0x128(0x08)
	char pad_130[0x38]; // 0x130(0x38)

	void OnTimeoutBlockMovementInputState(enum class EYInputBlockingAssociation bindingAssociation); // Function Prospect.YControllerStateInputComponent.OnTimeoutBlockMovementInputState // (Final|Native|Protected) // @ game+0x19614a0
	void OnPawnAssigned(struct APawn* oldPawn, struct APawn* newPawn); // Function Prospect.YControllerStateInputComponent.OnPawnAssigned // (Final|Native|Protected) // @ game+0x1960d50
};

// Class Prospect.YControllerStationComponent
// Size: 0x1d0 (Inherited: 0xb0)
struct UYControllerStationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnToggleHudVisibility; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnToggleQuickMenuVisibility; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnToggleStationInventory; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnFactionSet; // 0xe0(0x10)
	float m_onLeftSubMenuFromQuickMenuFadeOutDuration; // 0xf0(0x04)
	float m_onLeftSubMenuFromQuickMenuFadeInDelay; // 0xf4(0x04)
	float m_onLeftSubMenuFromQuickMenuFadeInDuration; // 0xf8(0x04)
	char pad_FC[0xc]; // 0xfc(0x0c)
	struct FYSceneSetupData m_loadoutSetupData; // 0x108(0x18)
	struct FYSceneSetupData m_shopSetupData; // 0x120(0x18)
	struct FYSceneSetupData m_fortunaPassSetupData; // 0x138(0x18)
	struct FYSceneSetupData m_factionICASetupData; // 0x150(0x18)
	struct FYSceneSetupData m_factionKorolevSetupData; // 0x168(0x18)
	struct FYSceneSetupData m_factionOsirisSetupData; // 0x180(0x18)
	struct FYSceneSetupData m_playSetupData; // 0x198(0x18)
	struct AActor* m_currentNPCActor; // 0x1b0(0x08)
	struct FName m_factionSetHandle; // 0x1b8(0x08)
	struct FDataTableRowHandle m_requestedScene; // 0x1c0(0x10)

	void TryFadeFromBlackAfterSubMenuLeftFromQuickMenu(); // Function Prospect.YControllerStationComponent.TryFadeFromBlackAfterSubMenuLeftFromQuickMenu // (Final|Native|Public) // @ game+0x1961f20
