// WidgetBlueprintGeneratedClass WBP_Footer_A_Panel.WBP_Footer_A_Panel_C
// Size: 0x2a8 (Inherited: 0x260)
struct UWBP_Footer_A_Panel_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* ScreenIn_Anim; // 0x268(0x08)
	struct UImage* Gfx_ArrowLarge; // 0x270(0x08)
	struct UImage* Gfx_ArrowLarge_2; // 0x278(0x08)
	struct UImage* Gfx_ArrowSmall; // 0x280(0x08)
	struct UImage* Gfx_FillLeft; // 0x288(0x08)
	struct UImage* Gfx_FillRight; // 0x290(0x08)
	struct UImage* Gfx_Left; // 0x298(0x08)
	struct UImage* Gfx_Right; // 0x2a0(0x08)

	void Construct(); // Function WBP_Footer_A_Panel.WBP_Footer_A_Panel_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1e02480
	void ExecuteUbergraph_WBP_Footer_A_Panel(int32_t EntryPoint); // Function WBP_Footer_A_Panel.WBP_Footer_A_Panel_C.ExecuteUbergraph_WBP_Footer_A_Panel // (Final|UbergraphFunction) // @ game+0x1e02480
};

