// WidgetBlueprintGeneratedClass WBP_Notification_Item.WBP_Notification_Item_C
// Size: 0x2c8 (Inherited: 0x260)
struct UWBP_Notification_Item_C : UUserWidget {
	struct UWidgetAnimation* WidgetOut_Anim; // 0x260(0x08)
	struct UWidgetAnimation* WidgetIn_Anim; // 0x268(0x08)
	struct UImage* Gfx_BackerFill; // 0x270(0x08)
	struct UImage* Gfx_BackerFillColorA; // 0x278(0x08)
	struct UImage* Gfx_BackerFillColorB; // 0x280(0x08)
	struct UImage* Gfx_BackerFillGradient; // 0x288(0x08)
	struct UImage* Gfx_BackerFillLight; // 0x290(0x08)
	struct UImage* Gfx_Chevrons; // 0x298(0x08)
	struct UImage* Icn_NotificationType; // 0x2a0(0x08)
	struct UImage* Icn_NotificationType_Shadow; // 0x2a8(0x08)
	struct URichTextBlock* RichTxt_Headline; // 0x2b0(0x08)
	struct URichTextBlock* RichTxt_Subline; // 0x2b8(0x08)
	struct UWBP_ProgressBar_C* WBP_ProgressBar; // 0x2c0(0x08)
};

