// WidgetBlueprintGeneratedClass WBP_SettingsContent_Video.WBP_SettingsContent_Video_C
// Size: 0x558 (Inherited: 0x340)
struct UWBP_SettingsContent_Video_C : UWBP_SettingsContentBase_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x340(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Antialiasing; // 0x348(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_ColorblindMode; // 0x350(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_DLSSMode; // 0x358(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Foliage; // 0x360(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_FullscreenMode; // 0x368(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Postprocess; // 0x370(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Resolution; // 0x378(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Shadow; // 0x380(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Texture; // 0x388(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_ViewDistance; // 0x390(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_VisualEffects; // 0x398(0x08)
	struct UWBP_Dropdown_Btn_C* WBP_Dropdown_VideoQuality_Btn; // 0x3a0(0x08)
	struct UWBP_Selector_Btn_C* WBP_Selector_Btn_ColorblindIntensity; // 0x3a8(0x08)
	struct UWBP_Selector_Btn_C* WBP_Selector_Btn_Fov; // 0x3b0(0x08)
	struct UWBP_Selector_Btn_C* WBP_Selector_Btn_Gamma; // 0x3b8(0x08)
	struct UWBP_Selector_Btn_C* WBP_Selector_Btn_MaxFps; // 0x3c0(0x08)
	struct UWBP_Selector_Btn_C* WBP_Selector_Btn_ResolutionQuality; // 0x3c8(0x08)
	struct UWBP_Selector_Btn_C* WBP_Selector_Btn_UIScale; // 0x3d0(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_AntiAliasingQuality; // 0x3d8(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_AutoDetect; // 0x3e0(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ColorblindMode; // 0x3e8(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_CorrectDeficiency; // 0x3f0(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_CrashDebugging; // 0x3f8(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_DLSSMode; // 0x400(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_FoilageQuality; // 0x408(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_FOV; // 0x410(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_FullscreenMode; // 0x418(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_Gamma; // 0x420(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ImageSharpening; // 0x428(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_MaxFPS; // 0x430(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_MotionBlur; // 0x438(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_MultiThreadRendering; // 0x440(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_PostProcessQuality; // 0x448(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_Resolution; // 0x450(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ResolutionQuality; // 0x458(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ShadowQuality; // 0x460(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ShowFPS; // 0x468(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_TextureQuality; // 0x470(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_UIScale; // 0x478(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_VideoQuality; // 0x480(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ViewDistanceQuality; // 0x488(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_VisualEffectsQuality; // 0x490(0x08)
	struct UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_VSync; // 0x498(0x08)
	struct UWBP_SettingSectionHeader_Item_C* WBP_SettingSectionHeader_Accessibility; // 0x4a0(0x08)
	struct UWBP_SettingSectionHeader_Item_C* WBP_SettingSectionHeader_VideoQuality; // 0x4a8(0x08)
	struct UWBP_SettingSectionHeader_Item_C* WBP_SettingSectionHeader_VideoQuality_2; // 0x4b0(0x08)
	struct UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_AutoDetect; // 0x4b8(0x08)
	struct UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_GpuCrashDebugging; // 0x4c0(0x08)
	struct UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_ImageSharpening; // 0x4c8(0x08)
	struct UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_MotionBlur; // 0x4d0(0x08)
	struct UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_MultithreadedRendering; // 0x4d8(0x08)
	struct UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_ShowFps; // 0x4e0(0x08)
	struct UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_Vsync; // 0x4e8(0x08)
	struct FText Label; // 0x4f0(0x18)
	struct TMap<struct FString, enum class EYGfxQualityPreset> GFXSettings; // 0x508(0x50)

	void UpdateDLSS(); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.UpdateDLSS // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void UpdateRegisteredWidgets(); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.UpdateRegisteredWidgets // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void UpdateAutoDetect(); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.UpdateAutoDetect // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void UpdateColorblindMode(); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.UpdateColorblindMode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void Initialize(); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.Initialize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void UpdateFullscreenMode(); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.UpdateFullscreenMode // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void Provider_OnDataChanged(struct FName DataName, struct FName dataType); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.Provider_OnDataChanged // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void UpdateResolutions(); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.UpdateResolutions // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void RegisterWidgets(); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.RegisterWidgets // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1e02480
	void GetGfxQualityLevelName(enum class EYGfxQualityPreset Preset, struct FString Output); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.GetGfxQualityLevelName // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1e02480
	void BndEvt__WBP_ToggleText_Btn_145_K2Node_ComponentBoundEvent_2_OnToggleChanged__DelegateSignature(struct UWBP_ToggleText_Btn_C* Toggle, bool toggled); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_ToggleText_Btn_145_K2Node_ComponentBoundEvent_2_OnToggleChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_ToggleText_Btn_247_K2Node_ComponentBoundEvent_3_OnToggleChanged__DelegateSignature(struct UWBP_ToggleText_Btn_C* Toggle, bool toggled); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_ToggleText_Btn_247_K2Node_ComponentBoundEvent_3_OnToggleChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_ToggleText_Btn_297_K2Node_ComponentBoundEvent_4_OnToggleChanged__DelegateSignature(struct UWBP_ToggleText_Btn_C* Toggle, bool toggled); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_ToggleText_Btn_297_K2Node_ComponentBoundEvent_4_OnToggleChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_ToggleText_Btn_450_K2Node_ComponentBoundEvent_5_OnToggleChanged__DelegateSignature(struct UWBP_ToggleText_Btn_C* Toggle, bool toggled); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_ToggleText_Btn_450_K2Node_ComponentBoundEvent_5_OnToggleChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_ToggleText_Btn_556_K2Node_ComponentBoundEvent_6_OnToggleChanged__DelegateSignature(struct UWBP_ToggleText_Btn_C* Toggle, bool toggled); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_ToggleText_Btn_556_K2Node_ComponentBoundEvent_6_OnToggleChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_ToggleText_Btn_67_K2Node_ComponentBoundEvent_1_OnToggleChanged__DelegateSignature(struct UWBP_ToggleText_Btn_C* Toggle, bool toggled); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_ToggleText_Btn_67_K2Node_ComponentBoundEvent_1_OnToggleChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_Antialiasing_K2Node_ComponentBoundEvent_7_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_Antialiasing_K2Node_ComponentBoundEvent_7_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_ColorblindMode_K2Node_ComponentBoundEvent_8_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_ColorblindMode_K2Node_ComponentBoundEvent_8_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_Foliage_K2Node_ComponentBoundEvent_9_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_Foliage_K2Node_ComponentBoundEvent_9_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_FullscreenMode_K2Node_ComponentBoundEvent_10_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_FullscreenMode_K2Node_ComponentBoundEvent_10_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_Postprocess_K2Node_ComponentBoundEvent_11_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_Postprocess_K2Node_ComponentBoundEvent_11_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_Resolution_K2Node_ComponentBoundEvent_12_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_Resolution_K2Node_ComponentBoundEvent_12_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_Shadow_K2Node_ComponentBoundEvent_13_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_Shadow_K2Node_ComponentBoundEvent_13_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_Texture_K2Node_ComponentBoundEvent_14_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_Texture_K2Node_ComponentBoundEvent_14_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_ViewDistance_K2Node_ComponentBoundEvent_15_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_ViewDistance_K2Node_ComponentBoundEvent_15_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_Btn_VisualEffects_K2Node_ComponentBoundEvent_16_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_Btn_VisualEffects_K2Node_ComponentBoundEvent_16_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Dropdown_VideoQuality_Btn_K2Node_ComponentBoundEvent_17_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Dropdown_VideoQuality_Btn_K2Node_ComponentBoundEvent_17_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_ToggleText_Btn_K2Node_ComponentBoundEvent_0_OnToggleChanged__DelegateSignature(struct UWBP_ToggleText_Btn_C* Toggle, bool toggled); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_ToggleText_Btn_K2Node_ComponentBoundEvent_0_OnToggleChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Selector_Btn_ColorblindIntensity_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature(struct UWBP_Selector_Btn_C* selector, struct FStructure_SelectorData Value); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Selector_Btn_ColorblindIntensity_K2Node_ComponentBoundEvent_18_OnValueChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Selector_Btn_Fov_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature(struct UWBP_Selector_Btn_C* selector, struct FStructure_SelectorData Value); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Selector_Btn_Fov_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Selector_Btn_Gamma_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature(struct UWBP_Selector_Btn_C* selector, struct FStructure_SelectorData Value); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Selector_Btn_Gamma_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Selector_Btn_MaxFps_K2Node_ComponentBoundEvent_21_OnValueChanged__DelegateSignature(struct UWBP_Selector_Btn_C* selector, struct FStructure_SelectorData Value); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Selector_Btn_MaxFps_K2Node_ComponentBoundEvent_21_OnValueChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_Selector_Btn_ResolutionQuality_K2Node_ComponentBoundEvent_22_OnValueChanged__DelegateSignature(struct UWBP_Selector_Btn_C* selector, struct FStructure_SelectorData Value); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_Selector_Btn_ResolutionQuality_K2Node_ComponentBoundEvent_22_OnValueChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_SettingsContent_Video_WBP_Selector_Btn_ApplicationScale_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature(struct UWBP_Selector_Btn_C* selector, struct FStructure_SelectorData Value); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_SettingsContent_Video_WBP_Selector_Btn_ApplicationScale_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void BndEvt__WBP_SettingsContent_Video_WBP_Dropdown_Btn_DLSSMode_K2Node_ComponentBoundEvent_24_OnSelectedOptionDelegate__DelegateSignature(struct UWBP_DropdownBase_Btn_C* Dropdown, struct FString Option, int32_t Index); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.BndEvt__WBP_SettingsContent_Video_WBP_Dropdown_Btn_DLSSMode_K2Node_ComponentBoundEvent_24_OnSelectedOptionDelegate__DelegateSignature // (BlueprintEvent) // @ game+0x1e02480
	void ExecuteUbergraph_WBP_SettingsContent_Video(int32_t EntryPoint); // Function WBP_SettingsContent_Video.WBP_SettingsContent_Video_C.ExecuteUbergraph_WBP_SettingsContent_Video // (Final|UbergraphFunction|HasDefaults) // @ game+0x1e02480
};

